[
  {
    "id": "2ae51026-c1db-4d8b-a05e-17f9496d1877",
    "company": "Capital Regional District",
    "location": "Victoria, BC",
    "position": "Project Engineer Enterprise Asset Management - Corporate Asset and Maintenance Management",
    "postedDate": "9 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105464",
    "source": "CivicJobs BC",
    "description": "Capital Regional District\n\nProject Engineer Enterprise Asset Management - Corporate Asset and Maintenance Management\n\n\nReq ID: 1445 \nBusiness Unit: Infrastructure and Water Services \nDivision: Corporate Asset and Maintenance Mgmt\nRegular/ Auxiliary: Regular\nRate of Pay: $58.76 - $65.98 per hour \nHours of Work: 70 hours bi-weekly\nPosting Date: June 16, 2025\nClosing Date: Open until filled, submission review to begin on July 4, 2025\n \nSummary\nThe Capital Regional District (CRD) serves as the regional government for 13 municipalities and three electoral areas across the stunning southern Vancouver Island and the Gulf Islands. We offer a workplace where employees can reach their full potential, engage in meaningful work, and build lasting connections with colleagues and communities.\n \nInfrastructure & Water Services plays a vital role in ensuring safe drinking water and fostering a resilient water supply, alongside the efficient management of the region’s wastewater systems. The CRD is embarking on exciting initiatives such as the Regional Water Supply Master Plan and the Core Area Wastewater Program—projects that will shape the future of water and wastewater services for generations to come. The Regional Water Supply Master Plan alone recommends critical projects to be implemented over the next 30 years, presenting significant opportunities for those committed to innovation, sustainability, and community impact.\n \nIf you're passionate about contributing to vital infrastructure projects, supporting operational efficiency, and enhancing the well-being of our communities, we invite you to join our team. Here, you'll be part of a group of dedicated professionals working on high-impact projects that make a tangible difference in the lives of the people we serve. Be part of something special—an opportunity to work in one of the most beautiful places on Earth while contributing to the future of water and wastewater services.\n \nThe Project Engineer, Enterprise Asset Management (EAM) leads and supports projects for the EAM program, including the planning, design, procurement, implementation, and optimization of software and processes for asset information collection and reporting. The Project Engineer, EAM is part of a collaborative and multi-disciplinary team advancing asset management initiatives for the organization. The initial focus of this position is to plan and implement asset and work management software for water and wastewater services. This position reports to the Manager, Asset Management within the Corporate Asset and Maintenance Management Division, which provides centralized asset management functions for the organization.\n\nKey Duties & Responsibilities\n\nLead EAM projects, including planning, design, implementation, and optimization of software and processes for asset information collection and reporting.\nMonitor and report on the roadmap and timeline for phased project implementation and ongoing continuous improvements of EAM across the organization.\nAct as the primary contact with consultants and external stakeholders; provide contract oversight and administration, including overseeing, directing, liaising and negotiating with contractors and consultants.\nFollow project management principles to lead and deliver projects within the EAM program; develop, implement and oversee project related scope of work, schedules and budgets. \nPrepare reports and memos on program updates for project sponsors and stakeholders; present updates as required.\nIn partnership with divisional staff, develop and implement standards and processes to identify and collect asset information throughout the asset life cycle for capital planning, capital project delivery, financial reporting, and operation and maintenance activities.\nReview and assess existing asset information to evaluate data quality, accuracy, and completeness as well as data storage and maintenance, and advise on continuous improvement measures in alignment with EAM program. \nProvide professional and technical expertise, guidance and direction on EAM program activities; act as a resource to staff members on EAM related matters.\nProvide guidance and direction for EAM training, including technical support to staff using EAM software.\nLead and/or assist services to implement and optimize EAM solutions based on corporate standards and guidelines.\nLead and support the completion of actions and targets within the Corporate Asset Management Strategy, as assigned.\nExplain difficult concepts and persuade others to adopt a point of view and actively works to encourage teamwork, collaboration, and efficiency.\nIdentify data and functional requirements for EAM that serve the needs of all functions using asset information.\nPrepare written reports and presentations that can be understood by internal/external stakeholders.\nFollow all policies, procedures and standards of the CRD.\nPerform other related duties as required.\n\n\nAdditional Information\n\nNone\n\n\nKey Skills & Abilities\n\nExcellent verbal and written communication skills, including the ability to build and maintain strong and effective relationships.\nStrategic and analytical thinking, problem solving abilities, and time management skills. \nDemonstrated experience in project management delivering complex and diverse initiatives.\nStrong knowledge of computerized data processing and analysis.\nAbility to create comprehensive project plans, including scope, schedule, budget, resources, and risk management strategies.\nDemonstrated experience with collaboration, diplomacy, strong communication and relationship building skills to maintain highly engaged multi-disciplinary project teams.\nMotivates, supports and empowers others to achieve organizational and asset management goals.\nProficiency and experience working with a variety of software such as Excel, PowerBI, ArcGIS, SAP and EAM solutions. \nExcellent presentation skills with demonstrated ability to communicate complex, technical information to non-technical and technical audiences.\nAbility to conceptualize and analyze problems from different viewpoints and utilize big picture thinking with a service-oriented mindset.\nKnowledge of change management methods (e.g., Prosci-ADKAR).\n\n\nQualifications\n\nDegree in a related discipline\nA minimum of 10 years' directly related experience\n\n\nCertifications\n\nProfessional engineering (P.Eng.) designation with Engineers and Geoscientists British Columbia (EGBC) or eligibility for designation.\nValid BC Driver's Licence Class 5\n\n\nAPPLICATIONS\nTo apply for this exciting opportunity, please visit our careers site https://www.crd.bc.ca/about/careers and click \"Apply now\" on the Project Engineer Enterprise Asset Management to submit your resume and covering letter online.\n\nWe welcome all qualified applicants to apply and may consider a combination of experience, education and/or training where possible. \n\nThe Capital Regional District wishes to thank you for your interest and advises that only those candidates under active consideration will be contacted."
  },
  {
    "id": "1bb3f801-7541-4303-aaf9-4a72e14f5774",
    "company": "City of Maple Ridge",
    "location": "Maple Ridge, BC",
    "position": "Aquatic Services Attendant",
    "postedDate": "9 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105463",
    "source": "CivicJobs BC",
    "description": "City of Maple Ridge\n\nAquatic Services Attendant\n\n\nCompetition # 25-093                                                                                                                                                                 \nStatus: Auxiliary (CUPE)\nDepartment:  Recreation Services\nSalary: $21.46 per hour\nClosing: June 29, 2025\n \nWe strive for excellence as we deliver vital municipal services with innovation, accountability and efficiency to meet the needs of the community now and into the future. Be part of our story. Come grow with us! \n\nMake a Splash This Summer! Become an Aquatic Services Attendant!  Are you ready to dive into a fun, fast-paced job? We’re looking for energetic, enthusiastic, and safety-savvy individuals to join our team as Aquatic Services Attendants!\n \nIn this role, you will be providing support to programs and services at a supervised aquatic facility. The position oversees the safe use of pool features, such as the waterslide, and leads aquatic games and activities.  The Aquatic Services Attendant will support swim lessons and aquatic programs, help set up equipment and supplies, and step in with basic first aid emergencies and performs minor cleaning duties.  This is a hands-on, people-focused role where your energy, attentiveness, and enthusiasm will shine. You’ll work under the guidance of a supervisor who will support your growth and evaluate your performance based on service quality, safety, and your ability to make each patron’s visit a great one.\n \nEDUCATION AND EXPERIENCE\nGrade 10 Education and some related experience working with the public; or an equivalent combination of training and experience.\n \nKNOWLEDGE, SKILLS AND ABILITIES\n\nSome knowledge and familiarity with aquatic programs and services.\nAbility to make decisions and enforce rules and regulations in a confident and tactful manner.\nAbility to communicate effectively in a positive and diplomatic manner.\nAbility to be creative and lead games for a variety of age groups and abilities.\nAbility to effectively communicate with the public and other aquatic staff in emergency situations.\nAbility to provide safe operation and supervision of play equipment and features, such as waterslides, pool toys and games.\nAbility to perform duties for extended periods of time.\nAbility to effectively perform minor water rescue.\nAbility to work in a humid environment and under varying weather conditions.\n\n\n \nLICENCES AND CERTIFICATES\n\nLifesaving Society - Bronze Cross (BC) (current within 2 years)\nStandard First Aid with CPR Level C & Automated External Defibrillator (AED) (current within 3 years)\n\n \nHOURS OF WORK:\nThis is an auxiliary position with no ongoing regular schedule of hours.\n \nADDITIONAL INFORMATION\nMust be at least 15 years old at the time of the application.\n\nContinuous intake of qualified candidates will occur throughout the posting. A Police Information Check is a requirement of the position.  A clearance requires the absence of any criminal charges or convictions related to this position. \n \nEQUITY STATEMENT\nAt the City of Maple Ridge, we are dedicated to cultivating an inclusive culture that actively values and embraces diversity. We strive to attract and retain a talented, diverse workforce that is broadly reflective of the community we proudly serve. Accommodations are available on request for candidates taking part in all aspects of the selection process by contacting recruitment@mapleridge.ca.\n\nWHAT WE OFFER YOU\nThe City of Maple Ridge is a great place to work with competitive compensation packages that include the Municipal Pension Plan, a strong employee wellness program and the opportunity for professional career growth and professional development. If you want to help shape a growing community in a municipality that strives for service excellence, then this is the position for you.\n\nWe thank all applicants for their interest, however, only those under consideration will be contacted.\n\nAPPLYT NOW"
  },
  {
    "id": "0ae4b877-3b07-4c4a-b02e-8bff4fc70f1d",
    "company": "Town of Smithers",
    "location": "Smithers, BC",
    "position": "Clerk II - Development Services",
    "postedDate": "9 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105462",
    "source": "CivicJobs BC",
    "description": "Clerk II - Development Services\n\n\nINTERNAL/EXTERNAL\nUnionized Job Vacancy\nCompetition #25-13\n\nPOSITION TITLE: Clerk II - Development Services\nDEPARTMENT: Development Services\nHOURS OF WORK: 35 hours per week, Monday to Friday, 8:30 a.m. – 4:30 p.m.\nPOSTING DATE: June 16, 2025\nCLOSING DATE: June 30, 2025\nHOURLY RATE: $31.30 (2025)\n\nSurrounded by mountain ranges, Smithers is a northern gem, nestled at the base of Hudson Bay Mountain. With a population of 5,400, it is a service hub for a surrounding region comprising of a population of approximately 15,000.\n\nResidents enjoy four seasons of recreational activities; in addition to a ski hill within a half an hour of town, the region offers word-class fishing, backcountry and cross-country skiing, hunting, golfing and alpine trails for hiking and horseback riding coupled with a lively music scene, Art Gallery, Museum, theatrical performances, and an energetic sporting community.\n\nGENERAL STATEMENT OF DUTIES:\nReporting to the Director of Development Services, the Clerk II – Development Services assumes Development Services administrative and other duties including, but not limited to, providing assistance and recommendations on bylaws, policies, and procedures; accepting, reviewing and filing applications for various development including licenses and permits; departmental reporting and statistics for the Town, other municipalities, entities and the Federal Government; updating insurance for encroachments and license of occupations; file management; preparing Committee agendas and minutes, and other work of complex and confidential nature.\n\nQUALIFICATIONS:\n\nHighschool graduation.\nTwo years of experience providing administrative support, one of which in Local Government.\nAn equivalent combination of education, training, and experience may be considered.\n\n\nPERKS AND BENEFITS:\nThe Town of Smithers offers a comprehensive benefits package, Municipal Pension Plan, Medical Travel Plan, and 3 weeks (15 days) of paid vacation for the first year worked.\n\nFurther information, including a complete job description, is available on the Town of Smithers website: www.smithers.ca.\n \nTesting may be required during the interview process. Testing will be based on the knowledge, skills, abilities and qualifications outlined in the job descriptions.\n \nQualified candidates may forward their application package including cover letter, resume and three references, quoting Competition #25-13, no later than 4:00 p.m., Monday, June 30, 2025.\n\nApplications may be forwarded to:\nHuman Resources\nConfidential: Competition #25-13\ncareers@smithers.ca\nTown of Smithers\nBox 879, 1027 Aldous Street\nSmithers, BC V0J 2N0\n\nFull Job Description\n\nThe Town of Smithers thanks all applicants in advance for their interest; however, only those candidates selected for an interview will be contacted.\n \nThe Town of Smithers is an equal opportunity employer committed to establishing an inclusive, equitable, and accessible environment for all. All qualified applicants will receive consideration for employment without regard to race, national origin, age, sex, religion, disability, sexual orientation, gender identity or expression, marital status or any other basis protected by applicable law."
  },
  {
    "id": "497821c6-ba83-4e79-81e3-e94ef4ff6d71",
    "company": "Westbank First Nation",
    "location": "Kelowna, BC",
    "position": "Water and Wastewater Operator III",
    "postedDate": "9 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105461",
    "source": "CivicJobs BC",
    "description": "WFN fosters a workplace environment that is diverse, inclusive, collaborative, healthy, and reflective of Syilx values and culture.\nWater and Wastewater Operator III\n\nFull Time\n\nWho We Are\nLocated within the traditional unceded territory of the syilx people, Westbank First Nation (WFN) is a progressive and prosperous self-governing First Nation. WFN is dedicated to promoting a healthy and prosperous future to ensure its continued existence as a strong political, social and cultural community.\n\nWestbank First Nation values Equality, Honesty and Fairness, Respect, Integrity, Accountability and Transparency, Sustainability, Understanding, Confidentiality and Efficiency.\n\nAbout this Opportunity\nUnder the direction of the Working Foreperson, the Water and Wastewater Operator Level III is responsible for performing tasks related to the installation and operation of the water distribution, water treatment, and wastewater collection systems. Responsibilities also include ensuring work is performed safely and in adherence to established work standards.\n\nWant to know more? You will…\n\nParticipate in the planning, prioritizing, and review of the operational, maintenance and repair work needed at the beginning of each year\nEvaluate operations and activities; recommends improvements and modifications; prepares and/or reviews various reports on operation and activities\nRespond and addresses all public concerns pertaining to the water and wastewater system in a courteous and professional manner\nMonitor water and wastewater facilities and equipment for needed maintenance and repairs; also inspects the work safety of staff while in progress; provides leadership and assistance when needed\nMaintain time, material and equipment as part of the preventative maintenance program\nAuthorize/inspect connections to Water/Wastewater systems as outlined in the WFN Waterworks/Waste Water Law\nEnforce infractions and violations to the WFN laws for the Waterworks/Wastewater infrastructures\nBe a part of the rotating on-call schedule is required for this position which includes responding to after hour calls within a 20-minute response time and takes corrective action as required\n\n\nMust Haves:\n\nEOCP Water Distribution Operator’s Certificate (Level III)\nEOCP Waste Water Collection Operator’s Certificate (Level I)\nEOCP Water Treatment Certificate (Level III)\nFirst-aid Certificate (Level I)\nTransportation of Dangerous Goods Certificate\nWorkplace Hazardous Material Information System (WHMIS)\nBCWWA Current Cross Connection Control Backflow Device Testing Certificate\nValid Class 5 BC Driver’s License and Acceptable Driver’s Abstract\n\n\nPerks of Working at WFN:\n\nCompetitive compensation package including 3 weeks’ vacation\nExtended Health Care (including Vision and Paramedical Services), Dental, Basic Life Insurance, Employee Assistance Program, and Health Spending Account\nMunicipal Pension Plan membership\nAccess to Big White Season Passes (Summer & Winter)\nEmployee Recognition Program\nAccess to LinkedIn Learning for Professional Development\n\n\nThe median salary for this position is $80,947\n\nApplication Details:\nTo review the full job description and to learn more about Westbank First Nation please visit our website at https://www.wfn.ca.\n \nAll applications must be submitted through our Employment Opportunities page. Ensure you attach your cover letter and resume. Incomplete or late submissions will not be accepted.\n \nThis opportunity will close on Sunday, July 6th, 2025."
  },
  {
    "id": "14f176fa-4b27-46ed-8968-af5f7dc31c7e",
    "company": "Westbank First Nation",
    "location": "Kelowna, BC",
    "position": "Water & Wastewater Operator II",
    "postedDate": "10 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105460",
    "source": "CivicJobs BC",
    "description": "WFN fosters a workplace environment that is diverse, inclusive, collaborative, healthy, and reflective of Syilx values and culture.\nWater & Wastewater Operator II\n\nFull Time\n\nWho We Are\nLocated within the traditional unceded territory of the syilx people, Westbank First Nation (WFN) is a progressive and prosperous self-governing First Nation. WFN is dedicated to promoting a healthy and prosperous future to ensure its continued existence as a strong political, social and cultural community.\n\nWestbank First Nation values Equality, Honesty and Fairness, Respect, Integrity, Accountability and Transparency, Sustainability, Understanding, Confidentiality and Efficiency.\n\nAbout this Opportunity\nUnder the direction of the Working Foreperson, the Water and Wastewater Operator Level II is responsible for performing tasks related to the installation, operation and repairs of the water distribution, water treatment, and wastewater collection systems\n\nWant to know more? You will… \n\nPerforms scheduled maintenance of all waterworks and sewage collection system components\nSupports the water sampling program when necessary by taking water samples and interpreting results\nEnsures work is performed safely and in adherence to established work standards\nComplies with all applicable safety regulations and procedures\nRegularly monitors gauges, meters, and control panels and adjusts any variations within the operating conditions of the system, if/when necessary, under the advisement of senior operator\nEnsures the safe operation and maintenance of all related tools and equipment \n\n\nMust Haves:\n\nOne year of recent experience at a Class 2 or higher distribution/treatment facility\nEOCP Water Distribution Operator’s Certificate (Level 2)\nEOCP Water Treatment Operator’s Certificate (Level 2)\nWaste Water Collection Operator’s Certificate (Level 1)\nChlorine Handling Certificate\nKnowledge of SCADA systems\n\n\nPerks of Working at WFN:\n\nCompetitive compensation package including 3 weeks’ vacation\nExtended Health Care (including Vision and Paramedical Services), Dental, Basic Life Insurance, Employee Assistance Program, and Health Spending Account\nMunicipal Pension Plan membership\nAccess to Big White Season Passes (Summer & Winter)\nEmployee Recognition Program\nAccess to LinkedIn Learning for Professional Development\n\n\nThe median salary for this position is: $71,405\n\nApplication Details:\nTo review the full job description and to learn more about Westbank First Nation please visit our website at https://www.wfn.ca.\n \nAll applications must be submitted through our Employment Opportunities page. Ensure you attach your cover letter and resume. Incomplete or late submissions will not be accepted.\n \nThis opportunity will close at midnight on Sunday, July 6, 2025."
  },
  {
    "id": "e294eb64-55b1-4dfc-bdca-33079ac2d7cf",
    "company": "City of North Vancouver",
    "location": "North Vancouver, BC",
    "position": "PRIME Reviewer",
    "postedDate": "10 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105459",
    "source": "CivicJobs BC",
    "description": "City of North Vancouver\n\nPRIME Reviewer\n\n\nRegular Full-time\n\nThe City of North Vancouver is the urban core of the beautiful North Shore and has a long-term vision to be “The Healthiest Small City in the World”, with five key priorities to be a City for People, a Liveable City, a Vibrant City, a Connected City and a Prosperous City.\n \nPolice Support Services is looking for regular full-time PRIME Reviewers in the Records Section to join their team.\n \nReporting to the Records Supervisor, you will be responsible for maintaining police files and databases by:\n\nClassifying and scoring (coding) information on police files, verifying validity and completeness of codes already entered\nEntering and amending information in relevant databases\nMaintaining departmental records\nReading new police files to determine appropriate processing\nDistributing mail and preparing outgoing mail\n\n \nYour net typing speed is 50 words per minute, you are willing to work shifts consisting of up to 11 hours in length, and you have data entry experience.  Some related experience, preferably within a law enforcement environment, would be an asset.\n \nYou will be required to obtain and maintain an RCMP security clearance as a condition of ongoing employment.\n \nShortlisted candidates may be required to complete standardized tests or exercises to demonstrate their applicable skills and knowledge.\n \nSalary:\n$29.48 to $34.63 per hour\n(Pay Grade 15 - January 2024 rates)\n \nHours of Work:\nShift work (4 shifts followed by 4 days off) including evenings, weekends and statutory holidays.\n \nIf you are passionate about making the City of North Vancouver an even greater place to live, work and play, apply on-line through the Career Portal at www.cnv.org by Tuesday, June 24, 2025.\n \nThank you for your interest in the City of North Vancouver.\n \nPosting: 2025-0077"
  },
  {
    "id": "2c7f89b2-0ec7-4c00-87f9-e463afad69f4",
    "company": "Westbank First Nation",
    "location": "Kelowna, BC",
    "position": "Water & Wastewater Operator I",
    "postedDate": "10 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105458",
    "source": "CivicJobs BC",
    "description": "WFN fosters a workplace environment that is diverse, inclusive, collaborative, healthy, and reflective of Syilx values and culture.\nWater & Wastewater Operator I\n\n\nJOB TITLE:\nWater & Wastewater Operator I\n\nDEPARTMENT:\nUtilities\n\nLOCATION:\nUtilities Russel Building\n\nSUPERVISOR:\nWorking Foreperson\n\nREMOTE WORK:\nNot Eligible\n\nLEVEL:\n 6\n\nPOSITION SUMMARY\nThe Water and Wastewater Operator Level I is responsible for performing tasks related to the installation, operation and repairs of the water distribution, water treatment, and wastewater collection systems.\n\nEDUCATION/EXPERIENCE\n\nGIS Training Level 1\nEOCP Chlorine Handling Certificate\nTransportation of Dangerous Goods Certificate\nHydrant Maintenance\nExcavation Safety\nConfined Space Awareness\nWHIMIS Certificate\nFall arrest training\nConfined space entry\nValid Class 1 or Class 3 BC Driver’s License with Air Brake endorsement\n\n \nREQUIREMENTS\n\nEOCP Water Distribution Operator’s Certificate (Level 1)\nEOCP Waste Water Collection Operator’s Certificate (Level 1)\nMinimum Grade XII or an equivalent.\nValid Class 5 BC Driver’s License and an annual driver’s abstract in excellent standing which is to be submitted annually\nKnowledge of computer basics (Word and Excel).\nTraining in computerized database management, spreadsheets, and word processing.\nKnowledge of SCADA systems.\nMinimum First-aid training (Level 1) St. John Ambulance or alternate.\nKnowledge of plan reading, pipe locating, and hydrant maintenance \nCriminal Record Check with results acceptable to WFN\nMaintains a high level of confidentiality and uses discretion on all matters relating to the affairs of the Westbank First Nation.\n\n \nJOB DUTIES/RESPONSIBILITIES\n\nMaintains all inventories and records for the water and sewer utility.\nAssists with scheduled maintenance of all waterworks, storm drainage, and sewage collection system components.\nAssists with sanitary sewer service installations.\nParticipates in the water-quality monitoring program for both the WFN waterworks systems.\nCollects samples and performs routine field analysis.\nPerforms basic water quality tests using field test kits.\nChanges chlorine tonners under supervision.\nComplies with all applicable safety regulations and procedures under Work Safe BC.\nMonitors gauges, meters, and control panels and observes variations in operating conditions.\nBuilds strong working relationships with Development Services department, and other water and sewer utilities within the area.\nAssists in responding to public complaints or concerns in all aspects of the waterworks and wastewater collection systems.\nMonitors and assists in excavation and backfilling of material prior to installation or for the repair of any described.\nOperates valves and gates either manually or by remote control.\nMaintains shift logs and record meter and gauge readings.\nPerforms routine maintenance functions and custodial duties\nOperates power generating equipment.\nCarries out other operator duties as may be required or assigned by supervisor.\nPerforms other related duties and responsibilities as required.\nPerforms all duties and responsibilities in accordance with the Westbank First Nation policies, standards and procedures.\nBeing part of the rotating on-call schedule is required for this position which includes responding to after hour calls within a 20 minute response time and takes corrective action as required.\n\n \nKNOWLEDGE/SKILLS/ABILITIES\n\nKnowledge of Water distribution and Wastewater collection systems.\nDemonstrated mechanical aptitude and ability to work well with tools.\nDemonstrated ability to troubleshoot, assess and report Water distribution and Wastewater collection systems problem to senior operators for corrective action.\nKnowledge of water and wastewater systems instrumentation and data collection.\nKnowledge of water quality issues as they apply to the WFN waterworks system.\nKnowledge of computer programs including Excel, Word, AutoCAD, and Arc View. \nAvailability to work overtime when required and to be on standby.\nAbility to work cooperatively with other departments.\nAbility to work independently or within a team structure.\nStrong interpersonal and communication skills (both oral and written).\nHave basic SCADA knowledge to be able to use WFN supplied laptop computer for SCADA system and alarm monitoring.\nAbility to work in inclement weather.\nPhysically able to lift up to 50 lbs.\nDesire and ability to attend training seminars or upgrading of existing skills as required.\nDependable and reliable.\nComfortable dealing with Membership and the public.\n\n \nDisclaimer: This position description is not an employment agreement or contract. This describes the principal duties and responsibilities of the position and does not imply that they are the only duties performed. Management has the exclusive right to alter this job description at any time without notice."
  },
  {
    "id": "16bd2415-d3fe-4bf5-9fb3-5ac03bb8c580",
    "company": "Surrey Police Service",
    "location": "Surrey, BC",
    "position": "Clerk 3 – Fleet",
    "postedDate": "10 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105457",
    "source": "CivicJobs BC",
    "description": "Surrey Police Service\nClerk 3 – Fleet\n\nRegular Full Time\n\nSurrey Police Service (SPS) is Surrey’s new municipal police agency. On November 29, 2024, SPS became the police of jurisdiction, and assumed responsibility and command for policing and law enforcement in Surrey. SPS is working to redefine policing with innovative new approaches and community-based solutions. It’s an exciting time as SPS continues to expand our team with talented people who want to help shape the future of policing in Surrey. To date we’ve hired over 480 police officers and over 450 civilian support staff and will grow to be one of the largest independent police services in Canada. Since day one, SPS has been intentional about building a culture that is inclusive, respectful and supportive, with a strong focus on employee wellness and career development.\n\nPOSITION OVERVIEW\nSurrey Police Service (SPS) has an exciting opportunity for a Regular Full Time Clerk 3 to join our Fleet Management Unit with the Corporate Services Bureau. As a key administrative support within the fleet management unit, the Clerk 3 (Fleet) will be responsible for maintaining records, preparing reports, managing schedules, and ensuring smooth day-to-day fleet operations. The role requires strong organizational skills, attention to detail, and the ability to communicate effectively with staff, officers, and the public. This position offers a unique opportunity to contribute to the efficiency and effectiveness of SPS’ fleet services while working within a dynamic policing environment.\n\nRESPONSIBILITIES\n\nPrepares word processed reports.\nFiles and keeps records.\nChecks, balances, and maintains accounts and other records.\nPrepares and assists in assigning classifications or numerical designations to files, records, plans and related documents.\nPrepares and posts schedules, sign up notices and charts.\nPosts, maintains, reconciles, and balances records not requiring special accounting techniques.\nCollects and inputs data.\nOperates office equipment, such as PC’s, word processors, photocopiers, and fax machines.\nProvides information to others, traces errors, corrects deviations from policy and answers inquiries and complaints from the public and staff.\nAdvises subordinates on new or revised procedures and unusual problems.\nExplains division regulations and procedures.\nAssists other staff in performing their duties.\nPerforms related duties as required.\n\n\nKNOWLEDGE, SKILLS AND ABILITIES\n\nAbility to communicate effectively, both orally and in writing.\nAbility to understand and effectively carry out oral and written instruction.\nIndependence in judgement taken in performing the duties of the position.\nConsiderable knowledge of business English, spelling, arithmetic, current office practices, procedures, and equipment operation.\nAbility to maintain moderately complex records, prepare reports and make arithmetical calculations rapidly and accurately.\nKnowledge of filing, indexing methods and record keeping.\nAbility to follow routine procedures with a minimum of supervision.\nAbility to provide accurate, factual information to others.\nAbility to establish and maintain satisfactory working relationships with the public and staff.\nAbility to train junior personnel.\nAbility to assemble and prepare statistical reports and tabulations.\nGood public relations skills and interpersonal skills.\nKnowledge of PC office applications and good key board skills.\nGood knowledge of Surrey Police Service policies, procedures, and standards.\nGood knowledge of the division’s operation and procedures.\nWorking knowledge of applicable safety regulations.\nPhysical strength, stamina, and coordination to carry out the duties of the position.\nRelevant level of security clearance.\n\n\nAPPLICANT QUALIFICATIONS\n\nCompletion of Grade 12, supplemented by several courses in word processing, office practices and computer applications.\nMinimum two years experience and training in an office environment.\nMust have accurate typing speed of 45 wpm.\nThis position requires clearance through the Surrey Police Service. All applicants must obtain and maintain the required police security clearance throughout their employment with SPS, which includes a mandatory polygraph examination.\n\n\nBENEFITS & COMPENSATION \nSurrey Police Service offers a comprehensive benefits package, including extended health and dental coverage, a defined benefit pension through the Municipal Pension Plan, generous vacation entitlements, and ongoing professional development. Employees also benefit from short-term and long-term disability coverage, travel and life insurance, discounted access to City of Surrey recreation facilities, and a dedicated Employee Services team providing personal and family support. With a strong focus on well-being, career growth, and work-life balance, SPS is committed to fostering a supportive and rewarding workplace. Note – The aforementioned benefits only apply to eligible full-time positions within SPS.\n\nThis position is unionized represented by CUPE Local 402.\nThe salary range for this position is $30.12/hour -$31.97/hour (pay grade 012) based on 2024 Rates.\n\n \nApplications must be submitted through our online Careers page. This posting will remain open until 11:55pm on July 7th, 2025; however, applications will be reviewed on an ongoing basis. We encourage interested candidates to apply as soon as possible, as the posting may close earlier if a suitable candidate is selected.\n \nFor updates on recruitment opportunities and other Surrey Police Service news, follow us on LinkedIn, Instagram, Facebook, and X (formerly Twitter).\n \nThank you for your interest in working with SPS. We pride ourselves on hiring members that model the mission, vision, and values of SPS through unquestioned integrity and sustaining a visible, credible, inclusive, and respected profile."
  },
  {
    "id": "9b54e690-a013-4d03-b438-2ed5f584487b",
    "company": "Surrey Police Service",
    "location": "Surrey, BC",
    "position": "Telecommunications Operator 2",
    "postedDate": "10 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105456",
    "source": "CivicJobs BC",
    "description": "Surrey Police Service\nTelecommunications Operator 2\n\nRegular Full Time – CUPE\n\nSurrey Police Service (SPS) is Surrey’s new municipal police agency. On November 29, 2024, SPS became the police of jurisdiction, and assumed responsibility and command for policing and law enforcement in Surrey. SPS is working to redefine policing with innovative new approaches and community-based solutions. It’s an exciting time as SPS continues to expand our team with talented people who want to help shape the future of policing in Surrey. To date we’ve hired over 480 police officers and over 450 civilian support staff and will grow to be one of the largest independent police services in Canada. Since day one, SPS has been intentional about building a culture that is inclusive, respectful and supportive, with a strong focus on employee wellness and career development.\n\nPOSITION OVERVIEW:\nSurrey Police Service (SPS) has an exciting opportunity for up to eight (8) Regular Full-Time Telecommunications Operator 2 to join SPS’s Operational Communications Centre (OCC). Reporting to the OCC Shift Manager, this position is responsible for a wide variety of critical telecommunications duties within the SPS OCC. The incumbent will handle a number of complex, time sensitive duties in various functional areas including but not limited to dispatch, call-taking, info radio and info messaging centre. The incumbent will exercise independence of judgment and work under limited supervision.\n \nPlease note this is an in-office position with currently no option for remote work. The anticipated work schedule is a rotating schedule of four (4) 12-hour shifts, followed by four days off; however, are subject to change based on operational need and adherence to the Collective Agreement. Incumbents must be able to work days, evenings, graveyards, holidays and weekends.\n\nRESPONSIBILITIES:\n\nResponds to varied calls such as complaints, emergency 911 and non-emergency calls, and general inquiries. Accurately evaluates incoming calls and prioritizes calls.\nTakes reports and enters detailed accurate information within time constraints.\nProvides critical information with speed and accuracy staff, the public, and other agencies.\nDispatches calls for police response to appropriate police personnel including additional units to assist on calls as required.\nAssesses the situation, identifies other agencies that may be required for the event, and contacts the agencies directly.\nMonitors the status and location of police units and liaises closely with police officers in the CSOC.\nCompletes forms, reports, and records pertaining to incoming calls, dispatch functions performed, and to information received from police officers.\nResponds to requests for information from police units by using CPIC, CAD, Prime, and other information sources.\nMay be required to attend court to give evidence.\nPerforms CPIC maintenance including data entry, modifications, information removal, and retrieval.\nReplies to inquiries from other police agencies.   \nDrafts messages relating to warrants or CPIC hits and sends them to appropriate agencies.\nMaintains comprehensive file records per various file management requirements.\nMaintains general upkeep and cleaning of equipment and workstation.\nTrains and assists other employees as required.\nPerforms related duties as required. \n\n\nKNOWLEDGE, ABILITY AND SKILL:\n\nCommunicates effectively, both orally and in writing.\nUnderstands and effectively carries out oral and written instructions.\nSuperior listening skills and can extract information that is significant and pertinent in time sensitive situations.\nStrong organization and coordination skills in order to set priorities and manage many tasks at once.\nExercises sound, independent judgement, and superior decision-making.\nReacts quickly, calmly, and tactfully with the public, often under stressful situations.\nWorks in a group setting as part of a team.\nKnowledge of relevant geography.\nConsiderable knowledge of SPS functions, procedures, policies and regulations, federal statutes of Canada, provincial statutes, the Motor Vehicle Act, other appropriate by-laws and regulations and agencies/services available in Surrey.\nConsiderable knowledge of telecommunications equipment such as police radio, telephone, and computer terminal equipment.\nConsiderable knowledge of methods and procedures of the OCC.\nWorking knowledge of applicable computer applications including but not limited to CPIC and CAD.\nPhysical strength, stamina, and coordination to carry out the duties of the position.\nWorking knowledge of applicable safety regulations.\nRelevant level of SPS security clearance.\n\n\nQUALIFICATIONS:\n\nCompletion of Grade 12\nMinimum of twelve (12) months related training and experience in the use and operation of police telecommunications dispatch and complaint taking equipment and information systems and a demonstrated competence in dispatching.\nAccurate typing speed of 45 wpm.\nAn equivalent combination of education and experience may be considered.\nThe ability to work rotating shifts, including days, graveyards, holidays and weekends.\nThis position requires both SPS Security Clearance and RCMP Reliability Status. All applicants must obtain and maintain the required police security clearance throughout their employment with SPS, which includes a mandatory polygraph examination.\n\n\nBENEFITS & COMPENSATION\nSurrey Police Service offers a comprehensive benefits package, including extended health and dental coverage, a defined benefit pension through the Municipal Pension Plan, generous vacation entitlements, and ongoing professional development. Employees also benefit from short-term and long-term disability coverage, travel and life insurance, discounted access to City of Surrey recreation facilities, and a dedicated Employee Services team providing personal and family support. With a strong focus on well-being, career growth, and work-life balance, SPS is committed to fostering a supportive and rewarding workplace. Note – The aforementioned benefits only apply to eligible full-time positions within SPS.\n\nThis is a unionized position, represented by CUPE 402.\nThe salary range is $39.59/hour - $44.46/hour (pay grade 24C) based on 2024 rates. Please note the 2024 hourly rates are currently under review.\n\n \nApplications must be submitted through our online Careers page. This posting will remain open until 11:55pm on July 7th, 2025; however, applications will be reviewed on an ongoing basis. We encourage interested candidates to apply as soon as possible, as the posting may close earlier if a suitable candidate is selected.\n \nFor updates on recruitment opportunities and other Surrey Police Service news, follow us on LinkedIn, Instagram, Facebook, and X (formerly Twitter).\n \nThank you for your interest in working with SPS. We pride ourselves on hiring members that model the mission, vision, and values of SPS through unquestioned integrity and sustaining a visible, credible, inclusive, and respected profile."
  },
  {
    "id": "20221357-42de-477d-a1c5-8574a2208bfc",
    "company": "Surrey Police Service",
    "location": "Surrey, BC",
    "position": "Telecommunications Operator 2",
    "postedDate": "10 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105455",
    "source": "CivicJobs BC",
    "description": "Surrey Police Service\nTelecommunications Operator 2\n\nAuxiliary – CUPE\n\nSurrey Police Service (SPS) is Surrey’s new municipal police agency. On November 29, 2024, SPS became the police of jurisdiction, and assumed responsibility and command for policing and law enforcement in Surrey. SPS is working to redefine policing with innovative new approaches and community-based solutions. It’s an exciting time as SPS continues to expand our team with talented people who want to help shape the future of policing in Surrey. To date we’ve hired over 480 police officers and over 450 civilian support staff and will grow to be one of the largest independent police services in Canada. Since day one, SPS has been intentional about building a culture that is inclusive, respectful and supportive, with a strong focus on employee wellness and career development.\n\nPOSITION OVERVIEW:\nSurrey Police Service (SPS) has an exciting opportunity for an auxiliary Telecommunications Operator 2 to join SPS’s Operational Communications Centre (OCC). Reporting to the OCC Shift Manager, this position is responsible for a wide variety of critical telecommunications duties within the SPS OCC. The incumbent will handle a number of complex, time sensitive duties in various functional areas including but not limited to dispatch, call-taking, info radio and info messaging centre. The incumbent will exercise independence of judgment and work under limited supervision.\n \nSchedule / Hours of Work\nPlease note that this is an in-office position with no option for remote work. To be eligible for this auxiliary position, incumbents must have flexible availability and be able to commit to a minimum of two (2) shifts per month. Shifts may include weekdays, evenings, overnight (graveyard) shifts, weekends, and holidays. The anticipated work schedule for the base full-time position is a rotating schedule of four (4) 12-hour shifts, followed by four days off; however, are subject to change based on operational need and adherence to the Collective Agreement.\n\nRESPONSIBILITIES:\n\nResponds to varied calls such as complaints, emergency 911 and non-emergency calls, and general inquiries. Accurately evaluates incoming calls and prioritizes calls.\nTakes reports and enters detailed accurate information within time constraints.\nProvides critical information with speed and accuracy staff, the public, and other agencies.\nDispatches calls for police response to appropriate police personnel including additional units to assist on calls as required.\nAssesses the situation, identifies other agencies that may be required for the event, and contacts the agencies directly.\nMonitors the status and location of police units and liaises closely with police officers in the CSOC.\nCompletes forms, reports, and records pertaining to incoming calls, dispatch functions performed, and to information received from police officers.\nResponds to requests for information from police units by using CPIC, CAD, Prime, and other information sources.\nMay be required to attend court to give evidence.   \nPerforms CPIC maintenance including data entry, modifications, information removal, and retrieval.\nReplies to inquiries from other police agencies.\nDrafts messages relating to warrants or CPIC hits and sends them to appropriate agencies.\nMaintains comprehensive file records per various file management requirements.\nMaintains general upkeep and cleaning of equipment and workstation.\nTrains and assists other employees as required.\nPerforms related duties as required.\n\n\nKNOWLEDGE, ABILITY AND SKILL:\n\nCommunicates effectively, both orally and in writing.\nUnderstands and effectively carries out oral and written instructions.\nSuperior listening skills and can extract information that is significant and pertinent in time sensitive situations.\nStrong organization and coordination skills in order to set priorities and manage many tasks at once.\nExercises sound, independent judgement, and superior decision-making.\nReacts quickly, calmly, and tactfully with the public, often under stressful situations.\nWorks in a group setting as part of a team.\nKnowledge of relevant geography.\nConsiderable knowledge of SPS functions, procedures, policies and regulations, federal statutes of Canada, provincial statutes, the Motor Vehicle Act, other appropriate by-laws and regulations and agencies/services available in Surrey.\nConsiderable knowledge of telecommunications equipment such as police radio, telephone, and computer terminal equipment.\nConsiderable knowledge of methods and procedures of the OCC.\nWorking knowledge of applicable computer applications including but not limited to CPIC and CAD.\nPhysical strength, stamina, and coordination to carry out the duties of the position.\nWorking knowledge of applicable safety regulations.\nRelevant level of SPS security clearance.\n\n\nQUALIFICATIONS:\n\nCompletion of Grade 12\nMinimum of twelve (12) months related training and experience in the use and operation of police telecommunications dispatch and complaint taking equipment and information systems and a demonstrated competence in dispatching.\nAccurate typing speed of 45 wpm.\nAn equivalent combination of education and experience may be considered.\nThe ability to work rotating shifts, including days, graveyards, holidays and weekends.\nThis position requires both SPS Security Clearance and RCMP Reliability Status. All applicants must obtain and maintain the required police security clearance throughout their employment with SPS, which includes a mandatory polygraph examination.\n\n\nBENEFITS & COMPENSATION\nSurrey Police Service is committed to providing a supportive and fulfilling work environment for our Auxiliary and Temporary Full-Time (TFT) employees. They have access to valuable resources such as the Employee Assistance Program (FSEAP), offering confidential support for personal and family matters, as well as a dedicated Employee Services team to assist with well-being. At SPS, we prioritize creating an inclusive and collaborative atmosphere where all employees are supported in their professional and personal development.\n\nThis is a unionized position, represented by CUPE 402.\nThe salary range is $40.53/hour - $47.68/hour (pay grade 24C); based on June 1, 2025 market adjustment.\n\n \nApplications must be submitted through our online Careers page. This posting will remain open until positions are filled. Applications will be reviewed on an ongoing basis. We encourage interested candidates to apply as soon as possible, as the posting may close earlier if suitable candidates are selected.\n \nFor updates on recruitment opportunities and other Surrey Police Service news, follow us on LinkedIn, Instagram, Facebook, and X (formerly Twitter).\n \nThank you for your interest in working with SPS. We pride ourselves on hiring members that model the mission, vision, and values of SPS through unquestioned integrity and sustaining a visible, credible, inclusive, and respected profile."
  },
  {
    "id": "48a29f83-9d3d-484b-aee7-1f986d4eef60",
    "company": "Surrey Police Service",
    "location": "Surrey, BC",
    "position": "Telecommunications Operator 1",
    "postedDate": "10 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105454",
    "source": "CivicJobs BC",
    "description": "Surrey Police Service\nTelecommunications Operator 1\n\nAuxiliary – CUPE\n\nSurrey Police Service (SPS) is Surrey’s new municipal police agency. On November 29, 2024, SPS became the police of jurisdiction, and assumed responsibility and command for policing and law enforcement in Surrey. SPS is working to redefine policing with innovative new approaches and community-based solutions. It’s an exciting time as SPS continues to expand our team with talented people who want to help shape the future of policing in Surrey. To date we’ve hired over 480 police officers and over 450 civilian support staff and will grow to be one of the largest independent police services in Canada. Since day one, SPS has been intentional about building a culture that is inclusive, respectful and supportive, with a strong focus on employee wellness and career development.\n\nPOSITION OVERVIEW:\nSurrey Police Service (SPS) has an exciting opportunity to join SPS’ Operational Communications Centre (OCC) Unit as an auxiliary Telecommunications Operator 1. Reporting to the OCC Shift Manager, this position is responsible for a wide variety of critical telecommunications duties within the SPS OCC. This position is vital in supporting sworn and public safety. The incumbent will handle a number of complex, stressful, and time sensitive duties and situations in various Telecommunications Operator functional areas. The incumbent will exercise independence of judgment and work under limited supervision.\n \nSchedule / Hours of Work\nPlease note that this is an in-office position with no option for remote work. To be eligible for this auxiliary position, incumbents must have flexible availability and be able to commit to a minimum of two (2) shifts per month. Shifts may include weekdays, evenings, overnight (graveyard) shifts, weekends, and holidays. The anticipated work schedule for the base full-time position is a rotating schedule of four (4) 12-hour shifts, followed by four days off; however, are subject to change based on operational need and adherence to the Collective Agreement.\n\nRESPONSIBILITIES:\n\nResponds to varied calls such as complaints, emergency 911 and non-emergency calls, and general inquiries. Quickly and accurately evaluates incoming calls and prioritizes calls.\nTakes reports and enters detailed information accurately within time constraints.\nProvides critical information with speed and accuracy to the public and other agencies.\nMaintains phone contact with callers under certain emergency situations, dispenses instructions to callers and ensures that all pertinent information is transmitted to the Telecommunications Operator 2.\nLiaises closely with the Telecom Operator 2 on priority 1 calls, completes extensive report taking and required investigation, and returns to the caller, as needed.\nIdentifies other agencies that may be required for the event, forwards the information to the Telecom Operator 2 and/or contacts the agencies directly.\nCompletes forms, reports and records pertaining to receipt of incoming calls.\nAccesses CPIC, CAD (computer aided dispatch), and other information sources to make inquiries related to a report or event.\nReceives training in the dispatch function and assists in the dispatch function as part of that training.   \nMay be required to attend court to give evidence on calls taken.\nMaintains comprehensive file records per various file management requirements.\nMaintains general upkeep and cleaning of equipment and workstation.\nAssists other employees in the section in the performance of their duties.\nPerforms related duties as required.\n\n\nKNOWLEDGE, ABILITY AND SKILL:\n\nCommunicates effectively, both orally and in writing.\nUnderstands and effectively carries out oral and written instructions.\nSuperior listening skills and the ability to extract information that is significant and pertinent in time sensitive situations.\nStrong organization and coordination skills in order to set priorities and manage many tasks at once.\nExercises sound, independent judgement, and superior decision-making.\nReacts quickly, calmly, and tactfully with the public, often under stressful situations.\nWorks in a group setting as part of a team.\nKnowledge of relevant geography.\nConsiderable knowledge of Surrey Police Service (SPS) functions, procedures, policies and regulations, federal statutes of Canada, provincial statutes, the Motor Vehicle Act, other appropriate by-laws and regulations, and agencies/services available in Surrey.\nKnowledge of telecommunications equipment such as police radio, telephone, and computer terminal equipment.\nKnowledge of applicable computer applications including but not limited to CPIC and CIIDS.\nPhysical strength, stamina, and coordination to carry out the duties of the position.\nKnowledge of applicable safety regulations.\nRelevant level of SPS security clearance. \n\n\nQUALIFICATIONS:\n\nCompletion of Grade 12, supplemented by some related experience\nAccurate typing speed of 45 wpm.\nThe ability to work rotating shifts, including day, evening, graveyards, holidays and weekends.\nThis position requires both SPS Security Clearance and RCMP Reliability Status. All applicants must obtain and maintain the required police security clearance throughout their employment with SPS, which includes a mandatory polygraph examination.\n\n\nBENEFITS AND COMPENSATION\nSurrey Police Service is committed to providing a supportive and fulfilling work environment for our Auxiliary and Temporary Full-Time (TFT) employees. They have access to valuable resources such as the Employee Assistance Program (FSEAP), offering confidential support for personal and family matters, as well as a dedicated Employee Services team to assist with well-being. At SPS, we prioritize creating an inclusive and collaborative atmosphere where all employees are supported in their professional and personal development.\n\nThis is a unionized position, represented by CUPE 402.\nThe salary range is $37.33/hour - $43.97/hour (pay grade 19C); based on June 1, 2025 market adjustment.\n\n \nApplications must be submitted through our online Careers page. This posting will remain open until positions are filled. Applications will be reviewed on an ongoing basis. We encourage interested candidates to apply as soon as possible, as the posting may close earlier if suitable candidates are selected.\n \nFor updates on recruitment opportunities and other Surrey Police Service news, follow us on LinkedIn, Instagram, Facebook, and X (formerly Twitter).\n \nThank you for your interest in working with SPS. We pride ourselves on hiring members that model the mission, vision, and values of SPS through unquestioned integrity and sustaining a visible, credible, inclusive, and respected profile."
  },
  {
    "id": "37b4b57a-ac98-47f7-bc15-23486dc3c153",
    "company": "Surrey Police Service",
    "location": "Surrey, BC",
    "position": "Telecommunications Operator 1/In Training",
    "postedDate": "11 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105453",
    "source": "CivicJobs BC",
    "description": "Surrey Police Service\nTelecommunications Operator 1/In Training\n\nTemporary Full Time – CUPE\n\nSurrey Police Service (SPS) is Surrey’s new municipal police agency. On November 29, 2024, SPS became the police of jurisdiction, and assumed responsibility and command for policing and law enforcement in Surrey. SPS is working to redefine policing with innovative new approaches and community-based solutions. It’s an exciting time as SPS continues to expand our team with talented people who want to help shape the future of policing in Surrey. To date we’ve hired over 480 police officers and over 450 civilian support staff and will grow to be one of the largest independent police services in Canada. Since day one, SPS has been intentional about building a culture that is inclusive, respectful and supportive, with a strong focus on employee wellness and career development.\n\nPOSITION OVERVIEW:\nSurrey Police Service (SPS) has an exciting opportunity to join SPS’ Operational Communications Centre (OCC) Unit and receive training to become a qualified Telecommunications Operator. Reporting to the OCC Shift Manager, this position is responsible for a wide variety of critical telecommunications duties within the SPS OCC. This position is vital in supporting sworn and public safety. The incumbent will handle a number of complex, stressful, and time sensitive duties and situations in various Telecommunications Operator functional areas. The incumbent will exercise independence of judgment and work under limited supervision.\n\nTRAINING REQUIREMENTS & OVERVIEW:\nSPS is excited to offer ‘in-training’ Telecommunications Operator positions for incumbents to learn and be trained in the various Telecommunication Operator 2 functional areas, including but not limited to, emergency and non-emergency call-taking, info radio and info messaging centre, and dispatch. Incumbents will be hired as a Telecommunications Operator 1/In Training with the expectation to successfully complete the training required in all functional areas to become a qualified Telecommunications Operator 2.\n \nIncumbents will be required to first complete an initial 8-week training program before advancing to further training. Upon successful completion of the initial phase, they will continue to receive ongoing instruction until they can fully demonstrate proficiency in all functional areas required of a Telecommunications Operator 2. The entire training process is expected to take approximately 15 months.\n \nIncumbents will be deemed qualified and become eligible to be considered for available Regular Full-Time Telecommunications Operator 2 opportunities once they have successfully progressed through all the required training and demonstrated their ability to perform all functional areas of a Telecommunications Operator 2.\n \nSchedule / Hours of Work\nThe anticipated training class for the successful incumbents is expected to be either in Fall or Winter 2025. During the first 3 weeks of training, the incumbent will work Monday – Friday. After these 3 weeks, the incumbent will work a rotating schedule of four (4) 12-hour shifts, followed by four days off. Incumbents must be able to work days, evenings, graveyards, holidays and weekends.    \n\nRESPONSIBILITIES:\n\nResponds to varied calls such as complaints, emergency 911 and non-emergency calls, and general inquiries. Quickly and accurately evaluates incoming calls and prioritizes calls.\nTakes reports and enters detailed information accurately within time constraints.\nProvides critical information with speed and accuracy to the public and other agencies.\nMaintains phone contact with callers under certain emergency situations, dispenses instructions to callers and ensures that all pertinent information is transmitted to the Telecommunications Operator 2.\nLiaises closely with the Telecom Operator 2 on priority 1 calls, completes extensive report taking and required investigation, and returns to the caller, as needed.\nIdentifies other agencies that may be required for the event, forwards the information to the Telecom Operator 2 and/or contacts the agencies directly.\nCompletes forms, reports and records pertaining to receipt of incoming calls.\nAccesses CPIC, CAD (computer aided dispatch), and other information sources to make inquiries related to a report or event.\nReceives training in the dispatch function and assists in the dispatch function as part of that training.\nMay be required to attend court to give evidence on calls taken.\nMaintains comprehensive file records per various file management requirements.\nMaintains general upkeep and cleaning of equipment and workstation.\nAssists other employees in the section in the performance of their duties.\nPerforms related duties as required.\n\n\nKNOWLEDGE, ABILITY AND SKILL:\n\nCommunicates effectively, both orally and in writing.\nUnderstands and effectively carries out oral and written instructions.\nSuperior listening skills and the ability to extract information that is significant and pertinent in time sensitive situations.\nStrong organization and coordination skills in order to set priorities and manage many tasks at once.\nExercises sound, independent judgement, and superior decision-making.\nReacts quickly, calmly, and tactfully with the public, often under stressful situations.\nWorks in a group setting as part of a team.\nKnowledge of relevant geography.\nConsiderable knowledge of Surrey Police Service (SPS) functions, procedures, policies and regulations, federal statutes of Canada, provincial statutes, the Motor Vehicle Act, other appropriate by-laws and regulations, and agencies/services available in Surrey.\nKnowledge of telecommunications equipment such as police radio, telephone, and computer terminal equipment.\nKnowledge of applicable computer applications including but not limited to CPIC and CIIDS.\nPhysical strength, stamina, and coordination to carry out the duties of the position.\nKnowledge of applicable safety regulations.\nRelevant level of SPS security clearance.\n\n\nQUALIFICATIONS:\n\nCompletion of Grade 12, supplemented by some related experience\nAccurate typing speed of 45 wpm.\nThe ability to work rotating shifts, including day, evening, graveyards, holidays and weekends.\nThis position requires both SPS Security Clearance and RCMP Reliability Status. All applicants must obtain and maintain the required police security clearance throughout their employment with SPS, which includes a mandatory polygraph examination. \n\n\nBENEFITS AND COMPENSATION\n\nThis is a unionized position, represented by CUPE 402.\nThe salary range for the Telecommunication Operator 1 is $33.57/hour - $36.61/hour (pay grade 19C) based on 2024 rates. Please note the 2024 hourly rates are currently under review.\nDuring the 8 week-training course, incumbents will receive 12% of the base rate of pay, in lieu of benefits, vacation and general holidays. After successful completion of the training course, incumbents will become eligible for paid vacation entitlements, extended health and dental coverage, Group Life & AD&D as well as SPS’ sick leave plan. \n\n \nApplications must be submitted through our online Careers page. This posting will remain open until positions are filled. We are looking for approximately up to 9 Telecommunications Operator 1/In Training for the upcoming Fall and Winter training classes. Applications will be reviewed on an ongoing basis. We encourage interested candidates to apply as soon as possible, as the posting may close earlier if suitable candidates are selected.\n \nFor updates on recruitment opportunities and other Surrey Police Service news, follow us on LinkedIn, Instagram, Facebook, and X (formerly Twitter).\n \nThank you for your interest in working with SPS. We pride ourselves on hiring members that model the mission, vision, and values of SPS through unquestioned integrity and sustaining a visible, credible, inclusive, and respected profile."
  },
  {
    "id": "9548d1d9-7b16-4065-abe4-849785e20b3c",
    "company": "City of Surrey",
    "location": "Surrey, BC",
    "position": "Tradesperson 2 - Refrigeration Technician",
    "postedDate": "12 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105452",
    "source": "CivicJobs BC",
    "description": "City of Surrey\nTradesperson 2 - Refrigeration Technician\n\n\nAs one of the fastest growing cities in Canada, City of Surrey is a globally recognized leader in building vibrant, sustainable communities through technology and innovation.\nCity of Surrey employees are talented innovators, inspired by meaningful work and the opportunity to drive our city—and their careers—forward. Build a City. Build a Future at the City of Surrey\n\nEMPLOYMENT STATUS\nUnion - CUPE Local 402 – Regular Full-time\n \nSCOPE\nThe City of Surrey has an excellent opportunity for an experienced Tradesperson 2, Refrigeration Technician to perform skilled HVAC (Heating, Ventilation and Air-conditioning) trades tasks involving considerable physical effort and active performance of a variety of maintenance and minor construction of Municipal facilities and buildings.\n\nResponsibilities\n\nPerforms skilled HVAC (Heating, Ventilation and Air-Conditioning) trades work in construction, alteration, maintenance and repair of City facilities and buildings.\nMonitors the operation of HVAC systems including taking readings of various gauges, boilers, refrigeration, electrical and alarm systems and auxiliary equipment and controls.\nMaintains the operation of HVAC systems such as maintaining proper pressures of various gauges, operation of cooling tower and heat pump systems, bleeding the air compressor, chillers and refrigeration units, changing filters of fan units and electrical switches.\nLubricates motors, bearings, pumps and fans.\nReads and interprets blueprints, drawings and plans.\nAssists in preparing estimates of costs, time, materials and equipment needed for HVAC projects.\nOrders materials and supplies.\nKeeps accurate records, including daily log of activities, etc.\nWorks with other trades including working with electrical and plumbing systems.\nAssists other crew members in performing their duties.\nResponds to routine inquiries from the public and others.\nPerforms PM and DM on city owned HVAC equipment.\nPerforms other duties as required.\n\n\nQualifications\n\nSuccessfully completed Grade 12 or GED.\nRefrigeration and Air-Conditioning Trades Qualification. B.C. Provincial Environmental Ticket.\nPrevious experience and training as a qualified trades in HVAC systems.\nThorough knowledge of the standard practices, principles, methods, codes, materials, and equipment used in the HVAC trade\nA valid B.C. Driver’s license with safe driving history.\nThe successful candidate must obtain and maintain a valid RCMP Security Clearance.\n\n \nOTHER INFORMATION\nPay Grade: C\nHours: 40 hours/week\nHourly Rate: $43.30\n\nwww.surrey.ca/careers"
  },
  {
    "id": "8d3b0e46-47fd-4d35-8227-356bfa095f84",
    "company": "District of Saanich",
    "location": "Saanich, BC",
    "position": "Engineering Technician IV",
    "postedDate": "13 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105451",
    "source": "CivicJobs BC",
    "description": "DISTRICT OF SAANICH\nENGINEERING DEPARTMENT\nWATER RESOURCES DIVISION\n\nENGINEERING TECHNICIAN IV\n\nPermanent Full-Time Position\n \nThe District of Saanich is the largest municipality in beautiful Greater Victoria, blending both the urban and rural environment and home to approximately 124,000 citizens.  Employing more than 1,500 members, our greatest asset is a high performing workforce. We provide a collaborative, dynamic and progressive work environment that consistently attracts top-quality people, enables them to perform at their best and grow their skills. Our competitive wages, excellent benefits package, generous pension plan, flexible work program, supporting and inclusive work environment and progressive initiatives make the District of Saanich a highly desirable place to invest your talent.\n \nThe Water Resources Division of Saanich Engineering provides professional services for the management of the municipal sanitary sewer, potable water and storm drainage systems. We are recruiting for an Engineering Technician (level 4) to join our fast paced and diverse team. The ideal candidate is either an experienced technologist or an engineering-in-training. The successful candidate will work in the infrastructure planning & analysis section; a technical team that is responsible for the development and implementation of utilities master plans, asset management plans, policies and technical initiatives for the sustainability of the District’s linear underground infrastructure and related facilities. The work of the Engineering Technician IV involves performing civil engineering work at a semi-professional level with a focus on the District’s water distribution system including project scoping; capital budget program development; hydraulic modelling; and other projects as the internal project manager; responding to public inquiries; providing technical support to internal staff; liaising with/making recommendations to the Engineering of Record; and participating in intra or inter-departmental initiatives as representative for the team. The role works under the guidance of professional engineers in the team; is afforded an appropriate level of independence in completing work assignments and an extraordinary variation in work tasks that will expand your functional knowledge of municipal infrastructure management in local government setting.  The successful candidate will possess a sound technical foundation, strong project management skills, is well organized, has strong communication skills and an appetite for learning.\n \nRequirements include a two-year diploma in Civil Engineering Technology from a recognized institution; a minimum of 5 years of directly related experience; is eligible for registration as an AScT with the Applied Science Technologists and Technicians BC; possesses a valid BC Class 5 Driver’s License. Familiarity with Civil 3D/AutoCAD and InfoWater Pro would be considered an asset. However, training will be provided for hydraulic modelling software.\n \nThose who may not specifically meet the full extent of the listed qualifications are encouraged to apply, as the District may consider the totality of education, experience and training as an equivalent. Alternate qualifications will also be considered, such as a University Degree in a related field of Engineering and minimum of 3 years of related work experience, and eligible for registration with Engineers and Geoscientists of BC as an Engineer-In-Training. \n \nThe successful candidates will work Monday to Friday 8:30 a.m. to 4:30 p.m. (35 hours per week) and will be eligible for participation in the District’s modified work week program (37.5 hours worked per week and every third Friday or Monday off).\n \nThis is a C.U.P.E. Local 2011 position with a wage of $48.10 per hour and an excellent benefits package.  Please apply by 11:45 p.m. on July 7, 2025, quoting competition 25164. Job description and competition information can be found at www.saanich.ca.  As a component of the selection process, testing will be conducted.  Applications must include a cover letter and resume.\n \nThe District of Saanich is recognized as one of BC’s Top Employers for 2025. As an equitable and inclusive employer, we value diversity of people to best represent the community we serve and provide excellent services to our citizens. We strive to attract and retain passionate and talented individuals of all backgrounds, demographics, and life experiences.  If you require any adjustments to enable participation at any stage of the recruitment process, please contact in confidence accessibilityHR@saanich.ca. We thank all applicants for applying. Only those under consideration will be contacted.\n \nApplying from out of town? Take a look at what Saanich has to offer! bit.ly/NaturalSaanich"
  },
  {
    "id": "a0ec40b9-3752-4518-96b6-7cd6083eb5d0",
    "company": "City of New Westminster",
    "location": "New Westminster, BC",
    "position": "Architectural Space Management Specialist",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105450",
    "source": "CivicJobs BC",
    "description": "Great City, Great Work, Great Future!\n \nArchitectural Space Management Specialist\n \n\nEmployment Status\nRegular Full-Time\n\nPay Range\n$39.14 - $46.07 per hour (2024 rates) plus comprehensive benefits\n\nClosing Date\n7/13/25\n\nApply Now\n\nNumber of Openings:  1\n\nHours per Week:  35 hours per week.\n\nEmployee Group:  CUPE, Local 387\n\nLocation:  City Hall: 511 Royal Ave\n\nCompetition #:  1015\n\nAdditional Details:  \nAs a central hub in the Metro Vancouver area, the City of New Westminster delivers a broad spectrum of urban services to over 85,000 residents. New Westminster is rich in history with a viable and thriving economy and has a population representative of the diversity of the region. The City is staffed by talented and dedicated employees who work together to achieve its strategic vision. We have earned a proud reputation for civic leadership, service delivery, and outstanding employee relations.\nThe City of New Westminster is looking for a skilled and dedicated Architectural Space Management Specialist to join the Engineering Department’s passionate and innovative Civic Buildings Capital Project Team. This newly created position offers a unique opportunity to support facility capital projects and other key City initiatives by overseeing the organization and management of critical building related information for over 70 civic facilities.\n\nThis role requires a general understanding of building design principles, the ability to read and interpret technical building drawings (such as architectural plans or other record drawings), as well as the ability to functionally use AutoCad to create legible wayfinding (not for construction) floor plans.\n\nReporting to the Sr. Project Manager - Renewal Planning, the role will be responsible for developing and maintaining a comprehensive inventory of key facility drawings, including building plans, specialized architectural and wayfinding drawings in AutoCAD and supporting the creation and management of building-related inventory lists, technical standards, and specification documents related to civic infrastructure. This role will work closely with Civic Building Project Management staff, City records management staff and other internal stakeholders.\n\nResponsibilities include:\n\nDeveloping, implementing and maintaining:\nstandards and processes for maintaining centralized records for building drawings, plans and  inventories (such as finish inventories), in coordination with Engineering Records Management staff, so it can be accessed by staff City wide; \nan inventory of facility wayfinding (not for construction) drawings that are current and up to date; this role will be expected up to update wayfinding drawings in AutoCAD to incorporate wayfinding level of detail changes resulting from capital project changes into the record wayfinding drawings, including floor layout changes, room names, identification labels, and furniture layouts where applicable;\na furniture, fixtures and finishes inventory for the City’s facilities; \na standardized room naming convention related to building spaces along with oversight and management of associated way-finding signage (as applicable);\na CAD layers standard to identify, tag, and index spaces within civic building drawings;\na civic facility specifications package, including standards for furniture, fixtures and finishes that could be applied to inform future capital or developer led amenity projects; \na procedure for the renewal and maintenance of fire safety plans for each civic facility; \nsupporting and managing other key building inventory information, as required.\nOverseeing and managing the City’s Master Building List, including key building information such building area, addressing, and providing key building information to City staff as requested.\nMaintaining building related data to ensure it is accurate, up to date and reliable for city wide use.  \nCoordinating with the capital project team and consultants to properly file and manage record drawings for renovations and construction projects, and work closely with the City’s Project Management Staff to develop proper Close-out documentation, with key drawings, warranty and other project information to facilitate the hand-over of a project to the City’s Facilities Operations team.\nManaging and updating, in consultation with the City’s Records Management Staff, an inventory of record drawings, as-built drawings and fire-safety plans.\nCoordinating with the City’s Health & Safety staff to support centralized Health & Safety documents and inventories.\nManaging and updating the current floor plans and seating chart at City Hall (and other City facilities as required) on an ongoing an annual basis to keep records up to date.\nSupporting the team with various tasks and projects related to facility planning, documentation workflows, and technical coordination across departments or other tasks and projects as assigned.\nVisiting sites and facilities in New Westminster as required for work and as required to verify data.\nPreparing and maintaining a variety of records, reports and correspondence relative to the assigned work.\n\n\n\nKey education, experience and skill requirements include:\n\nCompletion a diploma from a technical institute in a related discipline such as architecture, architectural and building technology, or interior design, plus considerable related work experience; or an equivalent combination of training and experience.\nGeneral knowledge and understanding of building systems.\nAbility to:\nread and interpret technical drawings (at a general level), such as architectural, structural, mechanical or electrical drawings; \norganize, synthesize, analyze and maintain a large amount of data within data management systems, and to export and manipulate data into a clear reporting format; \ndevelop, recommend and coordinate centralized processes for the maintenance and storage of facility inventories, drawings and plans, in accordance with records management standards; \napply critical thinking and decision-making skills to general work, with oversight support from a senior staff member.\nProficient in AutoCAD, Adobe and/or Bluebeam and MS Office Suite software. Able to work effectively in AutoCAD with minimal supervision to create readable and legible drawings, considering appropriate line weights. Experience developing and implementing CAD standards is considered an asset.\nAbility to work effectively both independently and as part of a team, with excellent visual, written and oral communication skills for interacting with, and explaining information to a variety of interest holders.\nGeneral understanding of Project Management best practices, is considered an asset.\nValid BC Driver's License.\n\n\nWe offer our employees great work-life balance, competitive salaries, comprehensive health, benefit and retirement plans, education and training opportunities and challenging and rewarding work.\n\nPlease apply with your cover letter and resume in one document.\n\nTo support a workforce that reflects the diversity of our community; women, Indigenous Peoples, racialized individuals, persons of diverse sexual orientation, gender identity or expression (LGBTQ2S+), persons with disabilities, and others who may contribute to diversity of our workforce, are encouraged to express their interest.\n\nNew Westminster is on the unceded and unsurrendered land of the Halq'eméylem-speaking peoples. It is acknowledged by the City that colonialism has made invisible their histories and connections to the land.\nWe are learning and building relationships with the people whose lands we are on.\n\nWe thank all applicants for their interest and advise that only those selected for an interview will be contacted\n\nwww.newwestcity.ca"
  },
  {
    "id": "0536a38a-ea0f-4a3e-aa86-e58b4c52f3ad",
    "company": "City of Mission",
    "location": "Mission, BC",
    "position": "Aqua Fit Instructor",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105449",
    "source": "CivicJobs BC",
    "description": "Aqua Fit Instructor\n\nGrand Street 7650, Mission, BC V2V 3T3\n\nRate of Pay: 31.00\nDepartment: Parks, Recreation and Culture - Contract\nLocation: Mission Leisure Centre\nInternal or External: External\nVacancy Status: Part-Time\n\nCompany Description\nMission is located in the lower mainland of BC and is situated in the traditional territory of the Stó꞉lō Peoples including Sq’ewlets, Leq’a:mel, Sema:th, Mathexwi, Kwantlen, and Katzie territories. Mission is a rapidly growing and dynamic community of approximately 41,500 residents, located 15 minutes north of the US border and 70 kilometers east of Vancouver. Although Mission is part of a broader metropolitan area, it still maintains its distinct and welcoming small-town character.\n\nJob Description\nWe are looking for energetic, outgoing instructors to teach Aqua Fitness programs to our adult participants. Aquatic Fitness Instructors are responsible for planning and executing fitness classes within their scope of practice. The main focus is the safety and inclusivity of all class participants.\n\nQualifications\nCurrent BCRPA or Equivalent Aqua Fitness Certification\nCurrent Standard First Aid, CPR ‘C’ & AED certification\nExcellent customer service, communication, and interpersonal skills\n\nAdditional Information\nThe rate of pay for this position is $31.00 per hour plus 4% vacation pay.\n\nClick here to apply"
  },
  {
    "id": "d92f3a5f-132e-4178-adad-a994ceff900e",
    "company": "District of West Vancouver",
    "location": "West Vancouver, BC",
    "position": "Transit Operator",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105448",
    "source": "CivicJobs BC",
    "description": "TRANSIT OPERATOR\nPermanent Full-Time\n\nREVISED\n\nLocated on the traditional, ancestral and unceded lands of the Musqueam, Squamish, and Tsleil-Waututh Nations, West Vancouver is a vibrant community on the North Shore and home to parks, beaches, and to sports, recreation and arts amenities. Our dedicated staff deliver services, operate facilities and run the programs that enhance the well-being of our community. We are seeking employees with a passion for public service who share our commitment to creating a complete, inclusive and livable community.\n\nWest Vancouver Transit is calling for applications from drivers wishing to be considered to join our highly qualified team. Our conventional Transit Operators are key representatives of a transit organization rich in history dating back to 1912, dedicated to customer service, safety, and reliability. Transit Operators must be capable of accomplishing multiple tasks in a complex environment while demonstrating superior communication skills to deal effectively with the public. While working under established policies and procedures, Transit Operators work closely with departmental staff and must be able to exercise discretion and sound judgement. The successful candidate will be responsible for:\n\nSafely operating a transit vehicle from our fleet of buses in accordance with the Motor Vehicle Act of the Province of British Columbia, regulations and municipal bylaws, as well as policies and procedures as required by the transit department;\nDemonstrating courtesy and attention to passengers’ comfort and safety;\nProviding general information and assistance to passengers regarding routes, schedules and fares as required;\nCollecting and monitoring of fares, transfers, tickets and passes; and\n Performing other duties as required\n\n\nThe successful candidate will possess: a minimum Class 2 Driver’s Licence with air brake endorsement; a driver’s abstract and claims history which demonstrates a history of safe, reliable legal driving; experience operating a bus, truck or similar vehicle; and a demonstrated ability to deal effectively with the public. An acceptable Police Information Check with Vulnerable Sector and a copy of their credentials are required.\n\nPosition Status:\nUnion (ATU) – Permanent Full-Time\n\nHours of Work:\n40 hours per week, Hours vary based on a sign-up system.\nAll shifts will start and end on the North Shore.\n\nRate of Pay:\n$29.34 per hour after training, with the rate increasing every six months for the first two years until the top rate is reached. Current top rate: $39.12 per hour.\n\nTotal Compensation Overview:\nAttractive Health & Welfare Benefits Package\n(including single, couple & family options for, Extended Health, Dental, Sick Leave & Life Insurance)\n6 weeks of paid leave (prorated includes vacation & shorter work year)\nMunicipal Pension Plan Contributions plus benefits according to the ATU Local 134 Collective Agreement and District of West Vancouver\n\nClosing Date:\nOpen Until Filled\n\nTo Apply:\nPlease visit the District of West Vancouver’s Career Centre at westvancouver.ca/careers to apply for this position.\n\nWe want to thank all applicants, however only those chosen for an interview will be contacted.\n\n6029-25-ATU-10\n\nIf you have any questions please contact us at careers@westvancouver.ca"
  },
  {
    "id": "7f0bfe99-d99d-4bcc-9a5c-65cdb012bd6d",
    "company": "District of West Vancouver",
    "location": "West Vancouver, BC",
    "position": "Staff Lead, Pay Parking Programs (Re-Post)",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105447",
    "source": "CivicJobs BC",
    "description": "STAFF LEAD, PAY PARKING PROGRAMS (RE-POST)\n\n(Temporary Full-Time – Approximately 24 months)\n\nLocated on the traditional, ancestral and unceded lands of the Musqueam, Squamish, and Tsleil-Waututh Nations, West Vancouver is a vibrant community on the North Shore and home to parks, beaches, and to sports, recreation and arts amenities. Our dedicated staff deliver services, operate facilities and run the programs that enhance the well-being of our community. We are seeking employees with a passion for public service who share our commitment to creating a complete, inclusive and livable community.\n\nThe Engineering Services Department is seeking a temporary full-time Staff Lead, Pay Parking Programs, to oversee and coordinate all phases of the District of West Vancouver’s pay parking programs, and administer all aspects of service provider contracts in support of pay parking initiatives.\n\nThis position will be responsible for:\noverseeing all aspects of the pay parking programs including contract administration, collecting and maintaining statistics, conducting research and data analysis to evaluate program performance; and preparing reports and presentations;\nmanaging the Pay Parking Programs’ budget; making recommendations and implementing adjustments to service levels or policies as needed;\nunderstanding, developing, monitoring, and amending practical administrative policy and operations protocols related to the Pay Parking Programs;\nresearching and developing guidelines and best practices, identifying course of action and potential impact;\nimplementing future phases of the Pay Parking Programs and other related transportation initiatives;\npromoting awareness and understanding of the Pay Parking Programs with District employees and the community;\nhandling complaints and inquiries from the public; resolving disputes and investigating incidents and in coordination with service providers and District staff;\ndeveloping and delivering effective public presentations to Council and other stakeholders; coordinating with public outreach staff to inform the public of service changes, as necessary;\n participating in the preparation of procurement related documents with the District’s Purchasing Department;\ndeveloping and chairing inter-departmental steering committees if required;\nperforming other related work.\n\nThe preferred candidate will possess: excellent public relations, communications and problem-solving skills; the ability to work effectively independently and with a team; the ability to effectively organize work priorities and to perform most duties with minimal supervision; the ability to establish and maintain effective working relationships with a variety of internal and external contacts;  strong computer skills and aptitude for learning new application software; a valid class 5 driver’s license for the province of BC.\n\nThe successful candidate has completed a diploma or degree in Business Administration, Public Administration or Contract Management or related field, and has considerable related experience, preferably in a municipal environment; or an equivalent combination of training and experience.\n\nThe successful candidate will be required to provide an acceptable driver’s abstract, a police information check, and copies of relevant credentials.  To ensure your application is complete, please email your driver’s abstract to careers@westvancouver.ca\n\nApplications without a Driver’s Abstract submission will not be considered for further steps in the recruitment process.\n\nPosition Status: Exempt, Temporary Full-Time\nHours of Work: 35 hours per week (hours and days of work may vary)\nSalary: $83,000.00 - $93,500.00 per year (2024 rates) plus 14% in lieu of benefits\nClosing Date: 11:59 p.m. on Sunday, June 29, 2025\n\nTo Apply: Please visit the District of West Vancouver’s Career Portal at www.westvancouver.ca/careers to apply for this position.\n\nWe want to thank all applicants, however only those chosen for an interview will be contacted.\n\n25-EXEMPT-TEMP-08-RE-POST\n\nIf you have any questions please contact us at careers@westvancouver.ca"
  },
  {
    "id": "a629bcff-12ea-4bde-8f5b-4b0d5582570c",
    "company": "City of Burnaby",
    "location": "Burnaby, BC",
    "position": "Payroll Clerk 1",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105446",
    "source": "CivicJobs BC",
    "description": "Payroll Clerk 1\n\n\nCompetition No: 2025-007\n\nDuration: Regular Full Time\n\nSalary: $4,486 – 4,672 – 4,865 – 5,060 – 5,270/month (2024 Rates)\n\nSchedule: 70 hours bi-weekly; Monday to Friday from 8:00 AM – 4:45 PM (Nine-Day Fortnight)\n\nSpecial Notes: Normal for CUPE 23 Inside Division Collective Agreement\n\nLast Updated: 6/5/25\n\nAs employees, we joined the City to make a difference in the community. The Burnaby Promise sets out the responsibilities of every employee, every day, in every decision we make. It describes the standards that every employee should strive to meet when interacting with Burnaby residents, external and internal clients, and City colleagues. It gives us the tools to check our actions, particularly in times of conflict or challenge. When every employee lives by the Principles and Commitments in this document, we will collectively create a City we all want to be in, that fosters employee engagement, strengthens our relationships, and better serves our community through service excellence.\n\nThis position works in the org unit Payroll – Administrator. Reporting to the Payroll Supervisor, this is payroll processing, clerical, and data entry work involving rapid and accurate entering of information from source documents into the enterprise system payroll module. An incumbent reads small numbers and words and enters information from source documents such as time sheets and time cards into the enterprise system payroll module; performs a variety of clerical duties including dividing material to be entered into batches; adds up and totals specified information such as number of transactions, hours and records per batch for completion of batch headers; balances batches by comparing batch totals to input totals; and maintains Time Input-Control Documents. The Payroll Clerk 1 reviews information for reasonableness and accuracy; validates, balances and corrects errors with adherence to applicable Provincial and Federal laws, City policies and practices, Union Agreements and rigid time schedules. Checks accuracy of entered data against editing controls; corrects irregularities and routine system generated error messages by referring to appropriate contacts, on-line master data screens and source documents; and refers the more difficult or unusual problems to a supervisor for resolution. Other responsibilities include answering enquiries from various internal contacts regarding a variety of payroll matters such increments, vacation, banked overtime and Collective Agreement rules; triaging intermediate and advance payroll enquiries to the appropriate internal contact; and generating and preparing various payroll reports for internal and external contacts. Performs related work as required.\n\nQualifications include completion of Grade 12 supplemented by completion of the Payroll Compliance Legislation course of the Payroll Compliance Practitioner (PCP) required course work, typing and commercial courses or training in computer data entry procedures and equipment, plus some related experience; or an equivalent combination of training and experience. An incumbent will have sound knowledge of departmental functions and requirements applicable to payroll and data entry operations, modern office procedures, methods and equipment and the ability to use a calculator. Working knowledge of the enterprise system payroll module, City regulations, practices, policies, and Collective Agreements applicable to the work performed. The Payroll Clerk 1 will also have the ability to perform data entry procedures and operate the alpha and numeric keyboard with a high degree of speed and accuracy; perform accuracy and balancing checks, correct irregularities and routine system generated error messages, maintain records and perform related clerical work. Other qualifications include the ability maintain established standards and to perform repetitious work under rigid time schedules; deal tactfully and effectively with internal contacts on matters related to the work and maintain effective working relationships with employees, supervisors, and department officials.\n\nThis competition has been extended until it is filled. New applications are welcome!\n\nThe City of Burnaby acknowledges that we are on the ancestral and unceded homelands of the hən̓q̓əmin̓əm̓ and Sḵwx̱wú7mesh Sníchim speaking peoples, and we are grateful to be on this territory as we dedicate ourselves to creating an inclusive and diverse workforce that reflects our vibrant community and welcomes applicants of all backgrounds, genders, ages, ethnicities, abilities, sexual orientations, and life experiences.\nCopies of relevant professional certificates, degrees, or tickets will be required at the time of the interview. \nPlease contact People and Culture at 604-294-7303 if you do not receive a confirmation email within one hour of submitting your application online. \nWe thank all applicants for their interest; however, only those considered for an interview will be contacted\n\nApply to this position\n\nEQUAL OPPORTUNITY EMPLOYER\nVisit us at www.burnaby.ca"
  },
  {
    "id": "07a41799-44e2-4bfe-a71d-63982ad762c9",
    "company": "City of Burnaby",
    "location": "Burnaby, BC",
    "position": "Senior Information Security Officer",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105445",
    "source": "CivicJobs BC",
    "description": "Senior Information Security Officer\n\n\nCompetition No: 2025-076\n\nDuration: Regular Full Time\n\nSalary: $164,489 - 169,072 - 173,638 - 178,204 - 182,769 per year with $11,412 annual stipend\n\nLast Updated: 6/5/25\n\nAs employees, we joined the City to make a difference in the community. The Burnaby Promise sets out the responsibilities of every employee, every day, in every decision we make. It describes the standards that every employee should strive to meet when interacting with Burnaby residents, external and internal clients, and City colleagues. It gives us the tools to check our actions, particularly in times of conflict or challenge. When every employee lives by the Principles and Commitments in this document, we will collectively create a City we all want to be in, that fosters employee engagement, strengthens our relationships, and better serves our community through service excellence.\n \nWe have an exciting opportunity for you to join our team as a Senior Information Security Officer! Reporting to the Deputy Chief Information Officer – Planning and Government, the Senior Information Security Officer (SISO) is a technology leader that establishes, directs, implements and maintains the City’s enterprise cybersecurity program.\n \nThe incumbent will identify, evaluate and report on some or all legal and regulatory, IT and cybersecurity risk to information assets, while supporting and advancing business objectives. This position will determine the cybersecurity approach and operating model in consultation with stakeholders and align with the City’s risk management approach and compliance monitoring of non-digital risk areas. You will implement practices that meet policies and standards for cybersecurity to ensure that information assets and associated technology, applications, systems, infrastructure and processes are protected in the digital ecosystem in which the City operates such as firewalls, intrusion detection/prevention, and data encryption. Furthermore, you will serve as the process owner of the appropriate second-line assurance activities related to confidentiality, integrity and availability of information owned or processed by the City such as periodic security audits to assess effectiveness and identify area of improvement. Additionally, you will coordinate the development of implementation of incident response plans and procedures to ensure that business-critical services are recovered in the event of a security event. Duties also include directing the creation of a targeted cybersecurity awareness training program for staff, contractors and approved system users. Along with developing and overseeing effective resilience policies and standards to align with the enterprise resilience program goals, with the realization that components supporting primary business processes may be outside the City’s perimeter. Other responsibilities will include liaising with external agencies, such as law enforcement and other advisory bodies, as necessary, to ensure that the organization maintains a strong security posture and is kept well-abreast of the relevant threats identified by these agencies. Performs related work as required.\n \nThe ideal candidate will possess a Master’s or Bachelor’s degree in Computer Science, Information Security, Business Administration or related field with a minimum of seven years of recent experience in the field of cybersecurity with five years’ experience at the management level preferably in municipal government, plus required technical and or project certifications OR an equivalent combination of education, training and experience. The role requires expert knowledge of frameworks, principles, practices, techniques, legislation, methods and procedures applicable to the work as well as considerable knowledge of City rules, regulations, policies, procedures, practices and operations related to the work performed, the functions, projects and operations of all City departments and their requirements. The successful candidate will have the ability to lead a team of direct and functional reports, and recruit, performance management, train, coach and investigate and administer discipline. You will have the ability to support a wide variety of technology projects while exercising sound judgement and discretion under tight deadlines and constant change. You will have the ability to develop, communicate, implement and evaluate information security initiatives while handling sensitive, contentious, complex and highly confidential issues involving multiple stakeholders with skill, tact and diplomacy. Other skills required include leading investigations, analyzing impacts, making recommendations on Information Security incidents and events along with the skill and the use of various software applications.\n \nThe closing date for this position has been extended until filled. New applications are welcome!\n \nThe City of Burnaby acknowledges that we are on the ancestral and unceded homelands of the hən̓q̓əmin̓əm̓ and Sḵwx̱wú7mesh Sníchim speaking peoples, and we are grateful to be on this territory as we dedicate ourselves to creating an inclusive and diverse workforce that reflects our vibrant community and welcomes applicants of all backgrounds, genders, ages, ethnicities, abilities, sexual orientations, and life experiences.\n \nCopies of relevant professional certificates, degrees, or tickets will be required at the time of the interview. \n \nPlease contact People and Culture at 604-294-7303 if you do not receive a confirmation email within one hour of submitting your application online. \n \nWe thank all applicants for their interest; however, only those considered for an interview will be contacted\n\nApply to this position\n\nEQUAL OPPORTUNITY EMPLOYER\nVisit us at www.burnaby.ca"
  },
  {
    "id": "633a576e-afc2-4a47-8769-0fdb3aab6a3c",
    "company": "City of Burnaby",
    "location": "Burnaby, BC",
    "position": "Foreperson 1 - Grounds Maintenance",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105444",
    "source": "CivicJobs BC",
    "description": "Foreperson 1 - Grounds Maintenance\n\n\nCompetition No: 2025-181\n\nDuration: Regular Full Time\n\nSalary: $6,275 – 6,536 – 6,807 – 7,086/month (2024 Rates)\n\nSchedule: 80 hours bi-weekly; Monday to Friday from 7:00 AM – 3:30 PM\n\nSpecial Notes: Subject to Note ‘H’ of Schedule ‘B’ of the CUPE 23 Foreperson’s Division Collective Agreement\n\nLast Updated: 6/16/25\n\nThis position works in the Grounds Maintenance – Grass organizational unit. This is supervisory work in the planning, assigning, supervising, reviewing and as required, participating in the work of one or more crews of subordinates engaged in a variety of Parks grounds maintenance and minor construction tasks. Considerable independence of judgement and action are exercised in the day-to-day utilization of personnel and grass division equipment (e.g., 3/4 ton trucks, tractors & related Grass Division implements, front end loaders, riding mowers, 2 ton dump and garbage trucks, trailers etc.). Assists in the preparation of preliminary budget estimates and monitors actual expenditures and advises a supervisor of any anticipated problems. Motivates, allocates, and disciplines members of crews, ensures safety of crews and public by advising and enforcing observance of accident prevention methods and precautions. Trains Parks staff in the safe operation of mobile equipment. Prepares and maintains a variety of related records and reports. Matters of a more complex or policy nature are referred to a supervisor who reviews work performance on the basis of conformance to established standards. Performs related work as required.\n\nQualifications include completion of Grade 12, preferably supplemented by training or courses related to the work plus considerable related experience or an equivalent combination of training and experience. Considerable knowledge of the methods, practices, materials and equipment used in parks grass grounds maintenance; as well as the hazards and safety precautions applicable to grass maintenance work. Ability to plan, assign, supervise, review and participate in the work of subordinate crews. Ability to prepare and maintain records and reports related to the work. Ability to establish and maintain effective working relationships with subordinates and the public. Skill in the use and care of equipment, materials and vehicles used in the work. The successful candidate will be required to accept standby and call-out work as required by the department. A Driver’s Licence for the Province of British Columbia is required.\n\nPlease apply online by June 25, 2025. \n\nCopies of relevant professional certificates, degrees, or tickets will be required at the time of the interview. Please contact People and Culture at 604-294-7303 if you do not receive a confirmation email within one hour of submitting your application online at www.burnaby.ca/careers. We thank all applicants for their interest; however, only those considered for an interview will be contacted\n\nApply to this position\n\nEQUAL OPPORTUNITY EMPLOYER\nVisit us at www.burnaby.ca"
  },
  {
    "id": "606178f0-1954-4d71-a8ee-47fbbee0a33c",
    "company": "District of Saanich",
    "location": "Saanich, BC",
    "position": "Engineering Technician III",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105443",
    "source": "CivicJobs BC",
    "description": "DISTRICT OF SAANICH\nENGINEERING\nTRANSPORTATION AND DEVELOPMENT SERVICES\n \n\nENGINEERING TECHNICIAN III\n\nPermanent Part Time\n \nThe District of Saanich is the largest municipality in beautiful Greater Victoria, blending both the urban and rural environment and home to approximately 124,000 citizens.  Employing more than 1,500 staff, our greatest asset is a high performing workforce. Recently named one of BC’s Top Employers for 2025, we provide a collaborative, exciting and progressive work environment that consistently attracts top-quality people, enables them to perform at their best and grow their skills. Our competitive wages, excellent benefits package, generous pension plan, flexible work program supporting an inclusive work environment and progressive initiatives make the District of Saanich a highly desirable place to invest your talent.\n \nThe Transportation and Development Services Division oversees the design and installation of municipal-owned and 3rd party infrastructure within municipal rights-of-way. Working under the direction of the section manager or Engineering Supervisor, the Engineering Technician III performs technical work at a semi-professional level. Duties involve both field and office assignments related to the field of civil engineering design, including transportation design, inspection of construction projects within the municipality, project documentation, and liaising with the public and consultants. This position manages projects as defined within the framework and guidance developed by the Project Management Office.\n \nRequirements include: a two year post-secondary program in Civil Engineering Technology; three years of directly related experience in civil engineering design including drafting, public works inspection, project documentation, and estimating; eligible to be registered as an AScT with the Applied Science Technologists and Technicians of BC; conversant with computer based engineering applications including AutoCAD Civil 3D and Bluebeam Revu, and a valid Class 5 BC Driver’s Licence.  Candidates with an equivalent combination of education and experience may be considered.\n \nThe successful candidate will work Monday to Friday, 1:00 p.m. – 4:30 p.m. (17.5 hours per week).\n \nThis is a C.U.P.E. Local 2011 position with a wage of $42.61 per hour (2024 rate) and an excellent benefits package. Job description and competition information can be found at www.saanich.ca. Please apply by 11:45 p.m. on Monday July 7, 2025 quoting competition number 25163. In addition to the interview process, testing will be conducted. Although we thank all applicants for applying, only those under consideration will be contacted.\n \nThe District of Saanich is recognized as one of BC’s Top Employers for 2025. As an equitable and inclusive employer, we value diversity of people to best represent the community we serve and provide excellent services to our citizens. We strive to attract and retain passionate and talented individuals of all backgrounds, demographics, and life experiences. If you require any adjustments to enable participation at any stage of the recruitment process, please contact in confidence accessibilityHR@saanich.ca"
  },
  {
    "id": "aae37294-a694-41f9-9c0c-1f3fbd6a757d",
    "company": "City of Vancouver",
    "location": "Vancouver, BC",
    "position": "Civil Engineer I",
    "postedDate": "14 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105442",
    "source": "CivicJobs BC",
    "description": "Civil Engineer I\nRequisition ID: 43859 \n\nOrganization\nLocated on the traditional, ancestral and unceded lands of the xʷməθkʷəy̓əm (Musqueam), Sḵwx̱wú7mesh (Squamish), and səlilwətaɬ (Tsleil-Waututh) Peoples, Vancouver has a commitment to becoming a City of Reconciliation. Vancouver consistently ranks as one of the world’s most liveable and environmentally sustainable cities. Named among Canada's Top 100 Employers, BC's Top Employers, and Canada's Greenest Employers, the City of Vancouver seeks colleagues who can help shape and embody our core commitments to sustainability, reconciliation, equity and outstanding quality of life for all residents.\n\nConsider joining our committed team of staff and being part of an innovative, inclusive and engaging workplace. Working at the City of Vancouver and within the public service can be a rewarding career where you play a key role in ensuring impartial and equitable access to services, upholding ethical governance, and addressing the needs of citizens with integrity and dedication.\n\nMain Purpose and Function\nThe Project Engineer represents the Engineering department in development applications land development projects that fall under the Minor Project section of the Development and Major Projects branch.\n\nKey Contacts and Reporting Relationships\nThe position reports to the Section Head of Minor Projects. The position works in a small team of staff made up of civil engineers, and support staff. The Project Engineer works with a number of branches in the department as well as interdepartmental staff, representing the department’s interests in development projects in the policy, rezoning, permitting and construction phases.\n\nSpecific Duties/Responsibilities\nResponsible for facilitating development in the rezoning and development permit application process and construction phases\nNegotiates directly with internal staff, developers, consultants and outside agencies to establish the City’s needs for developer related infrastructure improvements.\nImplements and provides input on development conditions for rezoning and development permit applications through coordinating the department’s review with feedback from various internal groups and preparing memos and reports for approval, including conflict resolution.\nProvides technical advice and resolves technical issues and conflicts with other departments, developers, architects, engineers, and contractors including organizing and attending meetings\nResponsible for instructing Legal Services and reviewing draft agreements to facilitate development, primarily for the purposes of securing development conditions for public works and rights-of-way\nAdministers collection of letters of credit / security and cash payments for permits\nSupport developing relevant department by-laws, policies and guidelines\nFosters the relationship between the City and the development/construction industry, with a focus on minimizing impacts to residents, business owners and the public\nChairs meetings between internal staff, developers, and consultants\nMakes presentations to Council, Committees of the Whole, and advisory committees to Council\nManages the design, construction, and acceptance process for large-scale developer funded road works including financial account management\nResponds to public enquiries regarding development projects\nOther duties/responsibilities as assigned\n\nMinimum Qualification Requirements\nEducation and Experience:\nBachelor’s degree in Civil Engineering with a Professional Engineer designation and a minimum of 4 years related experience involving a broad range of engineering, operational and administrative responsibilities, or equivalent combination of education and experience.  Registration or eligibility for registration as a Professional Engineer in British Columbia. An experienced Engineer-In-Training will also be considered.\nMunicipal Engineering experience would be an asset.\n\nKnowledge, Skills and Abilities:\nExtensive knowledge in the City’s land development process and relevant City by-laws\nExperience in engineering and project management including planning, detailed design, construction, and contract management of engineering projects.\nDemonstrates a clear understanding of the department’s role in the land development process\nAbility to effectively negotiate complex issues with developers in the best interest of the department, City, and taxpayers\nAbility to build relationships and influence others while respecting the sensitive and political challenges that impact decisions\nAbility to manage multiple projects and processes with competing schedules and resources\nStrong written and oral communication skills\n\nWhere operationally appropriate and subject to change, the City of Vancouver has a Flexible Work Program. This program allows staff to work a hybrid work week from locations that are a daily commutable distance from their work at a City worksite.  At this time this position is eligible to be part of the Flexible Work Program.\n\nBusiness Unit/Department: Engineering Services (1300) \n\nAffiliation: Exempt \n\nEmployment Type: Regular Full Time \n\nPosition Start Date: July 2025 \n\nSalary Information: Pay Grade RNG-080: $99,947 to $124,934 per annum (P.Eng), Pay Grade RNG-060: $77,680 to $97,060 per annum (EIT)\n\nApplication Close: June 23, 2025\n\nAt the City of Vancouver, we are committed to recruiting a diverse workforce that represents the community we so proudly serve. Indigenous peoples, people of colour, 2SLGBTQ+ persons including all genders and persons with disabilities are encouraged to apply.  Accommodations will be provided upon request during the selection process. Learn more about our commitment to diversity and inclusion. \n\nBefore you click Apply now\n\nOnce you start your application you can save your work and leave the applications page, however please remember to submit your profile to the specific job requisition before the posting closing date.\n\nIn addition to uploading your cover letter and resume, part of the application process may include answering application questions related to the preferred requirements of the role which may take approx. 5-10 minutes. Cover letters should express interest and highlight additional information relevant to the position and resumes should include a summary of skills and experience related to the position.\n\nApply here"
  },
  {
    "id": "b81c4419-3678-44f7-ad86-441c782cc04d",
    "company": "District of North Vancouver",
    "location": "North Vancouver, BC",
    "position": "Ecology Centre Programmer",
    "postedDate": "15 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105441",
    "source": "CivicJobs BC",
    "description": "District of North Vancouver\nEcology Centre Programmer\n\n(Regular Part-Time)\n\nHome to vast parkland and attractions including Grouse Mountain, Lynn Canyon and Capilano Suspension Bridge, the District of North Vancouver is inspired by nature, and enriched by people. Designated one of BC’s Top Employers for six years, the District offers exciting professional development opportunities and a competitive total compensation package. This is an exciting time to join the District, as we embark on a range of initiatives to transform digital service delivery, customer experience, and our approach to climate action. Known for being a flexible, family-friendly employer with an inclusive workplace culture, the District of North Vancouver is an exceptional place to work. If you are civic-minded and interested in making an impact on people and businesses on the beautiful North Shore, consider working for the District of North Vancouver.\n \nWe have an opportunity available within our Parks Department for a Regular Part-Time Ecology Centre Programmer to help support the effective operation and maintain our high service levels at the Ecology Centre. This is specialized nature interpretation and educational work involving developing and implementing educational and special events programs at the Ecology Centre. The successful incumbent develops, leads, promotes and evaluates educational and special events programs; and cooperates with other staff in researching and writing display materials. The position also trains, directs and oversees the work of part-time staff and volunteers. The work is performed under general supervision and considerable independence and judgement are exercised in carrying out day-to-day functions. Unusual matters and policy issues are discussed with a superior who reviews work performance for effectiveness of services provided.\n \nThe successful candidate will possess:\n\nConsiderable knowledge of the methods, objectives and practices applicable to developing, leading, evaluating and promoting Ecology Centre programs and activities.\nConsiderable knowledge of natural history and ecological principles of the pacific northwest.\nSound knowledge of Centre operations and the rules, regulations and policies governing the work performed.\nAbility to develop, lead, promote, and evaluate educational programs and activities, community outreach, birthday parties.\nAbility to direct, assign and review work of part-time staff and volunteers, provide training, and participate in recruitment and selection as required.\nAbility to communicate effectively orally and in writing, and to prepare a variety of materials related to the work such as texts and press releases.\nAbility to establish and maintain effective working relationships with the general public, schools, and other groups.\nAbility to research materials related to the development of exhibits, displays and programs.\nAbility to perform a variety of miscellaneous clerical and janitorial tasks in support of Centre operations and perform regular cashier duties as needed.\n\n\nQualifications\nA Diploma from a community college in a program related to ecology, plus sound related experience preferred. Level 1 First Aid Certification and a valid Class 5 BC Driver’s Licence are required.\n\nDetails\nSalary: The pay range for this unionized position is $33.25 to $39.14 per hour (2024 rates).\n \nHours of Work: Based on a 17.5 hour workweek (Hours take place over Sunday, Monday, and Tuesday).\n\nApply\nThe District of North Vancouver is committed to creating a diverse, inclusive, and accessible work environment. If you have what we’re looking for and have a passion to serve people and the community, and a demonstrated commitment to supporting a healthy and safe workplace, we would like to hear from you. Please apply on-line at https://careers.dnv.org by June 30, 2025.\n \nIf you require accommodation to participate in the recruitment process, please inform us when we contact you.\n \nWe thank you for your interest in employment with the District of North Vancouver and advise that only those shortlisted for an interview will be contacted.  \n\nWe respectfully acknowledge the Coast Salish peoples, specifically the xʷməθkʷəy̓əm (Musqueam), Sḵwx̱wú7mesh Úxwumixw (Squamish), and səlilwətaɬ (Tsleil-Waututh), on whose ancestral lands the District of North Vancouver is located."
  },
  {
    "id": "9ca68f08-9880-45b7-a9de-f81dc2298343",
    "company": "Métis Nation British Columbia",
    "location": "Victoria, BC",
    "position": "Child Care Navigator",
    "postedDate": "15 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105440",
    "source": "CivicJobs BC",
    "description": "Métis Nation British Columbia\n\nChild Care Navigator\n\n\nCompetition #\n25-086\n\nCompensation\n$55,000 - $68,000\n\nClassification\nNation Support 2\n\nLocation\nHybrid\nNanaimo\nVictoria\n\nPeriod of Employment\nPermanent\n\nHours Per Week\n37.5\n\nHours of Work\nFull Time\n\nDate Posted\nJune 16, 2025\n\nClosing Date\nJune 30, 2025\n\nAbout the Opportunity\nThe Child Care Navigator partners with early learning and child care services and program, Métis families and communities throughout the province and provides consistent, distinctions-based, and Métis-led delivery of child care supports and services.  The Navigator works to increase the availability and accessibility of high-quality child care resources and services that support the needs of Métis children and families. The position works collaboratively with the Ministry of Education team, Métis families and Métis Chartered communities to advance the successful, efficient, and effective delivery of MNBC Métis early years programs and services. \n\nDoes this role sound perfect to you, yet you don’t check every box?\nWe at MNBC realize that qualifications and experiences may look different for everyone.  If this career opportunity is of interest to you and your experience may not perfectly align with every qualification, we still encourage you to apply. \n\nMNBC thanks all applicants for their interest. Pursuant to Section 41 of the BC Human Rights Code, preference may be given to applicants who self-identify as Indigenous (First Nation, Métis, or Inuit). All qualified candidates are encouraged to apply. Only applicants shortlisted for interview will be contacted.\n\nWe strive to provide an accessible candidate experience for our candidates with different abilities. If you require any accommodations to support you through the application process, please reach out to the People & Culture department at hr@mnbc.ca.\n\nAbout Métis Nation British Columbia\nMétis Nation British Columbia (MNBC) develops and enhances opportunities for our Métis communities by implementing culturally relevant social and economic programs and services. Through teamwork, respect, dedication, accountability, integrity, and professionalism, MNBC strives to build a proud, self-governing, sustainable Nation in recognition of inherent rights for our Métis citizens, assisting in the delivery of services based on policy, process, and specified regulations.\n\nMNBC reflects an equitable, diverse, and inclusive work environment. We respect the unique characteristics, backgrounds, and experiences that our employees bring to the organization and the communities we serve. We are committed to lateral kindness based on Métis cultural values that promote social harmony and healthy relationships.\n\nHow To Apply\nEmail: careers@mnbc.ca\n\nPlease submit your cover letter resume, and a copy of your credentials to careers@mnbc.ca, using \"Child Care Navigator - #25-086\" in the subject line of the email.\n\nJob Description"
  },
  {
    "id": "c92442bf-1ede-4d21-8aca-310c225a2c11",
    "company": "City of Nanaimo",
    "location": "Nanaimo, BC",
    "position": "Police Records Clerk",
    "postedDate": "15 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105439",
    "source": "CivicJobs BC",
    "description": "Discover Nanaimo - One of the oldest cities on Canada’s west coast, the City of Nanaimo is a growing, livable urban centre that still maintains its historic charm.  Situated between the mountains and the ocean on the east coast of Vancouver Island, Nanaimo is a short ferry trip away from Metro Vancouver, and a 90 minute drive from Victoria. Nanaimo is truly an extraordinary community that is home to Vancouver Island University and is rich in parks, recreational, cultural and social amenities.\n\nPolice Records Clerk\n\n\nPosition Overview\nThe City of Nanaimo is seeking a permanent full-time Police Records Clerk. Under the general supervision of the Manager, Police Support Services, and under the direct supervision of the Records Supervisor, the incumbent enters, removes, and edits all relevant data into the Police Records Information Management Environment (PRIME) the Canadian Police Information Centre (CPIC) and other RCMP systems as required. The incumbent performs quality assurance reviews by “reading” and classifying operational files in the second instance. The work is detailed in nature and constitutes final quality assurance checks on operational files for all RCMP sections.\n \nQualifications\nApplicants must have completion of grade 12 and a minimum 2 years’ related experience, including experience in a law enforcement office environment or data entry experience. An equivalent combination of education and experience may be considered. Attainment and maintenance of RCMP Reliability/Security Clearance is mandatory.\n\nAdditional Information\nThis is a CUPE bargaining unit position based on a 35-hour work week, and subject to Article 1(d) - Probationary Period as set out in the Union Collective Agreement. The hourly wage is $36.81, increasing to $38.75 after 60 working days (Jan 2025 Rates). Hours of work will be 7-hour days between 8:00 a.m. to 11:30 p.m., Sunday through Saturday. Shortlisted applicants may be required to undergo a criminal record check and/or a verification of their education credentials.\n \nTo apply for this opportunity, please submit a resume and cover letter (.docx or PDF file format) to employment.opportunities@nanaimo.ca referencing the specific competition 25-39.\n \nFor detailed information on this position and for more information on our community, please visit our website at https://www.nanaimo.ca.\n\nPosting Date\nMonday, June 16, 2025\n \nApplication Deadline\nOpen until filled\n\nContact Information\nHuman Resources\nCity of Nanaimo\n2nd Floor, 455 Wallace Street\nNanaimo, BC  V9R 5J6\nPhone: (250) 755-4406\n\nThe City of Nanaimo is an inclusive employer that values diversity and invites applications from all qualified individuals who are legally entitled to work in Canada. We thank all applicants in advance for their interest; however, only those selected for further consideration will be contacted. If shortlisted for the role and need an accommodation within the hiring process, we would be pleased to discuss how best to accommodate your needs."
  },
  {
    "id": "fa81f555-5d4c-4e9d-92ed-94d1f81b5938",
    "company": "City of Camrose",
    "location": "Camrose, AB",
    "position": "Operator 4 - Roads",
    "postedDate": "16 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105438",
    "source": "CivicJobs BC",
    "description": "Operator 4 - Roads \n\n\nJob Type\nOther\n\nOrganization\nThe City of Camrose\n\nClosing date\nJul 4, 2025\n\nJob Description\nThe City of Camrose is seeking an energetic and reliable individual to fill the permanent position of Operator 4 in the Roads section of the Public Works department. This is a unionized position under CUPE Local 1425 and is inclusive of a probationary period as per the Article 11.02 of the Collective Agreement.\n \nFUNCTIONS/DUTIES (but not limited to): \n\nOperate and perform minor maintenance on a large grader (2023 Cat 140 AWD joystick control).\nWork in all related areas of the Roads operations, which includes but not limited to: snow removal, road maintenance, traffic control, equipment maintenance.\nSafely operate and maintain equipment such as single/tandem axle trucks, front-end loaders, skid steer and tool cat, plows or sweeper, self-propelled road packers, small self-propelled machines such as sweepers and/or snowplow equipment, equipment trailers, asphalt grinding, spray patch, tarring and a hot box, etc.\nPerform basic manual labour using hands or common labour tools, complex hand held and affixed power tools and machines, light maintenance to equipment and vehicles.\nSet-up and work within a traffic zone.\nMay supervise and direct daily work of other employees.\nOther related duties as assigned.\n\n\nQUALIFICATIONS: \n\nHigh School Diploma or GED equivalent.\nExperience and educational background with various aspects of Roads operations are considered an asset (i.e. roadway maintenance, equipment operations and general maintenance, etc.).\nExtensive grader experience and applicable courses/training.\nFormal supervisory training considered an asset.\nStrong written and verbal communication skills with the ability to communicate with the public and contractors in a professional manner.\nIntermediate computer skills.\nReliable with a strong work ethic with the ability to work independently or in a team setting.\nMust be able to meet the City’s “on-call protocols” and will be required to participate in the on-call rotation within the Roads team.\nAbility to exert moderate physical activity and work outside in all types of weather and environmental conditions year round.\nValid Class 3 Alberta Motor Vehicle Operator’s License with air brake endorsement.\n\n\nHOURS OF WORK: Hours of work are generally 8:00 a.m. to 5:00 p.m. Monday through Friday. Shift work, on-call and overtime will also be necessary to address operational requirements.    \n\nHOURLY WAGE: $34.25 per hour in accordance with the CUPE 1425 Collective Agreement.\n \nApplication Return\nAPPLICATIONS: Individuals interested in this position are invited to submit a cover letter and resume to the address below by July 4, 2025 at 4:30 p.m. If applying by e-mail, please ensure the position title is included in the subject line. We appreciate and consider all applications; however, only candidates selected for interviews will be contacted.\n\nCONTACT:\nCity of Camrose, Attention: Manager of Roads\nAddress: 4202 - 51 Avenue, Camrose, AB T4V 0S8 \nP: 780.672.5513 | E: hr@camrose.ca | W: www.camrose.ca"
  },
  {
    "id": "096f78d4-5ff2-4a79-a372-1ba09dda417d",
    "company": "Township of Langley",
    "location": "Langley, BC",
    "position": "Fire Prevention Inspector",
    "postedDate": "16 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105437",
    "source": "CivicJobs BC",
    "description": "Be a part of something great!    \nTownship of Langley\n\nFire Prevention Inspector\n\n\nCompetition Number:                            \n25-F003\n\nEmployment Type:                                 \nRegular Full-Time\n\nPay Rate:                                                \n$44.10 - $66.78 per hour (2025 rates), plus benefits\n\nHours of Work:                                       \n37.5 hours per week; Hours of work are per the Collective Agreement\n\nCompetition Opening Date:                  \nJune 16, 2025\n\nCompetition External Closing Date:    \nJune 30, 2025\n\nThe Township of Langley is considered one of the fastest growing communities in British Columbia. While balancing our unique mix of urban growth and rural beauty, our community is committed to providing opportunities for business, housing, and recreational facilities, and services. As an employer, we offer competitive salaries, excellent benefit packages, and opportunities for continued professional development and career growth.\n\nWe are currently recruiting for a regular full-time Fire Prevention Inspector in the Fire Division. Reporting to the Fire Prevention Officer(s), in this position you will inspect all types of public and private buildings ensuring compliance with municipal, provincial and federal fire prevention codes, bylaws and statutes and provide fire prevention advice and information to property owners, occupants and public. This position requires sound independent judgment while working within established guidelines and procedures.\n\nResponsibilities:\n\nRespond to complaints, and liaise with other regulatory agencies on issues exceeding the Township’s jurisdiction\nIssue orders and/or municipal tickets and authorize extensions as appropriate\nReview fire safety plans/construction fire safety plans for compliance with BC Fire Code and applicable standards\nParticipate in evaluating equivalencies to established codes, standards, and regulations for specific circumstances\nParticipate in fire and life safety education programs, talks, seminars and demonstrations\nDevelop pre-incident fire plans for use by fire suppression crews and use computer software to prepare and update floor plans and site drawings\nCompile data pertaining to building features such as size, framing materials, and personnel hazards\nAssist Fire Prevention Officers with fire cause and origin investigations as required\nPerform related work as required\n\n\nKnowledge, Abilities and Skills:\n\nSound knowledge of fire prevention, inspection and investigative methods, procedures, bylaws, codes, statutes, and regulations\nSound knowledge of building construction, mechanical and structural components, wiring, and industrial processes including chemical reactions, and flammable and combustible materials and liquids\nAbility to establish and maintain effective working relationships and communications with a variety of internal/external contacts, related agencies and public\nAbility to maintain a high standard of professionalism, integrity, reliability and credibility\nAbility to prepare a variety of records, reports, correspondence and presentation materials\nAbility to communicate effectively both verbally and written, and deal firmly and tactfully with internal/external stakeholders including property owners, the public and other professionals\nEstablished PC skills and experience in using relevant software applications (Microsoft Office, Outlook, PowerPoint, FDM, & Tempest)\n\n\nEducation and Experience:\n\nCompletion of Grade 12 supplemented by training in firefighting and/or fire protection technologies or an equivalent combination of training and experience\nPost-secondary degree or other designation related to the fire service and certifications in Fire Inspector, Fire Investigator, Fire & Life Safety Educator, Fire Service Instructor, Plan Checking, or B.C. Building Code – Part 3, or an equivalent combination of training and experience is desired\nPreferred courses may include but are not limited to FireSmart BC Local Representative, BC Fire Code; BC Building Code, Automatic Sprinkler and Standpipe Testing, Fire and Life Safety Educator Level 1.\nDemonstrated knowledge of the BC Fire Code and BC Building Code\nNFPA 1031 Standard for Professional Qualifications for Fire Inspector and Plan Examiner, Level I, or higher\nProvincial certificate in Building Trades Qualification and/or airbrake endorsement are considered assets\n\n\nThe Fire Department has a residency requirement, and the boundaries include the western border of West Vancouver, metro Vancouver municipalities to the North, the U.S. border to the South, and the eastern borders of Mission and Chilliwack.\n\nRequired Licenses/Certificates/Qualifications (attach all required documents with your application):\n\nValid Class 5 BC Driver’s License or valid Driver’s License for where you reside. You must include with your application a current Personal Driving Record (select the 5-year option if obtaining online) that has been obtained within 6 months of the closing date of this competition. To obtain a copy of your Personal Driving Record, please contact ICBC directly. Please note that a copy of your Driver’s License or the Driver Factor Report will not be accepted.\n\n\nThis position is defined by the Township of Langley as a position of trust. The successful candidate will be required to have a Police Information Check as a condition of employment (not required at the time of the initial application)\n\nApply Now\nVisit tol.ca/careers to apply for this exciting career opportunity in a growing community. The Township of Langley is an equal opportunity employer.\n\nWe appreciate all applications; however, only short-listed candidates will be contacted for an interview."
  },
  {
    "id": "4c725afc-6274-4483-bd79-c64fdc0db39a",
    "company": "Township of Langley",
    "location": "Langley, BC",
    "position": "GIS Technician II",
    "postedDate": "16 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105436",
    "source": "CivicJobs BC",
    "description": "Be a part of something great!    \nTownship of Langley\n\nGIS Technician II\n\n\nCompetition Number:                            \n25-U082\n\nEmployment Type:                                 \nRegular Full-Time\n\nPay Rate:                                                 \n$37.58 - $44.22 per hour (5 steps, 2024 rates) plus benefits\n\nHours of Work:                                       \n35 hours per week; Monday to Friday, 8:30am – 4:30pm\n\nCompetition Opening Date:                  \nJune 16, 2025\n\nCompetition Internal Closing Date:\nJune 24, 2025\n\nCompetition External Closing Date: \nJune 30, 2025\n\nJob Overview\nThe Township of Langley is currently recruiting for a regular full-time GIS Technician II to join our team of professionals in the Information Technology Division, Geomatics Services Department. Reporting to the Manager, Geomatics Services, in this unionized position you will prepare and maintain base municipal GIS spatial information using a variety of computer applications, techniques and equipment.\n\nResponsibilities\n\nMaintain municipal spatial data related to legal/cadastral data, water, sanitary, drainage and road systems\nResearch, compile and assemble non-graphic data from various municipal files, charts and similar records for conversion and entry to the GIS system\nPrepare maps and graphic presentations of various sizes, scales and materials\nProvide content advice on standard and custom map products\nProvide training and direction to staff on maintenance software capabilities, corporate digital data standards and the use of GIS related data\nPerform related work as required\n\n\nQualifications\n\nCompletion of Grade 12, supplemented by courses in GIS from a recognized post-secondary institution, plus sound related municipal mapping experience or an equivalent combination of training and experience\nSound knowledge of policies, procedures, practices and regulations as it relates to geomatics\nWorking knowledge of coordinate geometry and survey computations with the ability to research, compile, enter, analyze and assemble geographic and associated geographic-based data using the GIS system\nAbility to train or direct GIS users on the capabilities, standards and procedures related to GIS maintenance and related software\nGIS certificate or diploma from a recognized post-secondary educational institution is an asset\nExperience reading and interpreting engineering drawings related to water, sanitary, drainage and other municipal utilities is an asset\nExperience using Esri products to maintain municipal infrastructure data from engineering drawings is an asset\n\n\nRequired Certifications/Licenses\nCandidates must have the following valid and current certifications/licenses (must be valid at the time the posting closes) and these must be attached with your application.\n\nBC Class 5 (full-privilege) Driver’s License or equivalent driver’s license for where you reside. You must include with your application a current Personal Driving Record (select the 5-year option if obtaining online) that has been obtained within 6 months of the closing date. To obtain a copy of your Personal Driving Record, please contact ICBC directly or the driving authority where you reside. Please note that a copy of your Driver’s License or Driver Factor Report will not be accepted.\n\n\nApplications without the attached required documents above will be deemed incomplete and may not be considered. Please title your attachments with the number of this competition and have these documents ready to upload when you apply.\n\nApply Now\nVisit tol.ca/careers to apply for this exciting career opportunity in a growing community. The Township of Langley is an equal opportunity employer.\n\nWe appreciate all applications; however, only short-listed candidates will be contacted for an interview."
  },
  {
    "id": "89fe086a-7380-41d8-bf95-f5520a3fd3da",
    "company": "City of Airdrie",
    "location": "Airdrie, AB",
    "position": "Director, Community Services",
    "postedDate": "16 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105435",
    "source": "CivicJobs BC",
    "description": "City of Airdrie\nDirector, Community Services\n\n\nAccessHR is excited to partner with the City of Airdrie for the recruitment of a full-time, permanent, Director, Community Services. This opportunity is due to an upcoming retirement and offers transition time with the current Director.\n\nABOUT AIRDRIE\nAirdrie is located just north of Calgary, Alberta with its southern boundary just a few kilometers from Calgary’s northern boundary. It is one of the fastest growing cities in Canada and is projected to continue to grow rapidly due its proximity to Calgary and a large land annexation from nearby Rocky View County in 2012.\n\nAirdrie is a vibrant and caring community rich in urban amenities and opportunities for everyone. With a population approaching 100,000 and an average age under 35 years old, Airdrie is the 5th largest city in Alberta and is predicted to move into the #3 position, after Calgary and Edmonton, within the next few years.\n\nAirdrie is also ideally situated within an easy drive to the Rocky Mountains and the recreational and amenity choices of Calgary as a major urban centre. Residents here also enjoy excellent proximity to the Calgary International Airport.\n\nABOUT THE CITY OF AIRDRIE\nThrough the commitment and caring of our 800 employees, we are dedicated to our mission of Create, Serve, and Care. Our core values of Open Dialogue, Collaborative Relationships, Learning, Ownership, Innovation & Entrepreneurial Spirit, and Encourage the Heart, support the achievement of our Mission.\n\nOur inclusive culture creates a workplace that welcomes aspiring, driven, and creative individuals to help us accomplish our business and community goals. We are supportive of one another, and we have fun while we serve our community. We are also passionate about improving the lives of our residents through care and respect. At the City of Airdrie, we learn, grow, and accomplish great things together.\n\nPOSITION DESCRIPTION\nThe Director, Community Services, reports directly to the City Manager, is a key member of the 5- person Executive Leadership Team (ELT), and is responsible for defining and driving the strategic vision and direction of the City’s community services portfolio, including 1,000,000 square feet of recreation space. As part of the ELT, the Director contributes to shaping organizational culture and ensuring operational excellence.   The Director leads a 2-person management team, a Manager of Recreation Services and a Manager of Culture, Heritage, & Event Services, and is responsible for a broad portfolio including Recreation, Arts and Culture, Community Events, Community Facilities, and Capital Project Delivery.\n\nThis role requires a community-centered approach to service delivery, cultural enrichment, and facility development that responds to Airdrie’s rapid growth. Indeed, Airdrie’s population is predicted to increase from 90,000 to 110,000 by 2028, bringing tremendous challenges and opportunities for this portfolio.\n\nThe Director will collaborate closely with City Council, internal departments, and sports, recreation, and other community-based groups. Success in this role requires extensive municipal experience and financial acumen as well as the ability to lead teams, modernize systems, and deliver innovative, user-focused services through effective use of technology.\n\nClear differentiators for this role are that the successful candidate will join a dynamic, people- focused municipality experiencing significant growth, with a substantial number of new projects, both planned and underway, including the $400 million Southwest Recreation Centre.\n\nKEY DELIVERABLES\n\nLeadership and Development: Foster a culture that supports team growth and organizational success through coaching, mentoring, and performance management.\nStrategic Community Planning: Lead the development and implementation of recreation and cultural services, ensuring alignment with community needs and municipal priorities.\nCoordinated Service Delivery: Oversee the delivery of services across multiple departments and facilities, ensuring alignment, efficiency, and positive customer experiences.\nFinancial Leadership: Provide leadership and oversight for budgeting, funding strategies, and long-term financial sustainability of community services.\nPublic Engagement: Facilitate inclusive, evidence-based engagement strategies to define standards and guide council decision-making.\nRegulatory Compliance and Risk Management: Ensure compliance with all applicable legislation; establish policies that safeguard public funds and minimize organizational risk.\nPublic Speaking and Communication: Prepare and deliver clear, impactful reports, briefing notes, and presentations to Council and Council Committees.\n\n\nQUALIFICATIONS\n\nLeadership: Ability to inspire individuals and teams to a well-defined purpose; able to coach and mentor through the highs and lows of publicly visible portfolios in high-growth municipalities.\nEmotional Intelligence: Genuinely curious; asks open-ended questions, actively listens, celebrates successes, ensures a psychologically safe work environment, and remains composed.\nTrust Building: Gaining public trust, balancing stakeholder interests, and navigating political dynamics are essential; ability to effectively message, resolve conflicts, and negotiate solutions.\nTechnology and Innovation: Keen interest in and knowledge of global trends and emerging technologies in municipal community services management; ability to effectively collaborate with diverse stakeholders to identify and implement new solutions to enhance service delivery.\nFinancial Management: Ability to effectively manage complex, multi-departmental budgets and align financial decisions with strategic priorities and community expectations.\nProject Leadership: Experience overseeing the planning, execution, and delivery of community infrastructure projects while managing risk and stakeholder expectations.\nPersonal Attributes: Approachable and curious; builds trust through empathy and openness; genuinely appreciates and values the role of recreation and culture in building community. \nService Delivery Excellence: Committed to continuous improvement, benchmarking, and evidence-based decision making to enhance services across recreation, arts, culture, and events.\n\n\nEDUCATION & EXPERIENCE\n\nUndergraduate degree in Public Administration, Recreation and Leisure Management, Recreation and Sport Management, or a related field\n10+ years’ experience leading Community Services in a municipality including experience in high growth and similar size or larger cities\nExperience and expertise interacting with municipal councils and boards of directors\n\n\nASSETS\n\nGraduate degree in Public Administration, Recreation and Leisure Management, Recreation and Sport Management, or a related field\nExperience in multiple municipalities\nIAP2 Certificate in Public Participation\nSix Sigma or Lean Training\nCertificate in Strategic Management or Professional Management\nMasters Certificate in Municipal Leadership or similar certification\nPersonal network of municipal leaders at cities with populations of +150K\n\n\nWHAT WE OFFER\n\nMeaningful opportunity to influence and effect change\nWork with a dynamic and forward-thinking City Manager and Executive Leadership Team\nLocal Authority Pension Plan starts immediately\nOptional supplementary pension plan (APEX)\nTruly collaborative, supportive, and fun place to work\nWork with a leadership team who trust and appreciate the value of each other’s perspectives\nRelocation assistance is available\n\n\nPOSITION REQUIREMENTS\n\nThe successful candidate must be willing to relocate to the City of Airdrie or surrounding metropolitan area; relocation assistance is available for those relocating to the City of Airdrie.\n\n\nAPPLY\nInterested candidates are invited to apply with a cover letter and resume HERE. Please note that the position posting will close at 6:00 pm on July 11th, 2025.\n\nAll applicants will receive a personalized response and candidates under consideration will be contacted directly. Please be advised that applications will be monitored daily, and interviews may be scheduled throughout the posting period.\n\nWe encourage applicants from diverse backgrounds to apply as the City of Airdrie is committed to offering a diverse and safe workspace free from discrimination. All applicants are considered regardless of age, gender, race, disability, sexual orientation, gender identity or expression, and religious beliefs.\n \nCity of Airdrie Salary Band for this position is: $89.48/hour to $111.85/hr"
  },
  {
    "id": "65507493-817b-48ec-95c2-0803b4592abc",
    "company": "City of North Vancouver",
    "location": "North Vancouver, BC",
    "position": "Business Analyst",
    "postedDate": "16 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105434",
    "source": "CivicJobs BC",
    "description": "City of North Vancouver\n\nBusiness Analyst\n\n\nTemporary Full-time\n\nThe City of North Vancouver is the urban core of the beautiful North Shore and has a long-term vision to be “The Healthiest Small City in the World”, with five key priorities to be a City for People, a Resilient City, a Vibrant City, a Connected City and a Prosperous City.\n \nThe Financial Services Department – Information Technology Division requires a temporary full-time Business Analyst for approximately two (2) years.\n \nReporting to the Manager, Enterprise Platforms, you will perform complex analytical work conducted in response to a wide range of user requirements, which encompasses all phases of business applications configuration, procedure documentation and operation related to the Division’s business applications systems. You will play an integral role on a core system replacement transformation involving business permitting and licensing. You will manage, liaise, gather and document business application, systems and user requirements, provide advice and recommendations, collaborate with internal and external design teams and develop technical solutions to meet business requirements. You will define backlog stories, document solutions, update technical manuals, provide training documentation and support the business units.\n \nYou will possess a Degree or Diploma in Computer Science or Business Administration in computer-related disciplines and a combination of formal Agile Development or Scrum Master Certification, and two or more years of related experience with technical writing supporting requirement gathering documentation, or an equivalent combination of training and experience. Your technical experience will include system requirement gathering, system/business workflow design methodology, system procurement, agile methodology, and project management fundamentals. In addition, your excellent organizational skills, ability to prioritize workloads and meet deadlines, and proven interpersonal skills in establishing and maintaining effective working relationships (particularly facilitating multidisciplinary teams and 3rd party vendors) will ensure success in this position.\n \nShortlisted candidates may be required to complete standardized tests or exercises to demonstrate their applicable skills and knowledge.\n \nFor temporary full-time positions of 8 months or longer, a City employee who is successful on the posting will have the right to revert to their former position.\n \nSalary:\n$46.07 – $54.44 hour\n(Pay Grade 26 – January 2024 rates)\n \nHours of Work:\nAny 7 consecutive hours between 7:00 a.m. and 11:00 p.m., Monday to Friday, and may also be scheduled for a regular shift on Saturday between 8:30 a.m. and 5:00 p.m., exclusive of meal breaks. The City of North Vancouver currently works on a compressed work schedule with one scheduled day off (Monday or Friday) approximately each three-week scheduling cycle.\n \nIf you’re passionate about making the City of North Vancouver an even greater place to live, work and play, apply online through the Career Portal at www.cnv.org by Friday, July 4, 2025.\n \nThank you for your interest in the City of North Vancouver.\n \nWe respectfully acknowledge that we live and work on the traditional and unceded territories of the Sḵwx̱ wú7mesh (Squamish) and Səl̓ ílwətaɬ (Tsleil-Waututh) Nations. The City of North Vancouver is committed to Reconciliation with these Nations, who have lived on these lands since time immemorial.\n \nPosting:  2025-0076"
  },
  {
    "id": "b4a24d10-5b37-405d-a9b3-b28ba97f41df",
    "company": "Victoria Airport Authority",
    "location": "Sidney, BC",
    "position": "Financial Assistant",
    "postedDate": "17 hrs ago",
    "url": "https://www.civicjobs.ca/jobs?id=105433",
    "source": "CivicJobs BC",
    "description": "Victoria Airport Authority\nFinancial Assistant\n \n\nCompetition No. #2025-13\nStarting Hourly Rate: $35.22\n(after completion of 6-month probation: $37.08)\nClassification Band 3\n \nVictoria International Airport (YYJ) is the 11th busiest airport in Canada and is located on the homelands of the W̱SÁNEĆ People whose historical relationship to the land continues to this day. YYJ has been rated one of the top ten most-loved airports in the world by CNN Travel and has been named one of BC’s Top Employers annually since 2020. Winner of the best regional airport in North America award by Airports Council International in 2012, 2014, 2020 and 2024, YYJ provides a safe, secure, sustainable, and efficient airport that creates prosperity for our region by connecting Greater Victoria with the world. Victoria Airport Authority has managed the operations at YYJ on behalf of the surrounding communities since April 1, 1997.\n \nCareer Opportunity:\nThe Victoria Airport Authority is looking for a Finance Assistant who thrives in a dynamic, purpose-driven environment to join our award-winning team. If you’re detail-oriented, passionate about financial integrity, and want to contribute to something bigger — this is your chance.\n\nAs Finance Assistant, you’ll play a pivotal role in ensuring the financial gears of our organization run smoothly. Reporting to the Manager, Finance and Accounting, you will support accounts payable and receivable with precision, professionalism, and care. You will bring your strong attention to detail, excellent organizational skill, and the ability to communicate effectively with both internal and external stakeholders. The Finance Assistant is a union position and will normally work a 37.5-hour work week during regular administration office hours.\n \nRequirements:\nEducation & Experience\n\nCompletion of a minimum 2-year diploma program from a recognized post-secondary institution in Business Administration, Accounting, Finance or a related field\nAt least 2 years’ recent and relevant work experience in a similar role (or an equivalent combination of education and experience)\n\n\nKnowledge and Skills:\n\nProficiency in accounting software (Sage 300 preferred) and Office 365 products including Excel, Word, Teams and SharePoint\nStrong attention to detail and accuracy in data entry\nExcellent organizational and time management skills\nEffective communication skills, both verbal and written for internal and external stakeholders\nAbility to work independently and collaboratively in a fast-paced environment\nAdaptability to changing priorities and openness to learning new tasks or technology\nAbility to carry out established accounting procedures, perform account analysis and reconciliations, and process a variety of journal entries and accounts receivable/payable transactions.\nAbility to analyze and prepare reports for internal and external stakeholders\nKnowledge of accounts receivable/payable functions, processes and related policies including applicable taxation, credit and regulatory policies\n\n\nAdditional Requirements (conditions of employment):\n\nWithin six (6) months of hire, the Finance Assistant must obtain and maintain the appropriate level of Airport Security Clearance (RAIC)\nA valid Class 5 British Columbia driver’s license.\n\n\nVAA is part of the federally regulated air transportation sector and employees must abide by any potential future federally mandated health measures (e.g. COVID-19 vaccination/booster shots).\n\nPlease refer to the job description on VAA’s website for a full list of duties and responsibilities.\n \nVAA Values\nVAA has an incredibly bright future ahead and its success depends entirely on our team of very talented, dedicated staff. We want to ensure VAA is an environment where our people thrive and is an organization where people are proud to work, where our culture is admired and where career aspirations are fulfilled. At VAA we’re proud to be living our Values:\nPeople We work as a team, supporting and respecting one another to bring out the best in each of us.\nExcellence We lead in safety, quality, and innovation to create exceptional experiences.\nIntegrity We ensure that honesty, equity, and accountability are the cornerstones of everything we do.\nCommunity We foster meaningful relationships through service excellence and responsible stewardship.\n\nApplications:\nIf you’re excited about contributing your financial expertise to a forward-thinking, community-minded organization, we’d love to hear from you. Interested applicants may submit their Cover Letter and Resume quoting Competition #2025-13 by 4:00 pm, Friday, June 27th, 2025 to Agilus Work Solutions rarsenault@agilus.ca.\n \nVAA is located on the homelands of the W̱SÁNEĆ People and as a result, qualified self-identified Indigenous applicants are encouraged to apply and may be given preference during the recruiting and selection process.\nVAA values inclusion and accessibility and is committed to providing reasonable accommodations for applicants and employees with disabilities. If reasonable accommodation is needed to take part in the job application or interview process, please contact humanresources@yyj.ca .\n\nPlease ensure your application clearly identifies how you meet the education, experience, and knowledge requirements stated in the job description. Eligibility to work in Canada and the ability to maintain airport security clearance (RAIC) are essential.\n\nWe sincerely appreciate the interest of all applicants; however, only those selected for further consideration will be contacted."
  },
  {
    "id": "97f9d526-96b0-4987-aad5-edaddbee35ab",
    "company": "City of Surrey",
    "location": "Surrey, BC",
    "position": "Clerk 4",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105432",
    "source": "CivicJobs BC",
    "description": "City of Surrey\nClerk 4\n\n\nAs one of the fastest growing cities in Canada, City of Surrey is a globally recognized leader in building vibrant, sustainable communities through technology and innovation.\nCity of Surrey employees are talented innovators, inspired by meaningful work and the opportunity to drive our city—and their careers—forward. Build a City. Build a Future at the City of Surrey\n\nSCOPE \nThe City of Surrey’s Parks, Recreation & Culture – Administration Team is committed to providing ongoing support to the General Manager and Divisions Managers and others within the PRC Department.. As part of that commitment, we are currently looking for a Clerk 4 to join our dynamic team.\n \nThis position reports to the Manager, Support Services and works closely with the Administrative Team to support the Parks Division and Director of Parks. This position performs moderately complex and diversified clerical work in various capacities. This position requires strong organizational, communication, and multitasking skills to ensure the effective operation of the Parks Division’s administrative functions.\n \nEmployees work under limited supervision and exercise considerable independent judgement and initiative.\n\nEMPLOYMENT STATUS\nUnion - CUPE Local 402 – Term (20 months)\n\nRESPONSIBILITIES \n\nProvides clerical and administrative support services to Parks, Recreation & Culture Staff.\nPlans and coordinates work to support the Parks Division in a variety of functions.\nPrepares varied documents, collects, and analyzes a variety of data, and complex statistical reports.\nManaging the Parks Director’s calendar, scheduling meetings, and handling correspondence as requested.\nAssisting Division and Section Managers with the initial drafting and formatting of reports, presentations, briefing notes, and committee materials.\nHandling payroll and P-Card administration for the Parks Division; processing invoices and financial system entries (FMS).\nOrganizing logistics and taking minutes for a variety of meetings.\nManaging records and retention systems; responding to Freedom of Information (FOI) requests and public inquiries.\nCompleting and processing forms and reports for payroll, purchase card reconciliation and others as required.\nProviding administrative assistance to Committees.\nSupporting Department-wide initiatives and events like staff appreciation.\nContributing to various administrative projects and performs other related duties as required. \n\n\nQUALIFICATIONS \nThe ideal candidate is highly organized and has the ability to anticipate the needs of others. They are a self-starter who can work independently, or with a team. They are also an effective communicator and uses good judgement when solving problems. A qualified applicant will have:\n\nCompleted Grade 12, supplemented by completion of several business courses at a post-secondary level.\nA minimum of 3 years of progressively responsible and diversified clerical experience including supervisory experience.\nAn accurate typing speed of 40 wpm.\nAn equivalent combination of education and experience will be considered.\n\n \nApplicants under consideration will be required to consent to a Police Information Check with a Vulnerable Sector Check.\n\nOTHER INFORMATION \nSteps Hourly Rate\nStep 1   $31.97  \nStep 2 (6 Months)   $32.90  \nStep 3 (18 Months)   $33.50  \nStep 4 (30 Months)   $34.75  \n \nAPPLY \nIf you are interested in this opportunity, please apply at www.surrey.ca/about-surrey/jobs-careers to Job ID 6565\n\nwww.surrey.ca/careers"
  },
  {
    "id": "6653a10b-c35e-461e-80d2-10d66b8b28ad",
    "company": "Central Coast Indigenous Resource Alliance",
    "location": "Campbell River, BC",
    "position": "Marine Planning & Stewardship Program Manager",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105431",
    "source": "CivicJobs BC",
    "description": "Marine Planning & Stewardship Program Manager\n\n\nReports to: Executive Director\nCollaborates with: Stewardship Directors, Director of Finance & Operations, marine program team members, Nation staff, CCIRA contractors and staff, and partners\nDirect Reports: Coordinates marine program staff and contractors; provides day-to-day supervision in alignment with Nation direction and CCIRA policies.\nFinancial Scope: Day-to-day program budget oversight within approved workplans and direction from the ED/Stewardship Directors\n\nCentral Coast Indigenous Resource Alliance\nThe Central Coast Indigenous Resource Alliance (CCIRA) was established by the Central Coast Nations - Heiltsuk, Kitasoo Xai’xais, Nuxalk, and Wuikinuxv - to provide coordination and technical support in fisheries management, marine spatial planning, and science. CCIRA’s work is grounded in the stewardship values and governance objectives of the Central Coast Nations and is rooted in the Central Coast Integrated Marine Plan.\n \nA central pillar of CCIRA’s work has been its involvement in marine planning. The organization began with community-based marine use planning and has since played a key role in the development of the Marine Plan Partnership (MaPP) for the North Pacific Coast, working alongside other First Nations and provincial governments to build on their comprehensive marine plans. This work is central to CCIRA’s mission of advancing Indigenous governance and stewardship of marine and coastal environments.\n\nROLE CONTEXT & GOVERNANCE OVERSIGHT\nThis position responds to a clear need identified by the CCIRA Board and Central Coast Nations to increase internal coordination capacity for marine planning and stewardship. It exists to support the implementation of Nation-led marine governance priorities, operating under the strategic direction of the Stewardship Directors and reporting to the Executive Director.\n \nThe Program Manager enables integrated program delivery, supports staff and contractors, and helps ensure marine planning work reflects Nation direction. The role also contributes to rebalancing responsibilities across the team following recent staff transitions, helping ensure that all roles are aligned with CCIRA’s evolving structure and strategic mandate. Success in this position will be measured by the ability to foster coordination, build trust, and reinforce existing Nation leadership.\n\nPOSITION OVERVIEW\nThe Marine Planning & Stewardship Program Manager is a coordination-focused leadership role within CCIRA, held by an individual with deep subject matter expertise in marine planning, Indigenous governance, and multi-jurisdictional marine management. The position was created to address the increasing complexity and capacity demands across marine planning, stewardship, and governance initiatives on the Central Coast.\n \nAs part of CCIRA’s organizational evolution, marine planning responsibilities have shifted across the team to reflect changing capacity and strategic priorities. The Program Manager provides a dedicated leadership function to coordinate key marine planning initiatives, rebalance team workloads, and realign responsibilities across CCIRA’s evolving structure.\n\nThis role leads CCIRA’s coordination of Nation-led marine initiatives including: marine use plan updates, the Marine Plan Partnership (MaPP), the Marine Protected Area Network (MPAN), Coastal Marine Strategy (CMS), the Hecate Strait MPA, and components of the Project Finance for Permanence (PFP). It also supports the implementation of other Nation-led marine priorities and helps ensure integration with stewardship, monitoring, and policy and governance functions.\n \nWorking across CCIRA’s programs, the Program Manager helps realign responsibilities previously held on an interim basis, enabling staff and contractors to focus on their core mandates. You will work to strengthen collaboration, reduce duplication, and support effective leadership across teams through strong coordination with other managers and leads. As CCIRA transitions to an employee-based structure, this role plays an important part in supporting the well-being, cohesion, and professional growth of marine program staff, while escalating formal HR decisions to the Executive Director (ED) and Director of Finance & Operations (DoFO). The Manager also provides day-to-day coordination and culturally grounded, supportive leadership, helping staff navigate organizational change in a good way.\n \nThe role prioritizes relational leadership, Nation-aligned delivery, and integrated support across the marine program. The Program Manager also contributes to the strategic development of marine planning content and ensures technical deliverables are grounded in both Indigenous knowledge traditions and scientific approaches. Flexibility and adaptability will be essential as CCIRA’s internal structures, staffing, and Nation priorities continue to evolve.\n\nKEY FUNCTIONS & RESPONSIBILITIES\nThe Marine Planning & Stewardship Program Manager position is responsible for the following four (4) key functions.\n \nCoordination of Nation-led Marine Planning & Stewardship (40%)\n\nProvide dedicated coordination and delivery support for Nation-led marine planning initiatives, including marine use plan updates (MaPP), MPAN, Hecate Strait MPA, and elements of the PFP\nEnsure delivery timelines, workplans, and intergovernmental engagement are aligned with Nation direction and Board-approved strategies\nSupport cross-program coordination to ensure marine planning is integrated with science, monitoring, and policy and governance efforts\nLead or contribute to the development of technical products (e.g., spatial plans, planning documents, policy briefings) that reflect both Indigenous and scientific knowledge systems.\nCollaborate with program team members to provide support as needed on integration, communications, and external coordination\nProvide logistical and technical coordination support for marine planning deliverables, reporting, and contracts\nTrack regional and federal policy developments relevant to marine planning\nFacilitate integration of Indigenous Knowledge and Western science into marine initiatives\nSupport   alignment   with    Nation-led   marine   governance  frameworks   and   engagement  in intergovernmental policy processes\nContribute to the development of spatial plans, technical products, and policy deliverables that integrate Indigenous and scientific knowledge systems\n\n \nProgram Rebalancing & Team Integration (20%)\n\nSupport the clarification and redistribution of team responsibilities across the marine program to reflect current capacity, areas of expertise, and strategic priorities\nCoordinate with the ED and Stewardship Directors to confirm updated roles, responsibilities, and deliverables across the marine program team\nEnable marine team members to focus on their core functions by clarifying scopes and relieving interim responsibilities\n\n \nRelationship Management & Facilitation (20%)\n\nBuild trusted, collaborative relationships with Nations, government agencies, NGOs, and marine partners\nLiaise with the ED, Stewardship Directors, and marine team members to ensure strategic alignment\nRepresent CCIRA at technical, planning, and funding tables when delegated, ensuring Nation priorities remain centered\nSupport the development of clear and respectful communications materials to share progress and outcomes with Nations, partners, and funders\n\n \nProject & Program Oversight (20%)\n\nOversee integrated work plans, program deliverables, and supports contribution agreement tracking and preparation of reporting materials for marine-related projects, in collaboration with program staff, the DoFO and ED\nLead day-to-day coordination of marine program contractors and staff; manage onboarding, scheduling, and task prioritization\nWork closely with the Director of Finance & Operations to ensure compliance, budget integration, and reporting\nProvide ongoing, supportive supervision to marine program staff, including regular check-ins, professional development support, and culturally grounded coaching in collaboration with the ED and DoFO\nSupport team development by identifying growth opportunities, offering mentorship, and enabling collaborative learning across CCIRA’s marine program\nFoster collaborative and culturally grounded practices that strengthen internal systems and enhance delivery of marine initiatives\n\n\nSCOPE OF AUTHORITY & DECISION-MAKING\n\nLeads day-to-day marine planning coordination and team supervision\nAssesses and recommends realignment of marine work based on contractor capacity and programmatic needs\nSupports external engagement and funding relationships as delegated\nDoes not assume governance, Nation decision-making, or strategic authority\nEscalates complex decisions to the Executive Director and/or Stewardship Directors\n\n\nEDUCATION/EXPERIENCE\nRequired\n\nPost-secondary degree in marine planning, Indigenous governance, conservation, or a related field.\nDemonstrated experience coordinating complex marine or Indigenous stewardship programs (5–7+ years).\nDemonstrated experience leading marine planning, including spatial planning, governance-based planning, or marine use plan development.\nDemonstrated experience providing team leadership and day-to-day coordination, including mentorship, cohesion-building, and support in organizational transition contexts.\nDemonstrated experience working directly with Indigenous Nations, including knowledge of Indigenous governance, stewardship priorities, and relational approaches.\nDemonstrated experience integrating Indigenous Knowledge systems into marine planning, policy, or research processes.\nDemonstrated experience with budgeting, work planning, and contractor or staff supervision.\nExcellent facilitation, communication, and coordination skills.\nStrong commitment to CCIRA’s mission, values, and Indigenous-led stewardship.\nSuccessful criminal record check.\nProficiency with Microsoft 365 applications.\n\n \nPreferred\n\nDemonstrated experience contributing to or negotiating co-governance or shared decision-making processes.\nFamiliarity with provincial and federal marine policy frameworks (e.g., Oceans Act, NMCA Act, Fisheries Act).\nUnderstanding of Indigenous data sovereignty and respectful knowledge-sharing practices.\nFamiliarity with funding compliance and contribution agreement tracking.\n\n \nAn equivalent combination of education and experience will be considered.\n\nCORE COMPETENCIES\nThe following five core competencies are grounded in Indigenous leadership values and informed by adapted elements of the Korn Ferry framework and are used during hiring and performance evaluation. Each competency assesses both technical capacity and relational, cultural, and adaptive leadership.\n\nRelational Leadership: Builds trust-based relationships across Nations, staff, and partners. Leads with empathy, humility, and collaboration rather than control. Creates space for others to lead and contribute.\nCultural Fluency: Understands and operates within Indigenous governance systems, protocols, and knowledge traditions. Embeds Indigenous laws, worldviews, and Nation priorities in implementation and decision-making.\nStrategic & Adaptive Thinking: Navigates complexity with awareness, responsiveness, and clarity. Adapts to change while maintaining alignment with Nation direction, shared strategy, and evolving realities.\nIntegrated Program Delivery: Coordinates across teams and files to ensure cohesive and timely delivery of work. Breaks down silos, aligns internal and external efforts, and supports others to lead within shared mandates.\nSupportive People Leadership: Demonstrates emotional intelligence, cultural sensitivity, and effective interpersonal communication. Supports a healthy team dynamic, builds team resilience through mentorship, and navigates challenges and informal conflict resolution with care.\n\n\nKNOWLEDGE, SKILLS & ABILITIES (KSAs)\nThe successful candidate will demonstrate the following abilities, aligned with CCIRA’s core competencies and cultural values:\n\nDemonstrated ability to lead cross-functional teams, including supportive supervision, mentorship, and collaborative performance development in a values-based environment.\nDemonstrated expertise in marine spatial planning, policy, or governance, with a proven track record of delivering technical outputs aligned with Indigenous Nation priorities in multi-jurisdictional settings.\nDemonstrated ability to align program planning and delivery with Indigenous Nation priorities and organizational strategy, while adapting to evolving structures and systems.\nDemonstrated skill in facilitation and intercultural communication, including respectful community engagement and relationship-centered leadership within Indigenous contexts.\nDemonstrated ability to reflect Indigenous governance principles and scientific methodologies in marine planning.\nDemonstrated experience developing and managing program budgets, tracking expenditures, and preparation of contribution agreement reporting for multi-partner projects.\nDemonstrated experience with inclusive and equity-informed HR practices, including culturally grounded recruitment, onboarding, and collaboration with senior leadership to support team well-being and belonging.\n\n\nWORKING CONDITIONS & PHYSICAL DEMANDS\nCCIRA operates in a distributed work environment, with team members based across the Lower Mainland, Central and South Coasts, and Vancouver Island. Candidates must be based in British Columbia and able to work remotely with reliable access to a home office and internet. Regular computer use and periods of sedentary work are expected.\n\nThis position requires regional travel within the Central Coast and to Vancouver, including occasional field visits. Flexibility in working hours may be needed to accommodate Nation meetings and project timelines. Equipment support may be available in accordance with CCIRA’s HR policies. Approved travel expenses will be reimbursed.\n\nCandidate Evaluation Criteria\nCandidates will be assessed based on the following:\n\nRequired and Preferred Experience, as outlined in the position qualifications.\nCore Competencies, including relational leadership, cultural fluency, strategic thinking, integrated program delivery, and supportive people leadership.\nKnowledge, Skills, and Abilities (KSAs), with emphasis on demonstrated ability to contribute within Indigenous-led, cross-functional marine program contexts.\n\n \nThese criteria guide the hiring process and support a transparent, strengths-based selection approach.\n\nRemuneration\nThis is a full-time employee position with a salary range of $105,000 to $112,000, depending on experience in relation to the responsibilities of the role. CCIRA is committed to fair and transparent compensation. The position includes flexible work arrangements and reimbursement of approved travel costs. A benefits package is currently under development, and the successful candidate will be eligible once it is implemented.\n\nHow to Apply\nTo apply, please send the following materials to cyndi.hanuse@ccira.ca with the subject line: Application - Marine Planning & Stewardship Program Manager\n\nA cover letter outlining your interest in the role and how your experience aligns with CCIRA’s mission and values\nA current CV or résumé (PDF format preferred)\n\n \nApplication Deadline: July 7, 2025\nStart Date: As soon as possible, ideally by early fall\n \nCCIRA is committed to equitable hiring practices and to fostering a culturally safe, inclusive, and respectful work environment grounded in Indigenous values and governance. We welcome applications from all qualified candidates and may prioritize Indigenous applicants.\n \nIf you require accommodations at any stage of the hiring process, please contact cyndi.hanuse@ccira.ca in confidence. We are committed to working with applicants to ensure an accessible and respectful process.\n \nWe thank all applicants for their interest. Only those selected for an interview will be contacted."
  },
  {
    "id": "3ffb6260-691b-460d-b691-9a46fd7156f4",
    "company": "District of Saanich",
    "location": "Saanich, BC",
    "position": "Building Service Worker II - Pool",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105430",
    "source": "CivicJobs BC",
    "description": "DISTRICT OF SAANICH\nPARKS, RECREATION AND COMMUNITY SERVICES\nSAANICH COMMONWEALTH PLACE\nMAINTENANCE\n \n\nBuilding Service Worker II - Pool\n\nOne Permanent Part Time Position\n \nThe District of Saanich's Parks, Recreation and Community Services department is seeking a team player to help drive our mission of Healthy Nature, Healthy People, and Healthy Community, while supporting our vision: a Saanich where everyone belongs.\n \nYou’ll work within a team where service excellence, learning and knowledge sharing, and feedback and accountability are highly valued, and where communication, trust, respect, and positivity form the foundation for everything we do.\n \nSaanich Commonwealth Place has an exciting career opportunity as a Building Service Worker II to perform maintenance work in the general operation and service maintenance of swimming pools and other associated buildings and equipment in our world-class aquatic facility and community recreation centre. The Building Service Worker II – Pool performs various maintenance functions involving building maintenance and repairs, swimming pool heating and filtering equipment, custodial and cleaning tasks.\n \nRequirements include Grade 11 or equivalent; Pool Operators I and II Qualification; over three months and up to six months related experience; and WHMIS certification valid within 1 year. Possession of Occupational First Aid Level I is an asset. Employment is subject to provision of a satisfactory Police Information Check with Vulnerable Sector (PIC-VS) check no older than 6 months.  An equivalent combination of education and experience may be considered.\n \nThis is shift work including days, evenings, nights, weekends, weekdays, and holidays (minimum 14 hours per week, with a maximum of 37.5 hours per week).\n \nThis is a C.U.P.E. Local 2011 position with a wage of $34.41per hour with an excellent benefits package. Please apply by Friday, June 20, 2025, quoting competition 25156. As a component of the selection process, testing will be conducted. We thank all applicants for applying.  Only those under consideration will be contacted.\n \nThe District of Saanich is recognized as one of BC’s Top Employers for 2025. As an equitable and inclusive employer, we value diversity of people to best represent the community we serve and provide excellent services to our citizens. We strive to attract and retain passionate and talented individuals of all backgrounds, demographics, and life experiences. If you require any adjustments to enable participation at any stage of the recruitment process, please contact accessibilityHR@saanich.ca in confidence."
  },
  {
    "id": "185ae57d-064d-47d1-bcea-1457471bf3de",
    "company": "City of Campbell River",
    "location": "Campbell River, BC",
    "position": "Forensic Video Technician",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105429",
    "source": "CivicJobs BC",
    "description": "Forensic Video Technician\n\n\nNaturally, Campbell River – Located on Vancouver Island, the City of Campbell River offers a rare combination of a welcoming small-town feel with large-city amenities. We are a 45-minute drive from the winter and summer activities of Mount Washington, and just minutes from more than 100 km of all levels of mountain biking and hiking trails, plus easy access to the ocean, rivers and lakes for sports fishing, kayaking, paddle boarding and whale watching.\n \nThe role: Taking direction from the Police Services Supervisor and reporting to the Police Services Supervisor and RCMP Municipal Manager, the Forensic Video Technician will perform specialized technical work utilizing forensic video techniques in support of the Police Services department and the Asset Management department clients. The incumbent will review videos with a technical lens and process a variety of video evidence for investigative and court purposes. The incumbent will also provide administrative support, such as answering inquiries, word processing, and preparing and maintaining various documents and files, to the staff in the Forensic Identification Section.\n \nWhat we offer: The rate of pay for this Permanent Full-Time CUPE bargaining unit position is $36.57 per hour, based on a 35-hour work week.\n\nOur ideal candidate will have:\n\nGrade 12 or equivalent.\nCompletion of two (2) year accredited technical diploma program in video technology, broadcast television or another discipline relevant to the field of forensic video technology.\nMust possess and maintain a valid Class 5 driver’s licence, and produce and maintain a clean driver’s abstract, as per City policy.\nMinimum three (3) years related experience in video technology role, preferably in law enforcement environment, within the last five (5) years.\nMust achieve and maintain RCMP Reliability Security Screening.\n\n\nPreferred Criteria:\n\nCompletion of certification program for Forensic Video Technicians.\n\n \nPosting close date: Will remain open until filled\n \nPlease apply using the ‘Apply Now’ link below. Resumes are no longer accepted through the careers email.\n\nWhen you apply:\nYou will be asked to upload a cover letter and resume as part of the application process. You may also be asked to answer some screening questions related to the position.\n \nQuestions about this position? Email careers@campbellriver.ca\n   \nApply Now"
  },
  {
    "id": "28b1cb72-2393-4eab-8d69-7dce9b1d4379",
    "company": "Westbank First Nation",
    "location": "Kelowna, BC",
    "position": "Community Garden Coordinator",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105428",
    "source": "CivicJobs BC",
    "description": "WFN fosters a workplace environment that is diverse, inclusive, collaborative, healthy, and reflective of Syilx values and culture.\nCommunity Garden Coordinator\n\n(Term) – Casual\n\nWho We Are\nLocated within the traditional unceded territory of the syilx people, Westbank First Nation (WFN) is a progressive and prosperous self-governing First Nation. WFN is dedicated to promoting a healthy and prosperous future to ensure its continued existence as a strong political, social and cultural community.\n\nWestbank First Nation values Equality, Honesty and Fairness, Respect, Integrity, Accountability and Transparency, Sustainability, Understanding, Confidentiality and Efficiency.\n\nAbout this Opportunity\nReporting directly to the Health Manager, the Community Garden Coordinator is responsible for the operation and maintenance of the WFN community garden. The Community Garden Coordinator oversees planning, coordinating and implementing work activities, growing and harvesting vegetables and herbs, and working with volunteers and programs (Sensisyusten School, Family Program, Youth & Recreation, etc.).\n\nWant to know more? You will…\n\nEnsure regular maintenance at the community garden sites including weeding, irrigation, and general garden appearance\nEnsure garden plots and community spaces are ready for use by preparing soil, organizing tools, setting up planting areas, and maintaining a clean and functional gardening environment\nPlant seasonal plants, vegetables and herbs according to schedule and ensure the garden is properly watered throughout the season\nOrder supplies, materials and tools as needed to support the program\nCommunicate with the Manager on any concerns in the management of the community garden\nCoordinate volunteers and community programs to help tend and harvest the community garden throughout the season, including summer and fall programs\nFacilitate education workshops and information materials that will engage families and programs on food sovereignty\nSupport the community fridge and pantry programs, where possible \n\n\nMust Haves:\n\nCompletion of a certificate or diploma program in horticulture, agriculture, or a similar area of study preferred\nWorking Knowledge of basic gardening methods, plant maintenance, and principles of sustainable gardening\nWorking knowledge of operating garden equipment and tools\nWorking knowledge of Microsoft Office Suite and strong general computer literacy\nMust be able to lift up to 50 pounds\nCriminal Record Check with Vulnerable Sector Search with results acceptable to WFN\n\n\nPerks of Working at WFN:\n\nCompetitive compensation package including 3 weeks’ vacation\nExtended Health Care (including Vision and Paramedical Services), Dental, Basic Life Insurance, Employee Assistance Program, and Health Spending Account\nMunicipal Pension Plan membership\nAccess to Big White Season Passes (Summer & Winter)\nEmployee Recognition Program\nAccess to LinkedIn Learning for Professional Development\n\n\nThe median salary for this position is $54,336\n\nThis is a term position set to end on October 1, 2025\n\nApplication Details:\nTo review the full job description and to learn more about Westbank First Nation please visit our website at https://www.wfn.ca.\n \nAll applications must be submitted through our Employment Opportunities page. Ensure you attach your cover letter and resume. Incomplete or late submissions will not be accepted.\n \nThis opportunity will close at midnight on Sunday, June 29, 2025."
  },
  {
    "id": "8c9f6e6e-4ece-446e-9f91-878e34abdef5",
    "company": "District of West Vancouver",
    "location": "West Vancouver, BC",
    "position": "Firefighter 2025",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105427",
    "source": "CivicJobs BC",
    "description": "Firefighter 2025\n\nInterested in becoming a Firefighter?\n\nThe City of North Vancouver and the Districts of North and West Vancouver are jointly recruiting for professional Firefighters.  Are you community-minded, positive, energetic, active and looking for a fulfilling career?\n\nMinimum Requirements/Qualifications:\nSuccessful completion of an approved Firefighter Training program resulting in a minimum of Firefighter Level 2 Certificate (NFPA1001).\nHigh School graduation.\nSuccessful completion of at least one year of post secondary education (e.g. academic/technical/trades) OR\nAt least one year accumulated work experience after high school (equivalent to full time hours), preferably in work related to the needs of the Fire Service. (e.g. building construction, mechanical, driving trucks and/or large or emergency vehicles, fire service, first aid, nursing, paramedic, instructor/educator, full-time competitive athlete etc.).\nPhysically fit for the position of Firefighter and medically fit according to the standards set in NFPA 1582.  It is the candidate’s responsibility to review and understand these standards.\nValid BC Class 3 Driver’s License or higher (Class 1 for example) with air brake endorsement for vehicles with more than two axles (Automatic transmission is accepted).  Similar licenses from other Canadian Provinces or territory are acceptable on initial application only but you must obtain the equivalent BC License by the date of an official job offer. Contact ICBC for more information at 1-800-950-1498.\nSafe and responsible driving behaviour as demonstrated on a current driver’s abstract. More than 6 points in the last 3 years from the date of application are considered excessive and may eliminate an applicant from further consideration.  Other aspects of your driving record will also be considered.\nCurrent First Responder certification\nComputer literacy (i.e. proficiency in Microsoft Office and/or common software applications).\nCanadian Citizen or Permanent Resident of Canada.\nNo criminal convictions related to the job of Firefighter.  Please refer to the Ministry of Public Safety & Solicitor General website for more information about the Criminal Records Review Act.\nPassing a Physical Fitness Test.\n \nPreferred Requirements/Qualifications:\nProgress towards or completion of a post-secondary education program (e.g. academic, technical or trades training). \nHigher level first aid or Emergency Medical Responder (EMR).\nAdditional Fire Service related courses.\nAbility to swim and related life-saving certificates.\nDemonstration of service to the community through volunteer experience, other than serving as a volunteer Firefighter.\n \nSalary:\nThe current starting salary for all three departments is as follows: \nCity of North Vancouver and District of West Vancouver and District of North Vancouver: First 6 months: $6849 per month (January 1, 2024 rates) \nThese rates are subject to change.  A comprehensive benefits package is offered.\n\nReview application instructions and apply on-line at northshorefirerecruiting.ca by 5:00 p.m. on Monday, July 28, 2025.\n \nThank you for your interest in the City of North Vancouver and the Districts of North and West Vancouver.\nPosting: 2025-F001\n\nIf you have any questions please contact us at careers@westvancouver.ca"
  },
  {
    "id": "40ff15e1-4d93-4e02-9774-8b222c47e32e",
    "company": "City of Vancouver",
    "location": "Vancouver, BC",
    "position": "Product Manager",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105426",
    "source": "CivicJobs BC",
    "description": "Product Manager\nRequisition ID: 43683 \n\nOrganization\nLocated on the traditional, ancestral and unceded lands of the xʷməθkʷəy̓əm (Musqueam), Sḵwx̱wú7mesh (Squamish), and səlilwətaɬ (Tsleil-Waututh) Peoples, Vancouver has a commitment to becoming a City of Reconciliation. Vancouver consistently ranks as one of the world’s most liveable and environmentally sustainable cities. Named among Canada's Top 100 Employers, BC's Top Employers, and Canada's Greenest Employers, the City of Vancouver seeks colleagues who can help shape and embody our core commitments to sustainability, reconciliation, equity and outstanding quality of life for all residents.\n\nConsider joining our committed team of staff and being part of an innovative, inclusive and rewarding workplace.\n\nMain Purpose And Function\nThe Product Manager plays a critical role in the modernization and delivery of municipal products and services that prioritize customer satisfaction, operational efficiency, and digital innovation.  The role is responsible for developing the strategy and roadmap; including leading end-to-end development, delivery and optimizations of products, services and capabilities that align with the City’s strategic objectives while addressing the evolving needs of the customer, employees, and the business.\n\nThe role operates in a fast-paced and multifaceted environment, ensuring the design and delivery of services and products that prioritize customer experience and align with organization’s strategy and goals. By applying service design and reusable products principles, the Product Manager fosters cross-functional collaboration and supports data driven decision-making. The position ensures the city’s services are impactful, accessible, and adaptable to evolving needs of the community. The Product Manager aligns strategic goals with customer needs and advocates for the advancement of modern, integrated digital products and capabilities within the digital ecosystem for the city.\n\nIn addition, the Product Manager contributes valuable insights to both departmental and enterprise-level planning, guiding changes to methods, procedures, and operations, impacting areas such as staffing, financial performance and overall efficiency.\n\nSpecific Duties And Responsibilities\nEnd-to-End Delivery:\nTakes ownership of the ongoing development and success of a product throughout its lifecycle. This includes defining the product vision, strategy, and roadmap.\nLeads the product development continuous lifecycle from ideation and discovery through implementation of product with minimum viable features, subsequent iterations to retirement.\nFacilitates Agile methodologies, including sprint planning, backlog prioritization, and retrospectives to ensure efficient product delivery.\nPrioritizes product features and enhancements based on business needs, user feedback and technical feasibility.\nDefines clear product requirements, user stories and acceptance criteria.\nCoordinates closely with cross-functional teams, including user research and user testing, development, data, UX/UI design, and quality assurance to ensure seamless integration and execution of product plans. \nIdentifies and mitigates risks and blockers to maintain committed timelines and ensure high quality outcomes.\nEnsures effective and efficient implementation of digital services and products that deliver value to the users and align with business objectives.\n\nService Design Leadership:\nIntegrates service design practices into the product development to enhance end-to-end experiences.\nCollaborates with design teams to map customer journeys, identify pain points and develop digital products that improve overall service delivery. \nEnsures the digital services align with accessibility, inclusivity and sustainability standards.\nUtilizes research and insights to inform service design strategies ensuring alignment with municipal objectives and the needs of the customer, employees and the organization.\nCollaborates with Technology Services teams to create and maintain digital products and services that support business services and improve service delivery.\nSupport the development of a cohesive service design strategy that integrates seamlessly with the City’s broader digital transformation goals.\n\n Stakeholder & User Engagement:\nServes as the primary contact for both internal and external stakeholders, advocating for and driving the strategy of digital business services.\nPartners with Service Designers and UX Strategists to facilitate workshops, interviews and co-creation sessions with stakeholders, and users to gather insights and validate requirements.\nActs as the Voice of the Customer, ensuring that user feedback is consistently integrated into product development.\nEstablishes and maintains transparent prioritization processes for features, enhancements, and fixes; ensuring all stakeholders are informed and aligned.\nDevelops and maintains product roadmap, ensuring they reflect the strategic direction of the organization and align with the user needs and business objectives.\nCollaborates with departments across the City to ensure alignment between digital business services and their respective goals, fostering cross-functional partnerships.\n\nData-Driven Decision Making:\nIdentifies opportunities for digital innovation by leveraging data insights and emerging technologies to enhance service delivery.\nStays up to date with the latest trends and developments in data analytics, AI and digital transformation to inform decision-making and product strategies.\nDefines and tracks key performance indicators (KPIs) that measure the success and impact of digital products and services.\nUtilizes analytics tools to gather and analyze both qualitative and quantitative data, ensuring decisions are based on reliable, real-time information.\nCollaborates with stakeholders to ensure data collection practices are aligned with business goals and needs.\nContinuously assess product and service performance, iterating and adjusting based on data-driven insights to optimize outcomes.\n\nBudgets, Costs and Revenue:\nDefines and implements cost models for digital products and services, ensuring alignment with organizational priorities and long-term sustainability.\nSets financial targets and performance metrics to track cost efficiency, revenue generation and value delivery.\nAdvocates for funding structures and resource allocation to support continuous service and product enhancements.\nCollaborates with the departments to identify policy, process and technology improvements that can reduce costs and enhance revenue streams.\nMonitors budgets and expenditures providing regular reporting to ensure transparency, accountability and alignment with financial goals.\nEvaluates and recommends investment opportunities in technology or processes that deliver measurable financial benefits to the City and its customers.\n\nService and Product Marketing:\nWorks with communication teams to create product launch plans, internal awareness campaigns and stakeholder updates.\nOversees development of naming and branding standards for services and supporting components.\nDevelops strategies to effectively market new digital services and encourages user adoption.\nEnsures services, products and features are communicated effectively to both internal teams and end users, aligning messaging with organizational goals.\n\nCompliance and Quality Assurance:\nEnsures all digital products and services comply with accessibility standards (e.g. WCAG), legal requirements and organizational policies.\nOversees the implementation of quality assurance (QA) processes, including testing, validation and issue resolution.\nMaintains documentation and reporting to ensure transparency and accountability in compliance efforts.\nCollaborates with legal and compliance teams to ensure adherence to relevant laws and policies.\n\nGeneral Duties:\nOther duties/responsibilities as assigned.\n\nMinimum Qualification Requirements\nEducation and Experience:\nBachelor’s degree in business administration, computer science, design or a related discipline.\nMinimum of 5 years of experience in product management, digital transformation or service delivery, with experience in managing end-to-end delivery of digital products and services. \nExperience working in the public sector, municipal government or a similar large complex organization environment, with a strong understanding of public service objectives and governance.\nExperience in managing teams using Agile methodologies, fostering collaboration across disciplines such as development, design and analytics.\nSuccess in leading iterative product development cycles, managing product backlogs and establishing clear prioritization frameworks.\nHands-on experience in service design or applying user-centered design principles to improve digital services in government, public sector or large organizations.\nCertification in Agile practices such as Certified Scrum Product Owner (CSPO), SAFe Product Owner/Product Manager or similar is highly preferred.\nCertification or training in product management frameworks (e.g. Pragmatic Institute, AIPMM) is an asset.\nCertification in service design, user-centered design or human-centered design principles are highly desirables.\nFamiliarity with ITIL (Information Technology Infrastructure Library) principles or certifications is an asset.\n\nKnowledge, Skills and Abilities:\nTechnical Expertise:\nProficiency in managing the end-to-end lifecycle of digital products.\nExpertise in product management frameworks (Agile, Scrum, Kanban).\nStrong knowledge of UX, service design principles and human-centered design.\nExperience with analytics tools, data visualization and performance metrics.\nFamiliarity with accessibility standards (e.g. WCAG) and digital compliance requirements.\nKnowledge of emerging technologies such as AI, machine learning and automation to drive innovation.\n\n \nProfessional Skills:\nAbility to develop and manage detailed product roadmaps.\nExperience in budget forecasting, cost modeling and defining funding structures.\nSkilled in product backlog management.\nCapacity to create and maintain documentation for service design.\nProven ability to implement transparent prioritization frameworks.\n\n \nLeadership and Communication:\nExpertise in leading multidisciplinary teams and build consensus across diverse stakeholders.\nStrong facilitation, negotiation and conflict resolution skills.\nAbility to mentor and develop team members.\nExceptional written and verbal communication skills tailored to diverse audience.\nAbility to create compelling presentations, reports and roadmaps.\nExperience in user research, stakeholder engagement and co-creation teams’ environments.\n\n \nAnalytical and Strategic Thinking:\nStrong analytical and critical thinking skills, with a focus on evidence-based decision making.\nAbility to align products with organizational priorities and long-term goals.\nAbility to manage multiple priorities in fast-paced, dynamic environment.\nProactive, innovative and forward-thinking approach to product management.\n\n \nCompliance and Quality Assurance:\nAbility to implement and monitor compliance frameworks and governance structures.\nExperience in quality assurance practices.\nSkilled in identifying risks and maintaining alignment with legal and accessibility requirements.\nWhere operationally appropriate and subject to change, the City of Vancouver has a Flexible Work Program. This program allows staff to work a hybrid work week from locations that are a daily commutable distance from their work at a City worksite.  At this time this position is eligible to be part of the Flexible Work Program.\n\nBusiness Unit/Department: IT, Digital Strategy & 311 (1070) \n\nAffiliation: Exempt \n\nEmployment Type: Temporary Full Time \n\nPosition Start Date: July, 2025 \n\nPosition End Date: November 30, 2026 \n\nSalary Information: Pay Grade RNG-091: $111,139 to $138,924 per annum\n\nApplication Close: June 17, 2025\n\nAt the City of Vancouver, we are committed to recruiting a diverse workforce that represents the community we so proudly serve. Indigenous peoples, people of colour, 2SLGBTQ+ persons including all genders and persons with disabilities are encouraged to apply.  Accommodations will be provided upon request during the selection process. Learn more about our commitment to diversity and inclusion. \n\nBefore you click Apply now\n\nOnce you start your application you can save your work and leave the applications page, however please remember to submit your profile to the specific job requisition before the posting closing date.\n\nIn addition to uploading your cover letter and resume, part of the application process may include answering application questions related to the preferred requirements of the role which may take approx. 5-10 minutes. Cover letters should express interest and highlight additional information relevant to the position and resumes should include a summary of skills and experience related to the position.\n\nApply here"
  },
  {
    "id": "7488a588-4cbc-4df3-91c6-72465eb5274c",
    "company": "City of Vancouver",
    "location": "Vancouver, BC",
    "position": "Security Attendant I",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105425",
    "source": "CivicJobs BC",
    "description": "Security Attendant I\nRequisition ID: 43899 \n\nOrganization\nLocated on the traditional, ancestral and unceded lands of the xʷməθkʷəy̓əm (Musqueam), Sḵwx̱wú7mesh (Squamish), and səlilwətaɬ (Tsleil-Waututh) Peoples, Vancouver has a commitment to becoming a City of Reconciliation. Vancouver consistently ranks as one of the world’s most liveable and environmentally sustainable cities. Named among Canada's Top 100 Employers, BC's Top Employers, and Canada's Greenest Employers, the City of Vancouver seeks colleagues who can help shape and embody our core commitments to sustainability, reconciliation, equity and outstanding quality of life for all residents.\n\nConsider joining our committed team of staff and being part of an innovative, inclusive and engaging workplace.  Working at the City of Vancouver and within the public service can be a rewarding career where you play a key role in ensuring impartial and equitable access to services, upholding ethical governance, and addressing the needs of citizens with integrity and dedication.\n\nMain Purpose and Function\nKnown as the “living room of the Downtown Eastside,” Carnegie Centre offers educational, recreational, cultural and social programming for the benefit of low income people of the Downtown Eastside.\n\nThe Security Attendant I is a front line position with primary responsibilities in relationship building with community members, and Centre safety, security, access control and incident response and reporting. Security Attendants work to ensure that the Centre is safe, welcoming and inclusive spaces for the public and staff. Violence prevention is a priority at the Centre. Security Attendants are expected to use defusing/de-escalating skills when responding to all volatile situations. Physical intervention is always a last resort.\n\nSpecific Duties/Responsibilities\nMonitoring entrances and facilitating access control of the facilities;\nMonitoring and upholding the Centre’s Cod of Conduct and standards of behaviour are being observed;\nMaking regular patrols of the building;\nProviding support in the event of an emergency including first aid and overdose response;\nUnderstanding the needs of and assisting patrons in a supportive manner by providing information and making referrals on the services and activities provided by the Centre and other community partners;\nAssisting with front desk clerical activities such as answering phones, distributing mail, simple data entry when needed;\nCommunicating information to other staff by way of log entries, incident reports and emails;\nCommunicating effectively using a two-way radio;\nMaintaining health and safety standards;\nReceiving routine deliveries;\nAbility to understand and uphold occupational health and safety policies and procedures\nPerforming janitorial and other duties as required.\n\nMinimum Qualification Requirements\nEducation and Experience:\nCompletion of Grade 10 (Grade 12 preferred);\nKnowledge of the Downtown Eastside community, local agencies, and services;\nConsiderable knowledge of the Carnegie Community Centre’s rules, services and operations\nExperience working in a community, social service or health care environment would be an asset\nOccupational First Aid Level I certification or the ability to obtain one would be an asset\nFluency in a second language would be an asset\n\nKnowledge, Skills and Abilities:\nConsiderable knowledge of the Downtown Eastside, agencies, services and resources\nConsiderable knowledge and understanding of addictions, mental illness, conflict resolution and violence prevention\nProven ability to establish and maintain effective working relationships\nProven ability to communicate effectively orally and in writing, including writing incident reports\nProven ability to work with minimal supervision\nProven ability to respond to incident using defusing and de-escalation techniques\nProven ability to respond to emergencies, walk long distances, and carry heavy items using moderate strength and agility\nA Police Record Check is a requirement of this position. A clearance requires the absence of any criminal charges or convictions related to this position.\n \n\nBusiness Unit/Department: Arts, Culture and Community Services (1200) \n\nAffiliation: CUPE 15 Non Pks \n\nEmployment Type: Temporary Full Time \n\nPosition Start Date: July 2025 \n\nPosition End Date: October 2025 \n\nSalary Information: Pay Grade GR-013: $27.04 to $31.66 per hour\n\nApplication Close: June 22, 2025\n\nAt the City of Vancouver, we are committed to recruiting a diverse workforce that represents the community we so proudly serve. Indigenous peoples, people of colour, 2SLGBTQ+ persons including all genders and persons with disabilities are encouraged to apply.  Accommodations will be provided upon request during the selection process. Learn more about our commitment to diversity and inclusion. \n\nBefore you click Apply now\n\nOnce you start your application you can save your work and leave the applications page, however please remember to submit your profile to the specific job requisition before the posting closing date.\n\nIn addition to uploading your cover letter and resume, part of the application process may include answering application questions related to the preferred requirements of the role which may take approx. 5-10 minutes. Cover letters should express interest and highlight additional information relevant to the position and resumes should include a summary of skills and experience related to the position.\n\nApply here"
  },
  {
    "id": "a7e39684-370f-419c-a6a1-6da8f20b149f",
    "company": "City of Vancouver",
    "location": "Vancouver, BC",
    "position": "Planning Assistant III",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105424",
    "source": "CivicJobs BC",
    "description": "Planning Assistant III\nRequisition ID: 44188 \n\nOrganization\nLocated on the traditional, ancestral and unceded lands of the xʷməθkʷəy̓əm (Musqueam), Sḵwx̱wú7mesh (Squamish), and səlilwətaɬ (Tsleil-Waututh) Peoples, Vancouver has a commitment to becoming a City of Reconciliation. Vancouver consistently ranks as one of the world’s most liveable and environmentally sustainable cities. Named among Canada's Top 100 Employers, BC's Top Employers, and Canada's Greenest Employers, the City of Vancouver seeks colleagues who can help shape and embody our core commitments to sustainability, reconciliation, equity and outstanding quality of life for all residents.\n\nConsider joining our committed team of staff and being part of an innovative, inclusive and engaging workplace.  Working at the City of Vancouver and within the public service can be a rewarding career where you play a key role in ensuring impartial and equitable access to services, upholding ethical governance, and addressing the needs of citizens with integrity and dedication.\n\nMain Purpose and Function\nThe Planning Assistant provides technical and professional support to the Rezoning Centre, with a focus on supporting the processing of rezoning applications and related functions, as well as contributing to a variety of rezoning and policy initiatives. The emphasis is on collecting and analyzing information, developing information graphics to communicate complex ideas, and assisting with public consultation and public hearings.\n\nSpecific Duties and Responsibilities\nCollects data and performs research and analysis.\nResponds to development and rezoning enquiries from the public.\nOrganizes public consultation processes and facilitating small group discussions.\nPrepares mailing lists, notifications and other related documents.\nReceives and summarizes public comments.\nMaintains web pages and social media accounts.\nPerforms skilled design and reproduction work relative and prepares presentations, public consultation information, and other graphic materials.\nProvides support for public hearings.\nCompletes basic built form analysis such as shadow and massing studies.\nPerforms other related duties/responsibilities as assigned.\n\nQualifications\nEducation and Experience:\nCompletion of grade 12 supplemented by courses in urban planning, graphics, and/or related courses or an equivalent combination of training and experience.\nUniversity degree in Planning would be considered an asset.\n\nKnowledge, Skills and Abilities:\nSound knowledge of zoning and land-use planning and regulations, land development economics, and urban design principles.\nSound knowledge of drafting, layout work, report design and reproduction and of graphical presentation of statistical data and planning projects.\nSound knowledge of the techniques and practices used in performing survey and statistical analyses work.\nWorking knowledge of Sketch Up (3D Software), MapInfo, Microsoft Office Suite and graphics programs (e.g. Adobe Creative Suite)\nAbility to work independently and participate on work teams and with the public \nAbility to complete assignments using sound professional techniques and judgment.\nAbility to self-manage workload and meet time demands (e.g., prioritize tasks, communicate expected time frames for the delivery of items with staff and request help when needed).\nStrong interpersonal and communications skills (written and verbal).\nResearch and analytical abilities, with an aptitude in the legal and technical aspects of planning work.\nStrong graphic skills are a requirement\nAbility to meet transportation needs\nFamiliarity with rezoning processes is preferred.\n\n\nWhere operationally appropriate and subject to change, the City of Vancouver has a Flexible Work Program. This program allows staff to work a hybrid work week from locations that are a daily commutable distance from their work at a City worksite.  At this time this position is eligible to be part of the Flexible Work Program.\n\nBusiness Unit/Department: Planning, Urban Design & Sustainability (1275) \n\nAffiliation: CUPE 15 Non Pks \n\nEmployment Type: Regular Full Time \n\nPosition Start Date: July 2025  \n\nSalary Information: Pay Grade GR-021: $37.2 to $43.78 per hour\n\nApplication Close: June 22, 2025\n\nAt the City of Vancouver, we are committed to recruiting a diverse workforce that represents the community we so proudly serve. Indigenous peoples, people of colour, 2SLGBTQ+ persons including all genders and persons with disabilities are encouraged to apply.  Accommodations will be provided upon request during the selection process. Learn more about our commitment to diversity and inclusion. \n\nBefore you click Apply now\n\nOnce you start your application you can save your work and leave the applications page, however please remember to submit your profile to the specific job requisition before the posting closing date.\n\nIn addition to uploading your cover letter and resume, part of the application process may include answering application questions related to the preferred requirements of the role which may take approx. 5-10 minutes. Cover letters should express interest and highlight additional information relevant to the position and resumes should include a summary of skills and experience related to the position.\n\nApply here"
  },
  {
    "id": "88d817b7-81a4-4896-af31-9aee90aa0636",
    "company": "City of Vancouver",
    "location": "Vancouver, BC",
    "position": "Capital Project Coordinator",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105423",
    "source": "CivicJobs BC",
    "description": "Capital Project Coordinator\nRequisition ID: 43567 \n\nOrganization\nLocated on the traditional, ancestral and unceded lands of the xʷməθkʷəy̓əm (Musqueam), Sḵwx̱wú7mesh (Squamish), and səlilwətaɬ (Tsleil-Waututh) Peoples, Vancouver has a commitment to becoming a City of Reconciliation. Vancouver consistently ranks as one of the world’s most liveable and environmentally sustainable cities. Named among Canada's Top 100 Employers, BC's Top Employers, and Canada's Greenest Employers, the City of Vancouver seeks colleagues who can help shape and embody our core commitments to sustainability, reconciliation, equity and outstanding quality of life for all residents.\n\nConsider joining our committed team of staff and being part of an innovative, inclusive and engaging workplace.  Working at the City of Vancouver and within the public service can be a rewarding career where you play a key role in ensuring impartial and equitable access to services, upholding ethical governance, and addressing the needs of citizens with integrity and dedication.\n\nMain Purpose and Function\nThe Project Coordinator assists with the development and delivery of the Capital Replacement Program and other construction projects, by involvement in the planning, development, and implementation of projects related to a wide variety of existing Park Board buildings and structures requiring building envelope and/or structural upgrades, addition of new amenities, and major infrastructure repairs or replacement.\n\nSpecific Duties/Responsibilities\nAssists with the development of the Community Centre Association (CCA) and Park Board Capital project planning by conducting detailed building condition audits and validating projects.\nLiaises with other Parks departments to define the project and builds a project schedule and budget which is reviewed by the Supervisor and involved facility Managers and shared with the service group. Provides regular updates on project schedule and budget to Manager and service group.\nCoordinates the preparation of Request for Proposals and tenders, including preparing the scope, schedule and requirements in order to meet project objectives and requirements.\nOversees the consultants’ preparation of drawings, specifications, contract documents during project definition phase for the repair, improvement, modification, and alteration of civil buildings and/or infrastructure. Engages stakeholders for design reviews and inputs. Reviews consultants’ drawings, specifications and contract documents to ensure conformance to project objectives and requirements.\nLiaises with Parks departments, consultants and contractors during construction to manage construction activities.\nCoordinates and manages the project and acts as a liaison between contractor, consultant, and civic departments to ensure desired results.\nAuthorizes changes, additions or deletions as required on approved projects including recommending approval of payments, and coordinating handover and commissioning activities.\nPerforms periodic inspections on completion of work for compliance with contract documents and deliverables\nExamines and checks plans in the preliminary and working drawing stages for suitability of layout, accuracy, economy and by-law conformity.\nRepresents civic departments in negotiating problems with contractors and consultants.\nTracks, updates and maintains formal records regarding the project during and after the project completion including coordinating handover and commissioning activities\nWrites detailed reports on assignments as required.\nEnsures for the provision of adequate supervision on the project.\nPerforms related work as required.\n\nMinimum Qualification Requirements\nEducation and Experience:\nGraduation from a diploma program. Diploma in Architectural and Building Technology, Construction Management, Civil or equivalent specialization from an accredited Technical School considerable experience at a sub-professional level preparing designs drawings, cost estimates and specifications, and providing construction project management or project coordination related to building envelope projects; OR an equivalent combination of training and experience related to building envelope projects, OR an equivalent combination of training and experience.\nFormal training in project management methodologies, preferably consistent with those provided by Project Management Institute (PMI)\n\nKnowledge, Skills and Abilities:\nThorough knowledge of project lifecycle, project management methodologies and project delivery processes applicable to the work performed.\nConsiderable knowledge of the principals of building systems design and operations, and considerable knowledge of architectural and engineering practices applicable to the work performed.\nThorough knowledge of Vancouver Building By-laws, ASHRAE 90.1 Energy Standard for Buildings Except Low-Rise Residential Buildings, WorkSafe BC, OHSA and Technical Safety BC governing the design, construction, repair, improvement, modification and alteration of buildings.\nThorough knowledge of the construction principles, methods, sequence, practices, materials and costs applicable to the work performed.\nWorking knowledge of the City of Vancouver’s building permit process and Provincial Regulations’ permit process.\nConsiderable knowledge of public procurement procedures and contract administration.\nWorking knowledge of safety and environmental hazards associated with the work.\nWorking knowledge of MS Office (Outlook, Word, Excel and Project), Adobe Acrobat, BlueBeam, SAP and AutoCAD.\nWorking knowledge of City of Vancouver’s environmental, risk management, safety and sustainability policies.\nStrong organizational skills.\nAbility to prepare technical drawings and specifications for work related to various building trades.\nAbility to read, analyze, assess and interpret technical drawings, specifications, contracts and other construction/ design documents for suitability of layout, accuracy, economy and by-law conformity.\nAbility to deal effectively and tactfully while maintaining cooperative working relationships with other civic departments, contractors, architects and consulting engineers.\nStrong conflict resolution skills when interacting with key stakeholders (internal/ external) and the public. Strong interpersonal skills to deal effectively and cooperatively with others.\nAbility to prepare cost estimates and project schedule.\nAbility to communicate clearly and concisely verbally and in writing.\nAbility to chair meetings with stakeholders (internal/ external).\nAbility to exercise sound judgement and decision-making.\nAbility to multitask and to be adaptive and flexible in a fast-paced and changing environment while delivering high quality and timely results under tight deadlines.\nAbility to work safely on construction sites including climbing up to the roof.\n\nRequired Licenses, Certificates and Registrations:\nClass 5 Driver’s License for the Province of British Columbia\n \nWhere operationally appropriate and subject to change, the City of Vancouver has a Flexible Work Program. This program allows staff to work a hybrid work week from locations that are a daily commutable distance from their work at a City worksite.  At this time this position is eligible to be part of the Flexible Work Program.\n\nBusiness Unit/Department: Board of Parks & Recreation (1400) \n\nAffiliation: CUPE 15 Parks \n\nEmployment Type: Temporary Full Time \n\nPosition Start Date: July, 2025 \n\nPosition End Date: July, 2026 \n\nSalary Information: Pay Grade GR-026: $45.62 to $53.91 per hour\n\nApplication Close: June 22, 2025\n\nAt the City of Vancouver, we are committed to recruiting a diverse workforce that represents the community we so proudly serve. Indigenous peoples, people of colour, 2SLGBTQ+ persons including all genders and persons with disabilities are encouraged to apply.  Accommodations will be provided upon request during the selection process. Learn more about our commitment to diversity and inclusion. \n\nBefore you click Apply now\n\nOnce you start your application you can save your work and leave the applications page, however please remember to submit your profile to the specific job requisition before the posting closing date.\n\nIn addition to uploading your cover letter and resume, part of the application process may include answering application questions related to the preferred requirements of the role which may take approx. 5-10 minutes. Cover letters should express interest and highlight additional information relevant to the position and resumes should include a summary of skills and experience related to the position.\n\nApply here"
  },
  {
    "id": "1e49f32b-eaf1-4e4f-ab6b-301497f0e6a3",
    "company": "City of North Vancouver",
    "location": "North Vancouver, BC",
    "position": "Infrastructure and Operations Manager",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105422",
    "source": "CivicJobs BC",
    "description": "City of North Vancouver\n\nInfrastructure and Operations Manager\n\n\nRegular Full-time\n\nThe City of North Vancouver is the urban core of the beautiful North Shore and has a long-term vision to be “The Healthiest Small City in the World”, with five key priorities to be a City for People, a Resilient City, a Vibrant City, a Connected City and a Prosperous City.\n \nWe are seeking a motivated and energetic regular full time Infrastructure and Operations Manager to join our progressive Information Technology team.\n \nReporting to the Chief Information Officer, you will be responsible for all Infrastructure and Operations (I&O) across the City’s on-premise and cloud landscape. You will set and implement the I&O strategy to maximize the success of business and IT enterprise initiatives which entails introducing innovative, differentiating infrastructure and operations capabilities that enhance the City’s overall competitive capabilities and enhance employee productivity. You will draw on your business acumen and strong relationship-building skills to play a key role in developing IT standards and procedures, managing vendors, preparing budgets and implementing the City’s goals. It is an exciting time in IT as the City begins modernization journey including the transition to Cloud. You will have the opportunity to create the roadmaps, set the standards and determine the pace of this interesting journey.\n \nYou will lead a small team of talented and dedicated IT professionals engaged in IT operations and support. Your ability to ride the technology elevator (speak to your team in technical language, while also speaking to the business in non-technical language) will be a strength you possess.  You are also a leader with the ability to inspire and motivate your team in a positive and forward-looking manner.\n \nYour academic credentials include a degree in computer science or related discipline, augmented by business courses and considerable IT management experience, or an equivalent combination of training and experience. You are known for your strong analytical and problem-solving capabilities, project management expertise, superior communication and interpersonal skills and for your reputation as an excellent manager and leader. Experience in compute, networking, storage, public web services and server virtualization, and/or experience in a local government environment, would be assets.  \n \nDuring the recruitment process, applicants will be requested to provide a current Police Information Check (PIC).\n \nWe offer an attractive remuneration and benefits package for this exempt position, including a compressed work schedule. The salary range is $119,964.00 - $141,132.00 annually (2024 rates). Salary offered will be commensurate with education, experience and internal parity.\n \nIf you’re passionate about making the City of North Vancouver an even greater place to live, apply on-line through the Career Portal at www.cnv.org by Friday, July 4, 2025.\n \nThank you for your interest in the City of North Vancouver.\n \nWe respectfully acknowledge that we live and work on the traditional and unceded territories of the Sḵwx̱ wú7mesh Úxwumixw (Squamish Nation) and səlilwətaɬ (Tsleil-Waututh Nation). The City of North Vancouver is committed to Reconciliation with these Nations, who have lived on these lands since time immemorial.\n \nPosting: 2025 – 0075"
  },
  {
    "id": "64ecbeb2-bf1f-4301-8987-2f5b50cac87d",
    "company": "City of Langley",
    "location": "Langley, BC",
    "position": "IT Support Specialist",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105421",
    "source": "CivicJobs BC",
    "description": "IT Support Specialist\n\n\nRegular Full-time\nFinancial Services Department\nCompetition #25-32\n \nLangley City, a community of approximately 33,000 positioned in a rapidly growing area is strategically located in Metro Vancouver and has a vibrant community spirit and an inspiring vision of being “The Place to Be” now and in the future. Langley City has all the amenities of any urban centre in very close proximity: great shopping, 300 acres of parks, world-class educational institutions, and entertainment facilities.\n \nLangley City is seeking a Regular full-time IT Support Specialist to join our talented team. Reporting to the Manager of Information Services, the successful candidate will be customer service focused and  provide technical assistance to staff using the City’s applications systems, network, computer workstations and phones. The IT Support Specialist also performs periodic and routine software installation and upgrades as well as the implementation of new equipment and systems. This position assists the Manager with the planning of information technology upgrades and improvements.  \n \nRATE OF PAY: Pay Grade 22 - $39.55 to $41.72 per hour (2024 CUPE rates).\n \nHOURS OF WORK: 35 hours per week, Monday to Friday.\n \nOur comprehensive benefits package is included.\n \nCompletion of a technical diploma in Computing and Information Technology plus two years related experience or Grade 12 supplemented by relevant courses in computer systems and applications; or an equivalent combination of training and experience is desired. Training and experience with VoIP phone systems, cellular phones and other mobile communication devices is an asset. The successful candidate for this role has excellent customer service, technical and troubleshooting skills. A valid Class 5 BC Driver’s Licence is required. Details of the position and its requirements can be found at www.langleycity.ca/careers.\n \nIf you would like to join a team committed to building a vibrant, healthy, and safe community together with current and future generations we invite you to apply. Please visit www.langleycity.ca/careers to submit your cover letter, resume, and a copy of your Personal Driving Record that has been obtained within six months of the closing date. (Contact ICBC or the driving authority where you reside to obtain your Personal Driving Record. Select the five-year option if obtaining online.) The closing date is July 4, 2025.\n \nLangley City appreciates the interest of all applicants. Only those under consideration will be contacted.\n \nThe City has a COVID-19 vaccination policy that is currently suspended. However, should the policy be reinstated, it will be a requirement for all current and future employees."
  },
  {
    "id": "9059d519-3cca-481e-8af7-348a8c41fe82",
    "company": "Tobacco Plains Indian Band",
    "location": "Grasmere, BC",
    "position": "Administrative Assistant",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105420",
    "source": "CivicJobs BC",
    "description": "Yaq̓it ʔa·knuqⱡi’it First Nation\nAdministrative Assistant\n\n\nCompetition #: 2025-09\n \nLocation: Yaq̓it ʔa·knuqⱡi’it First Nation’s administration office, Grasmere, B.C.\n\nPosition Summary:\nYaq̓it ʔa·knuqⱡi’it First Nation (Tobacco Plains Band) is a rural First Nation located near Grasmere, BC, in one of the most beautiful and natural parts of British Columbia.\n \nYaq̓it ʔa·knuqⱡi’it is seeking a friendly and organized Administrative Assistant to join the team. As the first point of contact for the Nation, the Administrative Assistant provides vital administrative and clerical support to help ensure the smooth day-to-day operation of the office. In this role, you’ll support staff and community members by handling a variety of tasks, including greeting visitors, answering phones, preparing documents, coordinating communications, and keeping the office organized. This position plays an important part in creating a welcoming, respectful, and culturally safe environment that reflects the values of Yaq̓it ʔa·knuqⱡi’it. If you're someone who enjoys working with people and creating positive interactions, we encourage you to apply.\n\nCultural Safety:\nOur organization is committed to serving the ʔakanuxunik̓ people in a manner that respects, enhances, and promotes their cultural identity and well-being of both the individual and the staff. This position is responsible for greeting community members and visitors with warmth, respect, and professionalism, supporting the cultural values, traditions, and practices of Yaq̓it ʔa·knuqⱡi’it in all communications and public interactions, and ensuring the confidentiality and dignity of all members and staff.\n\nKey Responsibilities:\n\nGreets and assists visitors and community members in person and over the phone; redirects calls and takes messages, as needed.\nCoordinates incoming and outgoing mail, including processing, distributing, and mailing letters and cheques.\nHandles email correspondence and general office communications.\nBooks meetings and meeting rooms, as required; manages the Master Calendar.\nOrders and picks up office supplies, rentals, and meeting lunches for all departments.\nSets up meeting rooms with snacks, beverages, and required materials.\nHandles external and internal administrative support tasks (e.g., photocopying, scanning).\nMaintains filing systems.\nDistributes memos, posters, notices, and other correspondence to staff and community members.\nKeeps electronic bulletin boards up to date with news and activities.\nAssists with updating the organization’s Facebook account; responds to messages and posts content.\nRefills daily snacks, coffee, and water for staff; sets up the office each morning.\nManages keys for all office-related access (vehicles, sheds, cabinets); maintains sign-out logs.\nHandles all incoming deliveries; organizes and identifies proper storage and recipients.\nSupports fleet management activities.\nOther duties, as assigned. \n\n\nQualifications: \nRequired Education and Experience:\n\nHigh school diploma or equivalent.\nPrevious administrative or receptionist experience preferred.\nBasic computer literacy and comfort with office software and equipment.\nValid Class 5 BC Driver’s License with clean drivers abstract. \n\n\nRequired Knowledge, Skills, and Abilities:\n\nStrong interpersonal and communication skills with a welcoming and respectful approach.\nReliable, organized, and detail-oriented with strong time management skills.\nAble to multitask and prioritize effectively in a busy office environment.\nProficient with Microsoft Office (Word, Excel, Outlook) and general office equipment.\nDemonstrated understanding of confidentiality, discretion, and professional boundaries.\nAbility to work independently and as part of a team.\nBasic knowledge of First Nation governance structures and community engagement practices.\nSensitivity and understanding of the unique cultural environment of a First Nation organization. \n\n\nCompensation:\n\nWage will be commensurate with skills and experience, ranging from $21.15 - $28.81 hourly.\nMedical, Dental, Disability and Life Insurance plans.\nPension Program.\nStandard benefits as a Federally Regulated Employer. \n\n\nApplication Process: \nPlease send your resume and cover letter by June 30, 2025, at 12:30pm (MST) to\n \nEmail: hr@tobaccoplains.org \n\nOr mail to:\nHuman Resources\nYaq̓it ʔa·knuqⱡi’it First Nation\nPO Box 76, Grasmere BC V0B 1R0"
  },
  {
    "id": "dda4f6d4-f621-4a59-99c7-f602c8a5790f",
    "company": "City of Fernie",
    "location": "Fernie, BC",
    "position": "Building Official Level 1",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105419",
    "source": "CivicJobs BC",
    "description": "Building Official Level 1\n\nCasual\nPosted June 13, 2025\n\nThe City of Fernie is inviting qualified applicants to train on a casual basis, with no guarantee of hours, to become a Building Official Level 1, for the Planning Department. This position will allow the successful candidate to begin building hours and education credits towards their Building Official Level I qualifications.\n\nThe expected outcome of the casual opportunity would be for the successful candidate to obtain the required training and qualifications to be able to undertake the duties of the Building Official Level 1- competently and efficiently when they are on vacation, or on leave. In addition, the trained employee may also assist the Building Officials during peak periods (April- September). This posting is posted internally and externally concurrently.\n\nPOSITION OVERVIEW\nThe Building Official in Training Level 1- Training, will use their skills, knowledge, and abilities to administer Federal and Provincial laws and Municipal bylaws related to the design and construction of all types of buildings and structures. The Building Official in Training ensures that the objectives of structural safety, fire safety, health, accessibility, and the protection of buildings are addressed prior to occupancy.\n\nDUTIES AND RESPONSIBILITIES\n\nAssess and report on the design, construction, and occupancy of all types of new and existing buildings and structures in accordance with the applicable laws and bylaws, following the appropriate qualification level scope of practice.\nReview and inspect construction, renovation, alteration, and addition, change in use, interior improvement and demolition of existing buildings, following the appropriate qualification level scope of practice.\nReview drawings, plans and specifications; investigate construction and renovation work; and communicate with stakeholders to determine and ensure compliance with applicable laws, bylaws, Codes and Standards.\nLiaise with Fire Rescue, Operations and Planning Departments, other agencies and organizations and other regulatory bodies involved with property development or any health, fire and life safety matters related to construction of buildings and other structures.\nPrepare statistical, summary, detailed and other reports.\nConduct building code, regulation and bylaw compliance reviews to confirm compliance.\nInitiate corrective actions related to unsafe conditions in new and existing constructions.\nEnforce law with Stop Work Orders, Orders to Secure, upgrade or demolish unsafe buildings or conditions.\nPrepare information for prosecution and/or injunction and provide expert testimony and issue Municipal Ticket Information.\nAssist in the development of local regulations and bylaws regarding health, fire, and safety.\nCollaborate with Bylaw Enforcement Officers, members of the planning department and other city departments.\nMay enforce and administer bylaws related to minimum acceptable property and building maintenance standards, heating, ventilating, solid fuel burning appliances, etc.\nMaintain familiarity with current and past Provincial and National Building Codes and Standards, Federal and Provincial legislation and Municipal bylaws pertaining to health, fire, and life safety in construction.\nMaintain familiarity with all aspects of the construction industry, including construction methods, procedures, practices, and materials.\nAll employees shall work in accordance with the City of Fernie’s Safety Management System. \n\n\nMINIMUM REQUIREMENTS\nRequired Qualifications\n\nGrade 12 or equivalent.\nValid Membership or eligibility for membership with Building Official’s Association of BC\nValid Class 5 B.C. driver's license.\nSuccessful completion of BOIT course. Alternatively, applicants who are enrolled in the BOIT course may be considered.\nEligible as BOIT Level 1 and POIT Level 1.\n\n\nKnowledge, Skills & Abilities\n\nTrades qualification in carpentry or plumbing; or completion of a post-secondary program in Building Technology.\nExcellent computer skills including in-depth knowledge and experience working in an MS Office environment.\nDemonstrate strong written, verbal and conflict resolution skills for effectively communicating with clients.\nAbility to enforce regulations tactfully and with firmness.\nAbility to tactfully handle confidential enquiries and information.\nThorough knowledge of BC Building and Plumbing Codes\nEffective interpersonal and organizational skills\nAbility to interpret maps and legal descriptions.\nSound knowledge of local Government bylaws, and associated Provincial and Federal statutes including, the Community Charter and Local Government Act.\nAbility to represent the City at Court hearings.\n\n\nCOMPETENCIES FOR SUCCESS\n\nProficient at presenting to various stakeholders and levels of authority.\nExperience with Vadim, iCompass an asset.\nDe-escalation training and/or Conflict Resolution training.\nEffective organizational skills with an ability to handle conflicting demands and priorities.\nWell developed report writing skills.\n\n\nLevel 1 Building Inspection Certificate\nAfter the successful candidate has successfully passed the BOIT Course, they must pass the BOABC Level 1 examination within one (1) year of commencement of the training program. If the successful candidate passes the Level 1 exam, they would then be eligible to apply for the BOABC Level 1 Certification upon completion of the required work experience of two years while employed at the City of Fernie. Once the candidate has achieved their BOABC Level 1 Certification, they must acquire BOABC Continuing Professional Development program credits on an ongoing basis to retain their Level 1 Certification. The cost of the BOABC Level 1 examination will be reimbursed to the successful candidate upon confirmation from BOABC that the candidate has achieved a passing grade.\n\nRATE OF PAY\nWages per the CUPE 2093 Collective Agreement for the; Building Official - Level 1 - Training is $41.68/ hour.\nBuilding Official - Level 1 - Certified is $44.53/ hour.  \n\nACKNOWLEDGEMENTS\nEmployees wishing to apply for this casual employment opportunity must provide a cover letter stating their desire to be considered for the Building Official- Level 1 Training opportunity and outline in a resume how they meet the minimum requirements and/or competencies for success listed above. This opportunity is posted internally/externally concurrently. We wish to express our appreciation to all applicants for their interest in applying for this position. However, only candidates selected for an interview will be contacted.\n\nThe application must be submitted by 12:00 PM, July 3, 2025, and should be addressed to:\n \nBruce Lennox, Director of Planning c/o Human Resources\nCity of Fernie, 501 – 3rd Ave, PO Box 190\nFernie, BC, V0B 1M0\nemail careers@fernie.ca\n \nThe City of Fernie strives to ensure that its employment practices are free from direct and indirect discrimination and is committed to upholding the human rights of those participating in the hiring process. In pursuit of this commitment, the City of Fernie will not condone or tolerate any acts of discrimination or harassment under any of the grounds protected under human rights legislation. This commitment extends to the hiring process and throughout the course of employment."
  },
  {
    "id": "f344822d-d52e-4b6b-9ada-88893a7e7e95",
    "company": "Uchucklesaht Tribe Government",
    "location": "Port Alberni, BC",
    "position": "Senior Biologist",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105418",
    "source": "CivicJobs BC",
    "description": "Uchucklesaht Tribe Government\nSenior Biologist\n\n\nLocation: Port Alberni, B.C.\n\nUchucklesaht Tribe Government (UTG) is a dynamic and progressive Maa-Nulth First Nation located on the West Coast of Vancouver Island. UTG has been self governing since treaty came into affect on April 1, 2011.\n \nThe Senior Biologist will lead environmental planning, habitat assessment, restoration, fisheries and wildlife management, and regulatory processes. They will also collaborate with leadership, community members, and external partners to develop conservation strategies aligned with our Nation's values and priorities.\n\nThis position provides opportunities to:\n\nLead biological assessments and conservation planning.\nProvide expert advice on resource management.\nDevelop environmental monitoring programs.\nConduct research on species at risk and climate change adaptation.\nDevelop policies and prepare technical reports.\nIntegrate Indigenous knowledge with Western science.\nRepresent UTG in discussions with governments and organizations.\nManage project budgets, contracts, and timelines.\nIdentify and apply for funding opportunities.\nMentor Nation staff and community members.\n\n\nQualifications and Experience:\n\nMasters Degree in Biology, Environmental Science, or related field.\nRegistered (or eligible) as a Registered Professional Biologist with the College of Applied Biologists of BC.\n7 plus years of experience in environmental assessment, resource management, or a related field.\nStrong knowledge of BC and federal environmental legislation including the Fisheries Act, Species at Risk Act, and Impact Assessment Act.\nExperience working with indigenous communities, and a strong understanding of indigenous governance, rates, and knowledge systems.\nExcellent project management skills, including budgeting and grant writing.\nProficiency in GIS and data analysis tools.\nKnowledge of climate change adaptation strategies and habitat assessment and restoration techniques.\nAbility to travel and work in remote settings and comfortable with variable weather conditions.\nAbility to lift up to 50 lbs.\nManual dexterity to operate field equipment, tools, and computer peripherals.\n\n\nInterested applicants are strongly encouraged to obtain a copy of the complete job description by contacting Lysa Ray, Executive Assistant, at lysa.ray@uchucklesaht.ca\n\nSalary Range and Benefits:\nUTG offers a competitive wage commensurate with qualifications and experience (between $80,000 - $95,000/year) and a comprehensive benefit plan (including dental plan, extended health benefits, optical plan, accumulated sick leave and Municipal Pension Plan).\n \nPlease submit a resume and cover letter no later than 4:30 pm on June 27, 2025 to:\n\nAttention:  Lysa Ray, Executive Assistant\nIn person/by mail: 5251 Argyle Street, Port Alberni, B.C. V9Y 1Vl\nEmailed to: Lysa.Ray@Uchucklesaht.ca (MS Word or PDF documents)\n \nWe thank you for your interest, however, only candidates selected for an interview will be contacted."
  },
  {
    "id": "04d97959-07a5-459f-bbab-c8d6666a054b",
    "company": "City of Richmond",
    "location": "Richmond, BC",
    "position": "Business Improvement Analyst",
    "postedDate": "3 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105417",
    "source": "CivicJobs BC",
    "description": "The City of Richmond is a diverse and dynamic community in pursuit of our vision\nto be the most appealing, livable and well-managed community in Canada.\n\nPeople l Excellence l Leadership l Team l Innovation\nImagine a career with the City of Richmond, a dynamic environment for growth and continuous improvement, fostered by our collective strengths and creativity. We are a vibrant, diverse cosmopolitan city, supported by a strong economy and recognized as leaders in innovation and service delivery excellence. The City of Richmond is committed to be the most appealing, livable, well-managed community in Canada, a goal that is only made possible by developing our most valuable asset – our people. This is a great opportunity to join our team and shape our community.\n\nBusiness Improvement Analyst\n\n\nOverview\nReporting to the Business Transformation Portfolio Manager, the Business Improvement Analyst plays a key role in driving the City’s business transformation efforts.  This position focuses on modernizing municipal service delivery and boosting organizational effectiveness and operational efficiency. The Analyst supports a variety of transformation initiatives, including process optimization, digital innovation, multi-channel service delivery, and enhancing the customer experience.\n\nKey responsibilities include conducting detailed analyses using continuous improvement methodologies, gaining a deep understanding of business operations, challenging existing processes and business rules, and facilitating service design workshops with cross-functional teams. The Analyst works to modernize service delivery and identify effective solutions to business challenges. Additionally, the role involves assessing the impact of proposed changes and collaborating closely with teams, offering expertise in service design, project management, implementation, change management, and performance measurement.\n\nExamples of key responsibilities include, but are not limited to:\n\nLead and support continuous improvement of internal and external services by identifying and recommending opportunities to improve processes, public-facing services, and customer experience.\nFacilitate service design with cross-functional groups to modernize service delivery, improve customer experience, and determine solutions to business problems, including changes to processes, policies, duties, or operating models.\nConduct workshops, fit/gap analyses, feasibility studies, and cost-effectiveness analyses; document, consolidate, and review needs; and prepare presentations to explain analyses and recommendations.\nAnalyze and document current business processes and operations to identify areas for automation or improvement; define future state requirements, including process maps and user stories.\nLead, design, and facilitate user acceptance testing (UAT) for new or improved services.\nSupport the implementation and adoption of process and service improvements by assessing implications of proposed changes.\nLead change management initiatives by creating communication strategies, coordinating and delivering training sessions, to ensure minimal disruption and successful adoption of organizational changes of varying scope and scale.\nSupport the development and implementation of corporate frameworks related to customer experience, performance measurement, change management and other disciplines related to business transformation. \nSupport the development and implementation of business transformation strategy and roadmap\nIdentify key business metrics and lead the development of dashboards and reports to provide operational and service delivery insights.\nTriage request intake by gathering information and conducting high-level analysis to define business goals or problem statements.\nCollaborate with stakeholders and cross-functional teams from IT, Business Transformation, and business units to support successful execution of initiatives and maintain positive working relationships\n\n\nKnowledge, Skills & Abilities:\n\nKnowledge of best practices in one or more of the following: process improvement, project management, service design, customer experience design, and change management.\nProven experience leading projects and cross-functional teams, including identifying problems, conducting root cause analysis, implementing effective solutions, and managing change to support successful implementation.\nStrong analytical, critical reasoning, and strategic thinking skills, with the ability to research, synthesize, and document data from diverse sources.\nEffective facilitation skills and a solid understanding of business process improvement methodologies, tools, and techniques.\nExcellent oral and written communication skills, including active listening, persuasive communication, and effective problem resolution.\nAbility to develop and implement strategic initiatives for stakeholders with competing priorities.\nDemonstrated ability to work both independently and collaboratively, maintain professionalism under pressure, and exercise sound judgment.\nSkilled in building trust, managing project timelines and deliverables, and demonstrating persistence in achieving objectives.\nAbility to advise managers on business improvement methods, identify operational challenges, and provide actionable recommendations.\nExperience with digital service design, digital transformation initiatives, and developing business improvement metrics and business intelligence tools is desirable.\n\n\nQualifications and Experience:\n\nA bachelor’s degree or diploma in Business Administration, Data Analysis, Local Government Administration, Business Analysis, or a related field.\nCompletion of one or more of the following designations is preferred:\nCertified Business Analyst Professional (CBAP)\nLean or Six Sigma certification\nProject Management Professional (PMP)\nCertified Customer Experience Professional (CCXP)\nChange Management certification (Prosci or equivalent)\nUser Experience certification\nData Analytics certification\nOver 5 years of related experience in Continuous Improvement, Digital Transformation, Customer Experience, and Corporate Organizational Performance Management, preferably in the public sector; experience in a unionized environment is desirable.\nBroad knowledge of local government functions, laws, regulations, and procedures, with an understanding of the City of Richmond's strategic priorities.\nExperience administering or supporting public-facing services in a municipal government environment is an asset\nAn equivalent combination of training and experience may be considered\n\n\nThe City of Richmond offers a competitive pay and benefits program, attractive incentives and a compressed work day schedule. If you are looking to make a difference, and to share our vision “to be the most appealing, livable, and well-managed community in Canada,” please submit your application by following the instructions below:\n\nThe City of Richmond uses an applicant tracking system for candidates wishing to view and apply for available career opportunities. For further information regarding position details and to apply, please visit our website at www.chooserichmond.ca.\n\nWe are accepting applications until July 4, 2025.\n\nWe thank all applicants in advance for their interest; however, only those under consideration will be contacted. If you are unsuccessful, please accept our appreciation for your interest."
  },
  {
    "id": "e9802daa-f22d-435a-acb2-840223d1d33e",
    "company": "City of Williams Lake",
    "location": "Williams Lake, BC",
    "position": "Accounting Clerk / Receptionist",
    "postedDate": "4 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105416",
    "source": "CivicJobs BC",
    "description": "City of Williams Lake\nAccounting Clerk / Receptionist\n\n\nFull Time\nCompetition 25-21\n\nPOSITION DETAILS:                    \nTITLE: ACCOUNTING CLERK / RECEPTIONIST\nOPERATIONS: Financial Services Department\nRATE: $30.58 per hour plus benefits\nHOURS OF WORK: 37.5 hours per week, pursuant to the Collective Agreement (flexible hours option)\nPOSITION: Union Affiliation\n \nWilliams Lake offers a unique combination of breathtaking natural scenery and urban living.\n\nA regional centre with all major amenities and an affordable range of residential opportunities from modern subdivisions and townhouses to large rural properties, Williams Lake is a great place to live, work, play, and raise a family.\n \nWilliams Lake has year-round opportunities for outdoor enthusiasts. In the winter, the Cariboo offers snowmobiling opportunities and excellent cross-country ski trails, as well as snowshoeing and ice fishing. We are also a short drive to excellent downhill ski hills. Williams Lake truly is the Shangri-La of mountain biking, boasting the largest bike park in British Columbia’s interior. The lake city is a great base for hiking, camping, four-wheeling, waterskiing, swimming, and sport fishing as well. Explore our many trails and take advantage of our beautiful parks, including the Nature Center, trails and walking bridge at Scout Island. Our indoor recreation facilities are top-notch, and recent upgrades to the Cariboo Memorial Recreational Complex include a water slide and training lanes, as well as a lazy river and beautiful fitness centre, in addition to two ice rinks.\n \nWilliams Lake’s downtown core offers a wide variety of shopping, dining and service opportunities. We have vibrant arts community, music scene and theatre company, and are proud to host a variety of arts and culture activities throughout the year.\n \nFrom the world-famous Williams Lake Stampede to weekly summer concerts and farmers markets to an impressive variety of recreation opportunities, Williams Lake offers excitement, relaxation, and a strong sense of community and belonging. We hope you will join us!\n \nGENERAL STATEMENT OF DUTIES:\nReporting directly to the Manager of Finance or designate, the Accounting Clerk/Receptionist performs a variety of accounting functions using established procedures, rules and practices. Duties include, but are not limited to: keeping accurate accounting records; preparation of accounts payable; posting records of collection; performing arithmetic computations; switchboard, cashier and counter inquiries; posting of journal entries; typing and secretarial duties of the finance department; keeping accurate accounting records.\n \nSUPERVISION:\nThe incumbent shall be responsible to the Manager of Finance.\n \nMAJOR DUTIES AND RESPONSIBILITIES:\n\nResponsible for accounts payable, including day to day processing of invoices, date entry, reconciling supplier statements, preparation of accounts payable reports and dealing with suppliers\nResponsible for managing credit cards for the organization, and posting transactions.\nPost transactions to individual accounts and ledgers\nAssisting in posting moderate to routine utility and property tax adjustments\nAssisting in setting up of new utility accounts and module maintenance\nEntering a consumption data for metered commercial utility billing\nCollect payments for fees, rents, taxes, permits, deposits, and licenses\nCollect, prepare, verify and coordinate computer data relating to customer/vendor invoices, knowledge of accounts payable functions\nResponsible for BC Assessment Authority and Land Registry changes\nTrace lost invoices and payments using a computer database\nResponsible for administration of downtown parking rentals\nPosting of various departments journal entries\nProcessing and entering of EFT payments\nResponsible for maintaining the mortgage holder database\nEnter and retrieve billing or payment data from computer terminal\nRespond to tax, utility, and general accounting inquiries, as well as assist with providing various reports to departments and organizations\nCreate documents related to the work utilizing electronic spreadsheet programs\nResponsible for the administration and tracking of Grants\nResearch and identify grant funding opportunities for community and regional projects and programs and communicate potential funding sources to appropriate staff.\nProvide regular updates on Grant status and update tracking document\nAssist with preparation of grant funding submissions for priority community projects and programs\nMaintaining calendar to ensure timely submission of letters of inquiry, proposal deadlines, and reports\nPrioritizing projects to keep multiple projects moving in a timely manner, meet deadlines and manager supplemental material required for proposals.\nWork with Project Managers to ensure deadlines are met.\nSorting and distribution of departmental and organizational mail\nResponsible for custody and reconciliation of Petty Cash Fund\nDepartmental telephone inquiries\nOperate and maintain a variety of office machines and equipment such as copier, fax machine, postage machine, computer and related word processing and spreadsheet software\nMaintain daily, bi-weekly, quarterly and annual reconciliations and reports for BC Transit\nGreet persons arriving at Municipal Hall, determine nature and purpose of their visit, and direct or escort them to specific destinations\nResponsible for ordering and pick up of office supplies and ensuring supply room is stocked and tidy\nDemonstrate continuous effort to improve operations, streamline work processes, and work cooperatively towards an efficient and effective work environment.\nOther related duties as required\n\n \nREQUIRED KNOWLEDGE, SKILLS AND ABILITIES:\nPreferred Knowledge of:\n\nprinciples and practices of electronic bookkeeping;\nmodern office practices, procedures and equipment, accurate keyboarding skills and extensive knowledge of computers;\nmunicipal finance related Acts and Regulations;\nprinciples and practices of accounting and auditing including general ledger, debit, credit, journal entries and audit procedures;\ndevelopment and use of complex spreadsheets;\ndepartmental goals, objectives, policies, and procedures; and\npolicies and procedures of the work of the Municipality\n\n \nAbility to:\n\nhandle sensitive and delicate public relations situations with a high degree of professionalism and compassion;\nassist in the preparation of annual financial statements\nreview, develop, test and maintain accounting systems;\nanalyze and reconcile various accounts;\nprepare and review accounting entries;\ncreate accurate spreadsheets;\nWillingness to learn new technology or software;\ncommunicate orally in the English language with customers, clients, and the public;\nkeep privileged information confidential;\nmake decisions and exercise resourcefulness in meeting new problems;\nperform day-to-day administrative tasks such as maintaining information files and processing paperwork, providing information to supervisors, co-workers and outside organizations or citizens;\nreview documents for completeness and accuracy;\nwork under pressure handling problems, tasks, and changing priorities which come up simultaneously and/or unexpectedly;\nunderstand and follow oral and written instructions;\ndevelop specific goals and plans to prioritize, organize, and accomplish work;\nwork independently, exercising sound judgment and common sense; and\nwork effectively and maintain harmonious relationships with co-workers, management and elected officials\n\n \nQUALIFICATIONS, SKILLS & EXPERIENCE:\n\nCompletion of Grade 12 education\nMinimum 1-year municipal experience and 2 years experience in a similar accounting position\nPost-Secondary courses in Accounting or progression in an accounting program such as CPA\nCompletion of a certificate or courses specific to Grant Writing preferred\nMicrosoft Office training\nStrong writing skills including grammar and spelling\nAttention to details is essential.\nStrong research and analytical skills.\nFamiliarity with MAIS software preferred \nValid BC driver’s license\nMinimum typing speed of 50 words per minute with accuracy\nAbility to deal with the public effectively and courteously\nAbility to use discretion and maintain confidentiality\nAbility to work with others as a team\nMust display professional attitude and demeanor\n\n \nInterested candidates are invited to submit a detailed resume and cover letter outlining qualifications, experience, copies of applicable certifications, and letters of reference no later than 4:00 pm, Friday, June 27, 2025, to the attention of Ashley Williston, Director of Human Resources, City of Williams Lake, 450 Mart Street, Williams Lake, BC, V2G 1N3 - Fax (250) 392-8484, or email awilliston@williamslake.ca\n \nPlease note that only shortlisted candidates will be contacted"
  },
  {
    "id": "5aea5792-6a86-45a4-834f-68de21fc4bd7",
    "company": "Métis Nation British Columbia",
    "location": "Cranbrook, BC",
    "position": "Peer Support Worker",
    "postedDate": "4 days ago",
    "url": "https://www.civicjobs.ca/jobs?id=105415",
    "source": "CivicJobs BC",
    "description": "Métis Nation British Columbia\n\nPeer Support Worker\n\n\nCompetition #\n25-077\n\nCompensation\n$51,000-$59,000\n\nClassification\nNation Support 1\n\nLocation\nCranbrook\nHybrid\n\nPeriod of Employment\nTemporary\n\nEnd Date of Position\nTue, 03/31/2026 - 12:00\n\nHours Per Week\n37.5\n\nHours of Work\nFull Time\n\nDate Posted\nJune 13, 2025\n\nClosing Date\nJune 27, 2025\n\nAbout the Opportunity\nThe Peer Support Worker provides and shares their own lived/living experience of substance use and mental health to assist individuals in their own personal journeys. While identifying themselves as a peer, we work with individuals to provide support to fit the individual needs and situational requirements of the peers we are working with. From a lived experience perspective, peer support workers share services and knowledge from MNBC and other external community resources more effectively to help those we are building relationships with. This role requires an element of physical demand and a large portion of time spent on-foot walking long distances and carrying a significant amount of weight for supplies. There is high probably that Peer Support Workers will have to navigate traumatic, high-risk situations (such as overdose, witnessing active substance use, and aggressive interactions) which naturally creates a high-stress work environment.\n\nDoes this role sound perfect to you, yet you don’t check every box?\nWe at MNBC realize that qualifications and experiences may look different for everyone.  If this career opportunity is of interest to you and your experience may not perfectly align with every qualification, we still encourage you to apply. \n\nMNBC thanks all applicants for their interest. Pursuant to Section 41 of the BC Human Rights Code, preference may be given to applicants who self-identify as Indigenous (First Nation, Métis, or Inuit). All qualified candidates are encouraged to apply. Only applicants shortlisted for interview will be contacted.\n\nWe strive to provide an accessible candidate experience for our candidates with different abilities. If you require any accommodations to support you through the application process, please reach out to the People & Culture department at hr@mnbc.ca.\n\nDoes this role sound perfect to you, yet you don’t check every box?\nWe at MNBC realize that qualifications and experiences may look different for everyone.  If this career opportunity is of interest to you and your experience may not perfectly align with every qualification, we still encourage you to apply. \n\nMNBC thanks all applicants for their interest. Pursuant to Section 41 of the BC Human Rights Code, preference may be given to applicants who self-identify as Indigenous (First Nation, Métis, or Inuit). All qualified candidates are encouraged to apply. Only applicants shortlisted for interview will be contacted.\n\nWe strive to provide an accessible candidate experience for our candidates with different abilities. If you require any accommodations to support you through the application process, please reach out to the People & Culture department at hr@mnbc.ca.\n\nAbout Métis Nation British Columbia\nMétis Nation British Columbia (MNBC) develops and enhances opportunities for our Métis communities by implementing culturally relevant social and economic programs and services. Through teamwork, respect, dedication, accountability, integrity, and professionalism, MNBC strives to build a proud, self-governing, sustainable Nation in recognition of inherent rights for our Métis citizens, assisting in the delivery of services based on policy, process, and specified regulations.\n\nMNBC reflects an equitable, diverse, and inclusive work environment. We respect the unique characteristics, backgrounds, and experiences that our employees bring to the organization and the communities we serve. We are committed to lateral kindness based on Métis cultural values that promote social harmony and healthy relationships.\n\nHow To Apply\nEmail: careers@mnbc.ca\n\nPlease submit your cover letter, resume, and a copy of your credentials to careers@mnbc.ca, using \"Peer Support Worker - #25-077\" in the subject line of the email.\n\nJob Description"
  }
]